[
  {
    "eventId": "tccc20",
    "title": "Getting Started with ASP.NET Core 1.0 in Visual Studio Code",
    "abstract": "Microsoft new cross-platform ASP.NET framework promises to appease those seeking modularization and performance improvements. Out with the kitchen sink that is the System.Web assembly, and in with the new. Couple this with a lightweight, cross-platform code editor which comprehends ASP.NET Core 1.0, and developers around the world rejoice. So let’s dive in! Open Visual Studio Code, and choose File -> New -> Project, right? Not quite!<br><br>This talk will explore how to get started with ASP.NET Core 1.0, from the ground up, using Visual Studio Code. Along the way, we’ll discuss new features and how to take advantage of them in your applications.",
    "author": "Scott Addie",
    "authorBio": "Scott Addie is an ambitious, self-driven software architect & technical evangelist specializing in JavaScript and the modern Microsoft web stack. He is a Microsoft Certified Solutions Developer (MCSD – Web Applications), a Visual Studio Code Insider, a frequent conference, code camp, and user group attendee, an ASP.NET and JavaScript blogger, and a technical speaker who has been developing enterprise web applications professionally since 2005.",
    "authorEmail": null,
    "authorUrl": "https://t.co/eJZBltzRVC",
    "authorTwitter": "@Scott_Addie",
    "authorGitHub": null,
    "room": "Rapson 31",
    "hour": 8.5,
    "pictureUrl": "https://pbs.twimg.com/profile_images/657706218241167360/wbQTuaE4_400x400.png",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5540000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/14",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3769535Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3769535",
      "@etag": "01000000-0000-CBE3-0000-00000000004F",
      "SerializedSizeOnDisk": 1723
    }
  },
  {
    "eventId": "tccc20",
    "title": "Busting .NET Myths",
    "abstract": "Structs and classes. Disposable objects. Asynchronous code. Both C# and the .NET Framework have a ton of features and capabilities within, but sometimes erroneous information is spread about how they work. In this session, we'll set things straight on a number of topics so you know exactly what's going with your code.",
    "author": "Jason Bock",
    "authorBio": "Jason Bock is a Practice Lead for Magenic (http://www.magenic.com) and a Microsoft MVP (C#). He has 20 years of experience working on a number of business applications using a diverse set of frameworks and languages such as C#, .NET, and JavaScript. He is the author of \"Metaprogramming in .NET\", \"Applied .NET Attributes\", and \"CIL Programming: Under the Hood of .NET\". He has written numerous articles on software development issues and has presented at a number of conferences and user groups. He is a leader of the Twin Cities Code Camp (http://www.twincitiescodecamp.com). Jason holds a Master's degree in Electrical Engineering from Marquette University. Visit his web site at http://www.jasonbock.net.",
    "authorEmail": null,
    "authorUrl": "http://www.jasonbock.net/",
    "authorTwitter": "@jasonbock",
    "authorGitHub": null,
    "room": "Rapson 100",
    "hour": 9.75,
    "pictureUrl": "https://pbs.twimg.com/profile_images/467736259515797504/NeueR5Qc_400x400.png",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5550000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/7",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3769535Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3769535",
      "@etag": "01000000-0000-CBE3-0000-000000000050",
      "SerializedSizeOnDisk": 1609
    }
  },
  {
    "eventId": "tccc20",
    "title": "Voxel Art for Games: From Qubicle to Unity",
    "abstract": "Programmer's rejoice! Don't settle by filling your games with hastily drawn MS Paint scribbles. Learn how to quickly, easily, and cheaply build voxel art, a blocky 3D art style popularized in games such as Minecraft and Crossy Road. We'll look at the basic building blocks (pun intended) of creating models in Qubicle (http://qubicle-constructor.com) a 3D voxel art editor. Then we'll apply basic animation techniques using the freely available Blender (https://www.blender.org/) software package and finish it up by getting that art up and running in a scene within Unity (http://unity3d.com/).",
    "author": "Matt Christian",
    "authorBio": "Matt Christian is a full time software developer in a traditional development job by day and indie game developer by night. He holds both a Bachelors degree in Applied Mathematics and Computer Science: Software Development from the University of Wisconsin - Stout, and an Associates degree in Information Technology - Programmer/Analyst from Northcentral Technical College. In 2014 he started Subject Matter Games, a small indie game studio in central Wisconsin and is developing Super Wall Crash, a procedurally generated infinite runner for mobile devices. Find out more about Matt and his projects at http://www.insidegamer.org or more about Subject Matter Games at http://www.submattergames.com.",
    "authorEmail": null,
    "authorUrl": "http://www.submattergames.com",
    "authorTwitter": "@matchristian",
    "authorGitHub": null,
    "room": "Rapson 58",
    "hour": 14.25,
    "pictureUrl": "https://pbs.twimg.com/profile_images/691244537956532224/N_HVeGA3_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5550000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/6",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3769535Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3769535",
      "@etag": "01000000-0000-CBE3-0000-000000000051",
      "SerializedSizeOnDisk": 1905
    }
  },
  {
    "eventId": "tccc20",
    "title": "Introduction to Real-Time Notifications With SignalR",
    "abstract": "As the user experience becomes more important, real-time push notifications are an important tool for web developers to master. Learn how to build real-time server-to-client and client-to-server push services in ASP.NET using SignalR. SignalR makes it incredibly simple to build communication hubs for real-time notifications, peer-to-peer collaboration, and real-time content delivery. SignalR is flexible, extensible and scalable. We will cover setting up a complete MVC5 application using both the Javascript client API and the .NET client. There are several transport protocols available depending on which server and client platforms you are using. We will discuss these options as well as extending, scaling and customizing SignalR.",
    "author": "Anne Bougie",
    "authorBio": "Anne Bougie is a senior software engineer with Skyline Technologies. She has been a developer for 18 years in the Fox Cities area working as a consultant in a variety of companies and industries. She has worked with many platforms and languages with a focus on Microsoft technologies. She specializes in MVC, Javascript, Azure, application design, and developer mentoring.",
    "authorEmail": null,
    "authorUrl": "http://www.geekswithblogs.net/AnneBougie/Default.aspx",
    "authorTwitter": "@bougiefever",
    "authorGitHub": null,
    "room": "Rapson 45",
    "hour": 14.25,
    "pictureUrl": "https://media.licdn.com/mpr/mpr/shrinknp_200_200/p/2/000/048/3c3/2d5816c.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5550000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/16",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3779534Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3779534",
      "@etag": "01000000-0000-CBE3-0000-000000000052",
      "SerializedSizeOnDisk": 1752
    }
  },
  {
    "eventId": "tccc20",
    "title": "Cross-Platform Continuous Mobile Deployment",
    "abstract": "Agile is all about the continuous cycle of development and feedback solicitation but mobile platforms introduce added complexity: how do you get your app out to all your testers or stakeholders across all the platforms so they can give you the feedback you need to refine it? In this session we’ll explore one way to do this across all the major platforms: Windows 10, iOS, and Android and throw in cross-platform Continuous Integration to boot!",
    "author": "Brandon H",
    "authorBio": "Brandon is a Principle Mobile Architect for Dow Jones in Minneapolis and has been doing mobile development since 2010. You can find him on twitter at @bc3tech or on the web at http://bc3.tech.",
    "authorEmail": null,
    "authorUrl": "https://about.me/bc3tech",
    "authorTwitter": "@bc3tech",
    "authorGitHub": null,
    "room": "Rapson 45",
    "hour": 8.5,
    "pictureUrl": "https://pbs.twimg.com/profile_images/378800000331918104/7b867cb6c510a285eaf5d252aae4d0bc_400x400.gif",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5550000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/15",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3779534Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3779534",
      "@etag": "01000000-0000-CBE3-0000-000000000053",
      "SerializedSizeOnDisk": 1259
    }
  },
  {
    "eventId": "tccc20",
    "title": "What the Heck is WebAssembly, and do I Have to Learn C Now?",
    "abstract": "Three years ago, Mozilla began experimenting with a low-level subset of JavaScript that supported ahead-of-time compilation and eliminated garbage collection pauses. The experiment worked: Programs written in C and compiled to this intermediate language, called asm.js, could deliver runtime performance within 1.5x of their native C speed. In contrast to Google's Native Client (NaCl / PNaCl) projects, asm.js remained backwards compatible with existing JavaScript engines.<br><br>Clearly, there was room for performance improvement on the Web, and a way to get there without breaking old browsers.<br><br>Last year, Apple, Google, Microsoft, and Mozilla formed a W3C Community Group to collaborate \"on a new, portable, size- and load-time-efficient format suitable for compilation to the web.\" They called it WebAssembly, and it starts landing in browsers this year.<br><br>Suddenly, JS isn't the only game in town: programs will be written in C, compiled to WebAssembly, and run faster than JavaScript ever could. Is this the end? Do we all have to learn C? Come to the talk and find out!",
    "author": "Dan Callahan",
    "authorBio": "Dan Callahan is a Staff Software Engineer in Mozilla's Developer Relations team, where he focuses on Firefox add-ons and Servo parallel browser engine project. Dan previously worked on the Mozilla Persona project, an attempt at replacing passwords with user friendly public key cryptography built on open web standards.<br><br>Dan tweets as @callahad and swears he has every intention to blog at http://dancallahan.info.",
    "authorEmail": null,
    "authorUrl": "http://dancallahan.info/",
    "authorTwitter": "@callahad",
    "authorGitHub": null,
    "room": "Rapson 58",
    "hour": 8.5,
    "pictureUrl": "https://pbs.twimg.com/profile_images/576841343793655808/-7TXbZgD_400x400.jpeg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6360000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/22",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3779534Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3779534",
      "@etag": "01000000-0000-CBE3-0000-000000000054",
      "SerializedSizeOnDisk": 2130
    }
  },
  {
    "eventId": "tccc20",
    "title": "Introduction to Speech Interfaces for Web Applications",
    "abstract": "Speaking with your computing device is becoming commonplace. Most of us have used Apple's Siri, Google Now, Microsoft's Cortana, or Amazon's Alexa - but how can you speak with your web application? The Web Speech API can enable a voice interface by adding both Speech Synthesis (Text to Speech) and Speech Recognition (Speech to Text) functionality.<br><br>This session will introduce the core concepts of Speech Synthesis and Speech Recognition. We will evaluate the current browser support and review alternative options. See the JavaScript code and UX design considerations required to add a speech interface to your web application. Come hear if it's as easy as it sounds?",
    "author": "Kevin Hakanson",
    "authorBio": "Kevin Hakanson (@hakanson) is an Sr. Software Architect for Thomson Reuters where he is focused on highly scalable web applications, especially the JavaScript and security aspects. His background includes both .NET and Java, but he is most nostalgic about Lotus Notes. He has been developing professionally since 1994 and holds a Master’s degree in Software Engineering. When not staring at a computer screen, he is probably staring at another screen, either watching TV or playing video games with his family.",
    "authorEmail": null,
    "authorUrl": "http://about.me/kevin.hakanson",
    "authorTwitter": "@hakanson",
    "authorGitHub": null,
    "room": "Rapson 56",
    "hour": 8.5,
    "pictureUrl": "https://pbs.twimg.com/profile_images/3660694165/3f57eb62f0059337cb4e4d376f956b42_400x400.png",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6360000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/21",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3789533Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3789533",
      "@etag": "01000000-0000-CBE3-0000-000000000055",
      "SerializedSizeOnDisk": 1823
    }
  },
  {
    "eventId": "tccc20",
    "title": "Programming Rocket Ships for No Good Reason",
    "abstract": "Who says that programming must be practical? Let's throw caution to the wind and explore kOS — a programmable autopilot for Kerbal Space Program. It's a wild west where there are no standard libraries, no classes, and no try/catch blocks! But there are real problems to solve, including PID controllers, orbital maneuver calculations, and even machine learning.<br><br>Join us as we write dangerous code that launches brave Kerbals into outer space on wobbly rockets in a video game. For science!",
    "author": "Kevin Gisi",
    "authorBio": "Kevin Gisi is fascinated by the intersection of computing, games, and outer space. When not goofing around on side-projects, he can be found slinging Ruby and JavaScript code for Mashable.",
    "authorEmail": null,
    "authorUrl": "https://www.linkedin.com/in/gisikw",
    "authorTwitter": "@cheerskevin",
    "authorGitHub": null,
    "room": "Rapson 56",
    "hour": 14.25,
    "pictureUrl": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/8/000/2a1/3e3/3cbbbd7.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6360000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/29",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3789533Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3789533",
      "@etag": "01000000-0000-CBE3-0000-000000000056",
      "SerializedSizeOnDisk": 1299
    }
  },
  {
    "eventId": "tccc20",
    "title": "Deconstructing Laravel to Rebuild a Personal Backend-as-a-Service",
    "abstract": "Laravel is a popular PHP MVC framework, using the common design pattern to separate concerns, improve performance, and organize code. We will break down and understand the base components of the framework, and then rebuild it in a way that is as framework-agnostic as possible. Then we will add some features to turn it into a 'Backend-as-a-Service' that you can use to speed up the development of your web, mobile, or IoT projects! Lastly, we will build classes in both JS and Objective-C to demonstrate how to talk with our newly created backend.",
    "author": "Sreenath Pillai",
    "authorBio": "Sreenath Pillai is an entrepreneur and software development veteran. He has been programming as a hobby since the age of 8, having the great privilege of using his Dad's Sun workstations. Since then, he has worked with a ton of companies in the Madison, WI area and started his own consultancy. He has spent over 10 years immersed in the academic, industrial, and startup scenes of the tech world. He is most passionate about listening to and helping people, building things, and thinking.",
    "authorEmail": null,
    "authorUrl": "http://flow-enterprises.com",
    "authorTwitter": "@nathcoder",
    "authorGitHub": null,
    "room": "Rapson 54",
    "hour": 9.75,
    "pictureUrl": "https://pbs.twimg.com/profile_images/1325492857/sreenath3_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6370000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/28",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3969550Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3969550",
      "@etag": "01000000-0000-CBE3-0000-000000000057",
      "SerializedSizeOnDisk": 1660
    }
  },
  {
    "eventId": "tccc20",
    "title": "Intro to Ethereum",
    "abstract": "We've all heard of Bitcoin by now, but what's the next step in blockchain technology? How about a distributed, decentralized turing complete computer in the cloud? That's the premise behind Ethereum, a new blockchain that takes the technology pioneered by Bitcoin to the next level. In this session I'll give an overview of what Ethereum can do, and then walk you through a simple hello world Ethereum application in both the Mix IDE and the geth command line client.",
    "author": "Mike Rosack",
    "authorBio": "Mike Rosack has been working as a Solutions Consultant at Omni Resources in Appleton, WI for 5 years. He's spent most of his career working on all sorts of .NET projects, but recently has been working on MEANer things. He's very sad that Calvin Johnson retired.",
    "authorEmail": null,
    "authorUrl": "https://www.linkedin.com/in/mrosack",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "Rapson 43",
    "hour": 14.25,
    "pictureUrl": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/3/000/1f0/1f5/0104be6.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6370000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/27",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3969550Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3969550",
      "@etag": "01000000-0000-CBE3-0000-000000000058",
      "SerializedSizeOnDisk": 1305
    }
  },
  {
    "eventId": "tccc20",
    "title": "Freaky Fast Delivery - Responsive Performance Strategies",
    "abstract": "Want to learn how to build freaky fast sites that load within the mythical one-second barrier? In this talk, we’ll explore the latest techniques we can apply to create responsible sites the achieve this goal. Topic discussed will include:<ul><li>Traditional vs enhanced page loading techniques</li><li>Loading JavaScript, CSS, fonts and content asynchronously</li><li>Compression techniques for requests, images, and assets</li><li>Caching techniques via Browser cache and Web storage</li><li>Performance budgets, anti-patterns, and monitoring tools</li></ul>",
    "author": "Brad Broulik",
    "authorBio": "Brad Broulik is an author, trainer, and principal web engineer specializing in enterprise mobile development at HealthPartners. His recent book is Pro jQuery Mobile. He blogs at http://bradbroulik.blogspot.com and tweets via @BradBroulik.",
    "authorEmail": null,
    "authorUrl": "http://bradbroulik.blogspot.com/",
    "authorTwitter": "@BradBroulik",
    "authorGitHub": null,
    "room": "Rapson 56",
    "hour": 9.75,
    "pictureUrl": "https://pbs.twimg.com/profile_images/1280547293/image_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6370000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/25",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3979550Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3979550",
      "@etag": "01000000-0000-CBE3-0000-000000000059",
      "SerializedSizeOnDisk": 1413
    }
  },
  {
    "eventId": "tccc20",
    "title": "Business Driven Development",
    "abstract": "Business Driven Development is a development methodology based on communication between the business customers, the developers, and the testers. BDD encompasses many of the same practices as Specification by Example, Acceptance Test Driven Development (ATDD), Example-Driven Development (EDD), and Story Test-Driven Development (SDD). All these processes aid developers and testers in understanding the customer’s needs prior to implementation and allow customers to be able to converse in their own domain language. This talk will focus on why we need to do BDD, How we can include BDD into our development process, the advantages and challenges in implementing BDD. Examples for this talk will be in .Net/SpecFlow. If you are a Developer, Tester, Business Analyst, Product Owner or a stakeholder in a software development project this talk will show you how you could build products with in-built quality and value and can be extended easily.",
    "author": "Benoy John",
    "authorBio": "Benoy John is a Software Engineering Professional/Agile Developer Coach with experience in all phases of product development and design aspects. He continues to help organizations to figure out better ways to deliver value through improving software development practices and improving business process. He works as Technical Mentor/Coach at both the Leadership and Team levels, building the supporting agile adoption framework, providing agile adoption guidance to leadership, and working with the team on the execution of proven practices and techniques that bring agility to the projects. He is actively involved in Agile Coaching, mentoring, training and building high performance professional agile teams. He has great passion in Test Driven Development, Business Driven Development and Domain Driven Design practices in software development and believes in collaboration and team work for success. Follow @benoyjohnv",
    "authorEmail": null,
    "authorUrl": "http://valayathil.blogspot.com/",
    "authorTwitter": "@benoyjohnv",
    "authorGitHub": null,
    "room": "Rapson 54",
    "hour": 14.25,
    "pictureUrl": "https://pbs.twimg.com/profile_images/378800000754039812/c1c9b58d829b85ef1fff6612e84fc2d9_400x400.jpeg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6370000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/36",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4037895Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4037895",
      "@etag": "01000000-0000-CBE3-0000-00000000005A",
      "SerializedSizeOnDisk": 2486
    }
  },
  {
    "eventId": "tccc20",
    "title": "DevOps In Action",
    "abstract": "DevOps aims to remove hurdles from getting features deployed to production by standardizing and automating the delivery pipeline, and Agile processes aim to make the act of development itself more efficient and incremental.<br><br>The session will begin with a short intro to Release Management followed by an end to end demo of deploying and testing an ASP.NET 5, MVC 6 application in a Docker container to a Linux machine in Azure using Release Management online. We will be using the latest Build and Release Management UI from Visual Studio Team Services and Release Management Online. Attend this session so you can understand how things are changing and what tools are available to help you keep pace with the developer evolution.",
    "author": "Dave Strebel",
    "authorBio": "Dave Strebel currently serves as Cloud Technical Specialist for Microsoft, with a long term focus on distributed system design and cloud computing technologies. Dave brings over 15 years of hands-on experience in the architecture of distributed and virtualized systems. On the side, he is the organizer of the Minnesota Cloud Foundry and Docker Meetups.",
    "authorEmail": null,
    "authorUrl": "https://github.com/dstrebel",
    "authorTwitter": "@hybridcloud_guy",
    "authorGitHub": null,
    "room": "Rapson 31",
    "hour": 9.75,
    "pictureUrl": "https://pbs.twimg.com/profile_images/714174329991331842/O11VKeJw_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6380000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/35",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4039525Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4039525",
      "@etag": "01000000-0000-CBE3-0000-00000000005B",
      "SerializedSizeOnDisk": 1673
    }
  },
  {
    "eventId": "tccc20",
    "title": "Open Source Software for Microsoft Developers",
    "abstract": "In today's world it has become virtually impossible to write software without using open source tools, libraries, or frameworks. Even if you avoid \"third party\" open source components, Microsoft is open sourcing more and more of .NET itself that it is inescapable. So should you be worried? Didn't Steve Ballmer tell us open source was bad and dangerous? Well, there are things you should know about open source in terms of licensing, maintainability, support. Many are things you need to think about when using ANY code you didn't write yourself, whether open source or not. By the end of this session you'll understand where open source does and doesn't differ from traditional proprietary tools, libraries, and frameworks. You might still be worried, but you'll understand WHY you are worried.",
    "author": "Rockford Lhotka",
    "authorBio": "Rockford Lhotka is the CTO of Magenic, and is the creator of the widely used CSLA .NET development framework. He is the author of numerous books, and regularly speaks at major conferences around the world. Rockford is a Microsoft Regional Director and MVP. Magenic (www.magenic.com) addresses your toughest, most complex software development challenges and delivers results. For more information go to www.lhotka.net.",
    "authorEmail": null,
    "authorUrl": "http://www.lhotka.net/",
    "authorTwitter": "@RockyLhotka",
    "authorGitHub": null,
    "room": "Rapson 31",
    "hour": 14.25,
    "pictureUrl": "https://pbs.twimg.com/profile_images/555774892277116928/gaNy7cRE_400x400.jpeg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6380000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/32",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4039525Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4039525",
      "@etag": "01000000-0000-CBE3-0000-00000000005C",
      "SerializedSizeOnDisk": 1824
    }
  },
  {
    "eventId": "tccc20",
    "title": "Six Reasons Sandstorm.io is Rocking the World of Open Source Web Apps",
    "abstract": "Sandstorm describes itself as \"an open source operating system for personal and private clouds.\"<br><br>In this session, we will go over the features that make Sandstorm the ideal platform for distributing and hosting open source web apps, then go over the brilliantly simple process of getting Sandstorm installed on your own server. Packaging (or porting) an app to run on the platform will also be covered.",
    "author": "Dan Kraft",
    "authorBio": "Though Dan's primary residence is the internet, he currently dwells in Wausau, WI. He is employed as a full-stack web developer for Roastar Inc, a company who produces attractive labeling and flexible packaging for companies in niche markets like coffee roasting and cannabis products.<br><br>A true master of none, he enjoys creating music, reading books, and playing Dungeons & Dragons. He is passionate about open source software, and hopes his GitHub profile will properly reflect that... someday.<br><br>You can find him online at http://frigginglorio.us/. His band, The Essentials (http://essentials.rocks/) will be releasing an EP shortly.",
    "authorEmail": null,
    "authorUrl": "http://frigginglorio.us/",
    "authorTwitter": "@frigginglorious",
    "authorGitHub": null,
    "room": "Rapson 43",
    "hour": 9.75,
    "pictureUrl": "https://pbs.twimg.com/profile_images/682033832439058432/T8vIoF-t_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6380000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/31",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4039525Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4039525",
      "@etag": "01000000-0000-CBE3-0000-00000000005D",
      "SerializedSizeOnDisk": 1688
    }
  },
  {
    "eventId": "tccc20",
    "title": "TypeScript In Action",
    "abstract": "Do you want to learn how to automatically generate strongly-typed Angular services for your Web API? What about Knockout view models that stay synced with your server-side code? In this session, we will walk through a sample application that leverages TypeScript, Angular2, and ASP.NET MVC/Web API. You will learn how TypeScript can help augment your development experience and your existing knowledge as a Javascript developer by adding type safety, OO concepts, and ES6 features to your codebase. If you consider yourself a C# or .NET developer and do Javascript on the side, TypeScript is a great fit for all the paradigms you're used to. If you work in a Linux or Mac world, you’ll still be able to leverage TypeScript with cross-platform tooling. Come and learn something that might help you become more productive and make your applications more robust and less scary to refactor. The speaker recommends watching his previous TypeScript Demystified talk for a grounding in the concepts of TypeScript but it’s not required.",
    "author": "Kamran Ayub",
    "authorBio": "Kamran Ayub is a Web Applications Consultant working at General Mills doing DevOpsy work who is passionate about technology and sharing his experiences with others. On the side, he works on his passion project Keep Track of My Games, has contributed to multiple open source libraries, travels around the world when he finds the time, and attempts to balance his coding and gaming hobbies, often unsuccessfully. He’s been in the web and software industry for over a decade, working on multiple development teams within General Mills for over 5 years. Follow him @kamranayub or on his blog, kamranicus.com.",
    "authorEmail": null,
    "authorUrl": "http://kamranicus.com/",
    "authorTwitter": "@kamranayub",
    "authorGitHub": null,
    "room": "Rapson 43",
    "hour": 8.5,
    "pictureUrl": "https://pbs.twimg.com/profile_images/2319233356/filb50s4xaftitgj10sc_400x400.jpeg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6380000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/9",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4049545Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4049545",
      "@etag": "01000000-0000-CBE3-0000-00000000005E",
      "SerializedSizeOnDisk": 2218
    }
  },
  {
    "eventId": "tccc20",
    "title": "The Definitive Guide to the Flux Pattern for React",
    "abstract": "React is a JavaScript framework that makes a radical departure from the MV* frameworks that have been inundating the development space for the last several years. With this radically new approach comes a pattern to replace the common paradigm of two-way data-binding MV* frameworks. This pattern is known as \"Flux.\" While React has been gaining steam for a couple of years now, the Flux pattern is still a relative mystery to most of us.<br><br>In this talk, we'll start with a quick recap of React to get everybody up to speed. Then we'll dive into the nuts and bolts of the Flux pattern, investigate some of the more popular Flux frameworks and make sure you walk away fully understanding this enigma.",
    "author": "Vince Bullinger",
    "authorBio": "Vince has been a passionate developer and consultant since 2005. He is currently an independent contractor. He received his MCSD for .NET with C# back in 2008. In recent years, he's immersed himself in front end technologies. Even more recently, he's developed a passion for mobile development, specifically of the cross-platform variety. Outside of work, he's a husband and father and enjoys sports, games and learning everything about everything.",
    "authorEmail": null,
    "authorUrl": "http://vincebullinger.com/",
    "authorTwitter": "@vbullinger",
    "authorGitHub": null,
    "room": "Rapson 54",
    "hour": 8.5,
    "pictureUrl": "https://pbs.twimg.com/profile_images/64445273/MiniMe.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.6390000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/10",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4049545Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4049545",
      "@etag": "01000000-0000-CBE3-0000-00000000005F",
      "SerializedSizeOnDisk": 1747
    }
  },
  {
    "eventId": "tccc20",
    "title": "Tour d’Azure 2016 – New Killer Features That’ll Blow You Away",
    "abstract": "In the 7 years since Microsoft introduced Azure, the public cloud has evolved and come to terms with the needs in today's marketplace for a virtualized computing infrastructure that you and provision and deploy what you need when you need it and pay just for what you use. Platform as a Service (PaaS) has come a long way as well, and with the latest incarnation of Application Services (which includes Web, Mobile, API and Logic Apps) a developer is able to quickly and efficiently use the cloud to deliver solutions faster than ever. Microsoft Azure has changed a lot since it was released and in this talk we'll show you some great new compelling features that make all the difference.",
    "author": "Mike Benkovich",
    "authorBio": "Energy, laughter, and a contagious passion for coding—Mike brings it all with him. In a career that has taken him from minion to business owner, from database administrator (DBA) to developer, from author to evangelist, Mike has seen it all. In more than 25 years of working in the technology industry, he has been part of the latest waves to sweep the industry, and he is compelled to share it all. Whether delivering MSDN Events live or webcast presentations, whether on the developer resource site www.BenkoTips.com or his blog, Mike brings enthusiasm for the tools and an energy for the search to find an better way. Join us each week to see what's new in \"BenkoTIPS Live and On-Demand\" as he helps developers explore the possible.",
    "authorEmail": null,
    "authorUrl": "http://www.benkotips.com/",
    "authorTwitter": "@mbenko",
    "authorGitHub": null,
    "room": "Rapson 43",
    "hour": 11,
    "pictureUrl": "https://pbs.twimg.com/profile_images/2680092022/1a98a8f0f69a2fd1906f137251bc0d99_400x400.jpeg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7240000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/17",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4049545Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4049545",
      "@etag": "01000000-0000-CBE3-0000-000000000060",
      "SerializedSizeOnDisk": 2070
    }
  },
  {
    "eventId": "tccc20",
    "title": "The Why and How of Dependency Injection",
    "abstract": "Many frameworks use dependency injection to improve testability and allow for runtime dependency configuration. In this session we further discuss the motivation of this approach and implement a service locator in an ASP.NET MVC project. Related topics covered along the way include inversion of control and reflection.",
    "author": "Sean MacAvaney",
    "authorBio": "Sean is a Software Engineering student at Milwaukee School of Engineering (MSOE) and a Junior Web Developer at iit/SourceTech. Topics that interest Sean include web technologies, machine learning, and embedded systems. When he’s not behind the keyboard, you will probably find him pedaling a bicycle, nocking an arrow, or casting a line.",
    "authorEmail": null,
    "authorUrl": "https://macavaney.us/",
    "authorTwitter": "@seanmacavaney",
    "authorGitHub": null,
    "room": "Rapson 43",
    "hour": 13,
    "pictureUrl": "https://pbs.twimg.com/profile_images/674034792317378560/hjytFRJ9_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7240000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/20",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4049545Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4049545",
      "@etag": "01000000-0000-CBE3-0000-000000000061",
      "SerializedSizeOnDisk": 1259
    }
  },
  {
    "eventId": "tccc20",
    "title": "Extending Visual Studio and Making It Work for You",
    "abstract": "Did you know there's a Visual Studio SDK? By now everyone's heard talk of the .NET Compiler Platform (\"Roslyn\") but there's also a world of other extensibility points in Visual Studio. Templates, menu commands, tool windows, and even customizations to the editor itself can all be tapped to add new functionality to keep you in the IDE longer making you more productive. There will be lots of demos to show off some of the features and the session will wrap up by talking about getting an extension in the Visual Studio Gallery so it can be shared with the world.",
    "author": "Jason Lattimer",
    "authorBio": "Jason Lattimer is a Sr. Technical Architect with PowerObjects and a Microsoft MVP for Business Solutions. Other interests outside of developing custom solutions for Dynamics CRM include Azure, mobile, and developer tools. You can often find him helping out in the MSDN and Dynamics Community forums, talking to user groups, and occasionally putting some helpful tools on CodePlex & GitHub. Twitter: @JLattimer Blog: http://jlattimer.blogspot.com",
    "authorEmail": null,
    "authorUrl": "http://jlattimer.blogspot.com/",
    "authorTwitter": "@JLattimer",
    "authorGitHub": null,
    "room": "Rapson 56",
    "hour": 13,
    "pictureUrl": "https://pbs.twimg.com/profile_images/3684202102/4d1a90a3212022920f6f4da3883ac132_400x400.jpeg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7310000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/8",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4059540Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4059540",
      "@etag": "01000000-0000-CBE3-0000-000000000062",
      "SerializedSizeOnDisk": 1643
    }
  },
  {
    "eventId": "tccc20",
    "title": "Advanced Topics in F#",
    "abstract": "You know that F# .NET's functional programming language. You know that it supports default immutability, functions as types, and type inference, and even OOP. But do you know about the other awesome language features like pattern matching, discriminated unions, sequences, mailbox processors, type providers, and a plethora of other awesome tools? Learn how F# can make you productive in your day to day work using these awesome language features.",
    "author": "Jeremy Abbott",
    "authorBio": "I'm a developer at Shreveport development shop Praeses, where I work as a project architect, developer, and recruiter. I work hard to deliver clean, extensible, and maintainable solutions to customers' business problems. I'm passionate about software as a profession and craft and work to cultivate that mindset in my team members through constant training. When I'm not writing code I'm advocating for LGBT equality.",
    "authorEmail": null,
    "authorUrl": "https://github.com/jeremyabbott",
    "authorTwitter": "@mrjabbott",
    "authorGitHub": null,
    "room": "Rapson 58",
    "hour": 11,
    "pictureUrl": "https://az697891.vo.msecnd.net/speakerphotos/7dd5a2bb-0eae-4af2-bcd7-de2912b6dfe5.png",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7310000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/3",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4059540Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4059540",
      "@etag": "01000000-0000-CBE3-0000-000000000063",
      "SerializedSizeOnDisk": 1460
    }
  },
  {
    "eventId": "tccc20",
    "title": "Live Coding Sound Responsive OpenGL Fragment Shaders",
    "abstract": "This presentation will be an introduction/crash course into using OpenGL Fragment Shaders for live-coding graphics. I will be using an open source toolkit, The Force, designed around WebGL and run in Google Chrome or Firefox. The toolkit is hosted on github, so participants have the option of following along. http://shawnlawson.github.io/The_Force/<br><br>We will cover: a brief explanation of the tool, how it’s constructed, how it works, a quick tour around the basic functionalities of the OpenGL Fragment Shader language, how to work with coordinate space, function generators within the toolkit, some simple examples, and finally integrating an audio source for creating sound responsive graphics.",
    "author": "Shawn Lawson",
    "authorBio": "Shawn Lawson is an experiential media artist creating the computational sublime. As Obi-Wan Codenobi, he live-codes, real-time computer graphics with his open source software, The Force. He has performed or exhibited in England, Scotland, Spain, Denmark, Russia, Italy, Korea, Portugal, Brazil, Turkey, Malaysia, Iran, Canada, and the USA. He received grants from NYSCA and the Experimental Television Center, and he has been in residence at CultureHub and Signal Culture. Lawson studied at CMU and ÉNSBA. He received his MFA in Art and Technology Studies from SAIC. He is an Associate Professor in the Department of Art at RPI.",
    "authorEmail": null,
    "authorUrl": "http://www.shawnlawson.com/",
    "authorTwitter": "@EachTweetCounts",
    "authorGitHub": null,
    "room": "Rapson 58",
    "hour": 13,
    "pictureUrl": "https://pbs.twimg.com/profile_images/2164896818/LawsonNA_400x400.png",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7310000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/11",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4059540Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4059540",
      "@etag": "01000000-0000-CBE3-0000-000000000064",
      "SerializedSizeOnDisk": 1947
    }
  },
  {
    "eventId": "tccc20",
    "title": "How To Mentor Jr. Devs Without Losing Your Mind",
    "abstract": "Have you ever had to take on a junior developer? Do you get questions that seem like they've come out of left field? Are you sick of doing the busy work that they should be doing? We'll explore what it takes to take a junior from green to gold without feeling like you're about to lose it!",
    "author": "Alec Wojciechowski",
    "authorBio": "Alec Wojciechowski is an experienced senior software developer, having worked at nearly a dozen different companies around the Twin Cities. Recently, he has had the pleasure of teaching complete newbies the craft of software development in a 12 week boot camp put on by The Software Guild in downtown Minneapolis. In addition, he takes new, passionate software developers in entry level roles and helps them reach their full potential. When he's not writing code or mentoring, he's probably somewhere above the Twin Cities in a Cessna 150.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "Rapson 31",
    "hour": 11,
    "pictureUrl": "http://3t7bol18ef963l8x6yzv7ja1.wpengine.netdna-cdn.com/wp-content/uploads/Alec_400sq.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7310000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/24",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4069548Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4069548",
      "@etag": "01000000-0000-CBE3-0000-000000000065",
      "SerializedSizeOnDisk": 1419
    }
  },
  {
    "eventId": "tccc20",
    "title": "Date and Time Odds, Ends and Oddities",
    "abstract": "Did you know that sometimes midnight doesn't happen? That some years have 53 weeks? That javascript will interpret \"2016-01-01\" and \"01/01/2016\" differently? That certain libraries can drastically improve the developer experience with date and time?<br><br>Date and time is a complicated and under-appreciated problem in programming, but it affects nearly ever application ever made. Using code examples in JavaScript, we will go through the oddities and edge cases of date and time that every developer should take into consideration when writing modern applications. You will come out of this talk feeling more prepared to tackle date and time in your code, no matter what programming language you use.",
    "author": "Maggie Pint",
    "authorBio": "Maggie Pint is the Web Development Manager at TempWorks Software. She spent the first several years of her career working as a SSRS developer and accidental DBA before converting into a full-stack ASP.NET developer. She currently specializes mostly in Angular JS, but there is a special place in her heart for bridging the gap between developers and DBAs. In her spare time, Maggie shows and breeds Australian Shepherds, hangs out with her three year old son, and engages in a constant battle of technical one-upmanship with her husband Joe – also a .NET developer.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "@maggiepint",
    "authorGitHub": null,
    "room": "Rapson 31",
    "hour": 13,
    "pictureUrl": "https://pbs.twimg.com/profile_images/657629683220021248/levj6wJ0_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7310000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/12",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4069548Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4069548",
      "@etag": "01000000-0000-CBE3-0000-000000000066",
      "SerializedSizeOnDisk": 1847
    }
  },
  {
    "eventId": "tccc20",
    "title": "HoloLens: This Isn't Your Grandmother's VR -- This is AR",
    "abstract": "<ul><li>\"Hologram\" (noun): an image that is projected in a way that makes it appear three-dimensional.</li><li>\"Augmented Reality\" (noun): superimposed computer-generated images on a user's view of the real world.</li><li>\"HoloLens\" (noun): an awesome wearable holographic computer that lets you see, hear and interact with holograms in any environment!</li></ul>Are you ready to dive into Augmented Reality? Ready to see how we can inject our very own generated holographic images into any environment? Ready to see not only how we interact with the holograms but how those holograms react to us? Me to…<br><br>Join Lance Larsen fresh back from the Microsoft //BUILD conference -- where HoloLens was center stage!",
    "author": "Lance Larsen",
    "authorBio": "Lance Larsen (www.LanceLarsen.com | @lancelarsen) is an avid community speaker -and- president of the Madison .NET developer community (www.MADdotNET.com).<br><br>Lance is the owner of HoloSoft (www.HoloSoft.net) and consults with companies to build the future with the latest .NET technologies -- if you have a AR / VR project you or your company needs assistance with, let me know. :)<br><br>Lance is also one of the original organizers for That Conference (www.ThatConference.com) - August 8th - 10th, 2016 - the original Summer Camp for Geeks in the Wisconsin Dells!",
    "authorEmail": null,
    "authorUrl": "http://www.lancelarsen.com/",
    "authorTwitter": "@lancelarsen",
    "authorGitHub": null,
    "room": "Rapson 45",
    "hour": 11,
    "pictureUrl": "https://pbs.twimg.com/profile_images/3661268999/497aec9b0ea0ef3aa197e34b0e7a228a_400x400.png",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7310000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/18",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4069548Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4069548",
      "@etag": "01000000-0000-CBE3-0000-000000000067",
      "SerializedSizeOnDisk": 1928
    }
  },
  {
    "eventId": "tccc20",
    "title": "Rethink Frontend Development With Elm",
    "abstract": "Come explore Elm, a functional programming language for making web things. Elm aims to solve some of the same problems that Ember, React, and Angular 2 solve, but in a radically different way. Strong and static typing ensures that data you pass around in your apps really is what you think it is. A simple and tried-and-true architecture makes it easy to understand, and great tooling makes it fun to use.<br><br>In this talk, we'll explore how we use Elm to build our user interface and our code, and we'll take an honest look at where Elm can make a difference for you, and where it falls short. By the end of the talk, you'll know how to get started and have all the resources you need to explore Elm on your own.",
    "author": "Brian Hogan",
    "authorBio": "Brian Hogan is a programmer who loves to teach other programmers. He currently works with Elixir and Ruby, building applications to help people learn faster.",
    "authorEmail": null,
    "authorUrl": "http://bphogan.com",
    "authorTwitter": "@bphogan",
    "authorGitHub": null,
    "room": "Rapson 100",
    "hour": 11,
    "pictureUrl": "https://pbs.twimg.com/profile_images/683416517455695872/DxDhO4LH_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7320000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/1",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4133136Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4133136",
      "@etag": "01000000-0000-CBE3-0000-000000000068",
      "SerializedSizeOnDisk": 1460
    }
  },
  {
    "eventId": "tccc20",
    "title": "PJAX Driven Architecture",
    "abstract": "Front End (targeting, and \"the two classes you probably don't know about 'processed', and 'unprocessed' \")<br><br>Back End (sessions/cookies, variable passing)<br><br>Middle (the front to back end communications)",
    "author": "Kevin Stanton",
    "authorBio": "Ex Merchant Marine (Professional Sailor). PHP Software Engineer. Meetup Fanatic (JavaScriptMN, mn-php, h-f-minneapolis, NodeMN, tcdnug, et al). Interests: Reducing Cloud Loads, Passing less Data on network. Inspirations to speak: Asked Questions about AJAX that got me thrown out of Javascript Stackoverflow chats, Asked at a javascript meetup about making ajax fed data \"shiny\" which left people scratching their heads",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "@kevin_stanton",
    "authorGitHub": null,
    "room": "Rapson 45",
    "hour": 13,
    "pictureUrl": "https://pbs.twimg.com/profile_images/413324440/n128722057646_1237_1__400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7320000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/23",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4133807Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4133807",
      "@etag": "01000000-0000-CBE3-0000-000000000069",
      "SerializedSizeOnDisk": 1203
    }
  },
  {
    "eventId": "tccc20",
    "title": "Launching a Software Business",
    "abstract": "Are you tired of building someone else’s product? Are you tired of building yet another business application? Are you itching to build something amazing? Join our panel conversation and Q&A with real developers who’ve started and built software businesses. Let’s talk about the failures and successes, the fears and arrogance in starting a business. Bring your questions and let’s startup.",
    "author": "Todd Gardner and Jordan Griffin",
    "authorBio": "Jordan Griffin has been professionally developing software for a decade and is currently a partner at TrackJS(https://trackjs.com) as well as an independent consultant. The scope and scale of his work has varied from local to international, two person projects to two hundred person projects. Jordan believes the key to success for a project of any size, no matter whether you own the company or not, is pride of ownership. Todd H. Gardner is the president and co-founder of TrackJS (trackjs.com) and an independent software consultant. With over a decade of experience building software systems, Todd has built large enterprise systems, complex software products, and launched businesses. Todd is a veteran of software conferences and an international speaker.",
    "authorEmail": null,
    "authorUrl": "http://trackjs.com",
    "authorTwitter": "@toddhgardner",
    "authorGitHub": null,
    "room": "Rapson 100",
    "hour": 14.25,
    "pictureUrl": "https://pbs.twimg.com/profile_images/479976283204358144/ACiTP2w9_400x400.jpeg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7320000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/13",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4133807Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4133807",
      "@etag": "01000000-0000-CBE3-0000-00000000006A",
      "SerializedSizeOnDisk": 1765
    }
  },
  {
    "eventId": "tccc20",
    "title": "A Developer's Guide to Finding Optimal Solutions",
    "abstract": "Solving problems that have more than one possible solution is something every developer will be asked to do over the course of his or her career. Figuring out the best way to utilize the capacity of a device or machine, finding the shortest path between two points, or determining the best way to schedule people or events are all problems where mathematical optimization techniques can be used to quickly and efficiently find solutions.<br><br>In this introduction to mathematical optimization designed specifically for software developers, we will explore some of the foundational techniques for solving these types of problems, and add several of these methods to your toolbox so that you can put them to work for your customers. Since this is a session for developers, we'll keep it in terms that work best for us. That is, we'll go heavy on the code and lighter on the math.",
    "author": "Barry Stahl",
    "authorBio": "Barry is a .NET Software Engineer who has been creating business solutions for enterprise customers for more than 25 years. Barry is also an Election Integrity Activist, baseball and hockey fan, husband of one genius and father of another, and a 30+ year resident of Phoenix Arizona USA. When Barry is not traveling around the world to speak at Conferences, Code Camps and User Groups or to participate in GiveCamps, he spends his days as Principal Application Architect for Crew Systems at American Airlines, the worlds largest airline, and his nights thinking about the next Arizona GiveCamp, an annual event where software developers come together to build websites and apps for some great non-profit organizations.<br><br>You can follow Barry on Twitter @bsstahl or read his blog at http://www.cognitiveinheritance.com.",
    "authorEmail": null,
    "authorUrl": "http://www.cognitiveinheritance.com/",
    "authorTwitter": "@bsstahl",
    "authorGitHub": null,
    "room": "Rapson 54",
    "hour": 1,
    "pictureUrl": "https://pbs.twimg.com/profile_images/324942332/twitterProfilePhoto_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7320000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/33",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4139541Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4139541",
      "@etag": "01000000-0000-CBE3-0000-00000000006B",
      "SerializedSizeOnDisk": 2319
    }
  },
  {
    "eventId": "tccc20",
    "title": "DevOps Tools, Explained for Developers",
    "abstract": "Maybe you've watched a few videos about devops tools like Vagrant, Docker, or Microsoft Release Management. You know they represent the future, but you're not sure why to use them, how to apply them, or how they work together. Join Dan as he briefly explains the DevOps movement, and then demonstrates real-world usage of these DevOps tools.",
    "author": "Dan Nordquist",
    "authorBio": "Dan Nordquist got his start speaking at Code Camps in 2010, and has since spoken around the country with Modern Apps Live. Dan works at Magenic as a consultant, and is passionate about technology, mentoring, DevOps, agile teams, and process improvement.",
    "authorEmail": null,
    "authorUrl": "https://about.me/nordquist",
    "authorTwitter": "@dnord",
    "authorGitHub": null,
    "room": "Rapson 100",
    "hour": 13,
    "pictureUrl": "https://pbs.twimg.com/profile_images/581109210085109760/4gNn-rU7_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7330000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/19",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4139541Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4139541",
      "@etag": "01000000-0000-CBE3-0000-00000000006C",
      "SerializedSizeOnDisk": 1191
    }
  },
  {
    "eventId": "tccc20",
    "title": "F# and Data 101: Utilizing FsLab to Quickly Understand your Data",
    "abstract": "In this talk, we’re going to run through a suite of tools that the F# community has created to bring the power of F# to data manipulation and modeling. Utilizing the functional-first, typed architecture that F# provides, FsLab is a collection of packages which allow data to be explored and understood. These packages include: F# Data, which utilizes F#’s type provider system to create concrete types without boilerplate classes; Deedle, which allows swift in-memory manipulations and transformations of data; and visualization and more packages. We’ll touch on F# syntax as we go. Come join and take a crash course through these tools.",
    "author": "Jonathan Dexter",
    "authorBio": "Jonathan Dexter has been a Software Developer and technology enthusiast for over 10 years. He currently works as the Technology Manager for .NET at the Nerdery, defining the Nerdery’s technologies and tools that are used, supporting the practice, and positioning the offering for success. He’s worked in many .NET technologies, ranging from ASP.NET to WinForms to WPF and more.",
    "authorEmail": null,
    "authorUrl": "https://www.linkedin.com/in/jonathan-dexter-48150080",
    "authorTwitter": "@mandest",
    "authorGitHub": null,
    "room": "Rapson 58",
    "hour": 9.75,
    "pictureUrl": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/3/005/08a/3fc/25e2e9c.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7330000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/30",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4139541Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4139541",
      "@etag": "01000000-0000-CBE3-0000-00000000006D",
      "SerializedSizeOnDisk": 1676
    }
  },
  {
    "eventId": "tccc20",
    "title": "Introduction to Docker",
    "abstract": "Find out what all this containerization talk is about, and how you can use this for your development and devops work. We'll focus most on your development workflow with more in depth coverage of multiple container applications running locally, how data is saved, how containers are wired together in a network, how your IDE fits in, and other practical stuff the initial howto articles don't seem to cover. We'll cover how docker fits in with other devops tools, and then we'll end with an overview of the ways these containers can be used in production.",
    "author": "Philip Nelson",
    "authorBio": "Philip Nelson is the Research and Innovation Leader at Omni Resources as well as a full time developer and architect. He has worked with the internet since before there was a WWW and unfortunately is still attracted to shiny new things in tech. Devops and machine learning are high on the list of shiny things these days, but in the past he has been interested in agile methods, REST and hypermedia, object oriented programming, model driven development, object relational mapping, business process management, scalable architectures and a couple of others. Some of these worked out, and some not so much, and that just another topic to be interested in! When not coding, you may see him up on a stage playing a guitar around in Wisconsin, or out coaching kids in cross country skiing.",
    "authorEmail": null,
    "authorUrl": "https://panmanphil.wordpress.com",
    "authorTwitter": "@panmanphil",
    "authorGitHub": null,
    "room": "Rapson 56",
    "hour": 11,
    "pictureUrl": "https://media.licdn.com/media/p/3/000/005/255/39204b8.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7330000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/26",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4139541Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4139541",
      "@etag": "01000000-0000-CBE3-0000-00000000006E",
      "SerializedSizeOnDisk": 1911
    }
  },
  {
    "eventId": "tccc20",
    "title": "Test-Driven Approaches to Documenting RESTful APIs (for Groovy/Java)",
    "abstract": "Documentation generated from source code is very popular. Solutions such as Swagger are available for many different languages and frameworks. However, limitations of annotation based tools are becoming apparent. An overwhelming number of documentation annotations make for great docs but muddy the source code. Then, something changes and the docs are out of date again.<br><br>That is where test-driven approaches come in.<br><br>Test-driven documentation solutions, such as Spring Rest Docs, generate example snippets for requests and responses from tests ensuring both code coverage and accurate documentation. It can even fail the build when documentation becomes out of date. This session will walk through how to implement test-driven documentation solutions for groovy ecosystem technologies like Spring Boot and Grails. Attendees should have a basic understanding of AsciiDoc and how to construct RESTful APIs in Spring Boot and/or Grails.",
    "author": "Jennifer Strater",
    "authorBio": "Jennifer \"Jenn\" Strater is currently a Senior Consultant at Object Partners and co-founder of Gr8Ladies. She's an experienced Groovy and Grails developer and is an active participant in the Gr8 (Groovy, Grails, Griffon, Gradle, etc) community. She regularly attends the local user group, GroovyMN, and annual conferences including Gr8ConfUS. Jenn has presented introductory interactive sessions at various Minnesota tech events including as part of the Gr8Workshops initiative and internationally at Greach, Gr8Conf EU, Gr8Conf US, and Devoxx Belgium.",
    "authorEmail": null,
    "authorUrl": "http://www.jennstrater.com/",
    "authorTwitter": "@codeJENNerator",
    "authorGitHub": null,
    "room": "Rapson 54",
    "hour": 11,
    "pictureUrl": "http://chippewavalleycodecamp.com/img/speakers/jennifer-strater.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7820000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/34",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4149973Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4149973",
      "@etag": "01000000-0000-CBE3-0000-00000000006F",
      "SerializedSizeOnDisk": 2131
    }
  },
  {
    "eventId": "tccc20",
    "title": "Continuous Security",
    "abstract": "Worldwide, from government to retail, banking to healthcare, hacks and data breaches are becoming household names. Yet we often ignore many security concerns as we work towards our various delivery deadlines, handling only those that are easy to incorporate. And we generally rely on manual processes to ensure that even these steps are followed.<br><br>Similar to what we are doing with increasing frequency for functional testing, configuration, and deployment, we can integrate some security measures into our pipelines and other processes.\r\rThis talk will go through a few options, using examples for multiple programming languages including C#, Java, and Ruby and highlighting how running them regular could thwart various security threats.",
    "author": "Wendy Istvanick",
    "authorBio": "I have been a developer with ThoughtWorks for over 20 years and have enjoyed solving technical problems and making people happy along the way. I also love to travel. So life as a consultant has been great, giving me many chances to enable solutions while living in places I never would have dreamed of living while growing up, including Brazil, France, and India.\r\n\r\nIn addition to coding on many projects I have had the opportunity to facilitate training both internal to ThoughtWorks and at client sites over the years thus being able to share my craft with others.",
    "authorEmail": null,
    "authorUrl": "http://jemappellewendyi.com/",
    "authorTwitter": "@jemappellewendy",
    "authorGitHub": null,
    "room": "Rapson 100",
    "hour": 8.5,
    "pictureUrl": "https://pbs.twimg.com/profile_images/1097018523/DSCN4564_-_La_Montagne_St-Victoire_400x400.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7820000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/4",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4149973Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4149973",
      "@etag": "01000000-0000-CBE3-0000-000000000070",
      "SerializedSizeOnDisk": 1926
    }
  },
  {
    "eventId": "tccc20",
    "title": "An Introduction to Semantic 2.0",
    "abstract": "Is CSS and layout a mystery to you? When you read HTML are you able to understand what will be displayed without constantly looking up classes or documentation? If you’re like me, these are problems you run into when doing the view layer of your application. CSS classes become meaningless combinations of letters that don’t really seem to express intent.<br><br>However, there’s a library to help with that. Semantic UI is a framework that aims to create rich UIs “using human-friendly HTML.” Gone are the days of col-md-3. Instead, our HTML will have classes like “three column wide”. But it’s more than that. Semantic UI has a wide variety of elements, collections, and views that can make any application pop, all while following sane patterns.\r\rThroughout this talk, we’ll look at several key UI components, and talk about the underlying principles of Semantic UI. After leaving the talk, you’ll be bale to install Semantic UI (hint: it’s really simple) and get up and running on your next project.",
    "author": "Nate Taylor",
    "authorBio": "Nate Taylor is a software developer, speaker and Pluralsight author. He's worked on projects ranging from 1 developer for an internal application, to large teams writing revenue generating applications. He's worked for a Fortune 50 company, and he's worked for startups. He's developed software in C++, Java, .Net and JavaScript. Over the past 15 years he's developed a passion for TDD, clean code, and professionalism. In his spare time, Nate trains Brazilian Jiu Jitsu and tries to wrangle a herd of cats, rabbits and other pets at home.",
    "authorEmail": null,
    "authorUrl": "http://taylonr.com/",
    "authorTwitter": "@taylonr",
    "authorGitHub": null,
    "room": "Rapson 45",
    "hour": 9.75,
    "pictureUrl": "https://avatars2.githubusercontent.com/u/928403?v=3&s=460",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.7820000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "Talks/5",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.4159545Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.4159545",
      "@etag": "01000000-0000-CBE3-0000-000000000071",
      "SerializedSizeOnDisk": 2128
    }
  }
]