[
  {
    "eventId": "tccc2",
    "title": "3D Construction Basics in WPF",
    "abstract": "<p>    <a href=\"http://www.kindohm.com/archive/2007/04/28/Code-Camp---WPF-3D---Slides-Code-and-Resources.aspx\">        Content    </a></p><p>    Windows Presentation Foundation (WPF) is Microsoft's next-generation tool for developing    rich user interfaces, including the ability to render UI elements in 3D. Learn the    basics of building 3D objects and viewing 3D scenes in WPF. See a real WPF application    render a 3D scene from real data. With a touch of 3D theory, this session will drill    into the .Net 3.0 classes and XAML used to construct 3D meshes and models.</p>",
    "author": "Mike Hodnick",
    "authorBio": "    Mike Hodnick is a consultant with Inetium, Inc. and has worked as a developer in    the Twin Cities area for nine years.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5440000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/506",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3589527Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3589527",
      "@etag": "01000000-0000-CBE3-0000-00000000003B",
      "SerializedSizeOnDisk": 1173
    }
  },
  {
    "eventId": "tccc2",
    "title": "Bring the Power of Windows Desktop Search to Your Applications",
    "abstract": "<p>    Do you think that Windows Desktop Search (WDS) is just about finding that long-lost    spreadsheet? See how to integrate search features into your own applications to    provide more power to your users. Take advantage of the search index to see files    and other entities in a whole new light with less effort than you might imagine.    You may never use the file open dialog again!</p>",
    "author": "Arian Kulp",
    "authorBio": "    Arian Kulp is an independent software developer working in the Midwest who has created    developer presentations, hands-on-labs, sample code, and articles for a wide variety    of products such as LINQ, ADAM (Active Directory Application Mode), ASP.NET 2.0,    and VSTO. He is also currently one of the authors for the MSDN Coding 4 Fun series    of hobbyist articles. He has been coding since the fifth grade on various platforms,    and also enjoys photography, nature, and spending time with his family.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5440000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/507",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3589527Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3589527",
      "@etag": "01000000-0000-CBE3-0000-00000000003C",
      "SerializedSizeOnDisk": 1405
    }
  },
  {
    "eventId": "tccc2",
    "title": "CSLA .NET 3.0 Preview",
    "abstract": "<p>    Microsoft .NET 3.0 is here, and it includes WCF, WPF and WF. Learn how these technologies    are used and supported by Rocky's CSLA .NET framework. See how WCF can be a drop-in    replacement for Remoting, web services or Enterprise Services, and how you can use    business objects with WCF to build service-oriented applications. Get a look at    how to use business objects behind WPF forms to get the interactivity of Windows    Forms, and the flexibility of using markup (XAML) to design your pages. And see    how to create workflow activities using business objects, so your workflows have    all the power and capabilities offered by CSLA .NET.</p>",
    "author": "Rockford Lhotka",
    "authorBio": "    Rockford Lhotka is the author of several books, including the Expert VB 2005 Business    Objects and Expert C# 2005 Business Objects books and related CSLA .NET framework.    He is a Microsoft Regional Director, MVP and INETA speaker. Rockford is the Principal    Technology Evangelist for Magenic Technologies, a Microsoft Gold Certified Partner.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5440000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/509",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3589527Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3589527",
      "@etag": "01000000-0000-CBE3-0000-00000000003D",
      "SerializedSizeOnDisk": 1477
    }
  },
  {
    "eventId": "tccc2",
    "title": "Delegation and Kerberos in the Enterprise",
    "abstract": "<p>    This presentation will describe Kerberos at a high level, and then go into detail    on how to setup Delegation and Kerberos authentication using SQL Server, IIS and    a client. Additionally we may delve into delegation across two SQL instances and    a client. The presentation will include a review of the tools necessary to setup    delegation and Kerberos and the debugging techniques used to resolve Kerberos authentication    problems. If you are looking for a way to improve your security, eliminate the need    for SQL authentication and understand the tools needed to do this, then this presentation    is for you. If you know what a double-hop is and could never quite find a way around    the problem before, then this presentation is for you. And, if you ever wondered    how to get a client app authenticated through IIS to SQL server and maintain auditing,    then this presentation is for you.</p>",
    "author": "David Baldauff",
    "authorBio": "    David Baldauff is a consultant with Digineer, a Microsoft Gold Certified and Managed    Partner consulting firm in the Twin Cities. David specializes in data architecture,    data-driven application development and database design and deployment. Since the    release of SQL Server 2005 David has worked on several SQL Server 2005 deployments    - in each case utilizing SSIS as the key tool for ETLs. David has over 14 years    experience in the IT industry.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5450000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/510",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3589527Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3589527",
      "@etag": "01000000-0000-CBE3-0000-00000000003E",
      "SerializedSizeOnDisk": 1865
    }
  },
  {
    "eventId": "tccc2",
    "title": "Developing Business Activity Monitoring Solutions with BizTalk Server's BAM Features",
    "abstract": "<p>    Are you constantly troubleshooting business processes embedded within and between    your custom applications? Would you like to learn more about those processes so    that you can improve them and spend less time troubleshooting them? If you answered    yes to either of these questions then BizTalk's Business Activity Monitoring (BAM)    might be for you. BAM is used to instrument your processes, from both a technical    and business perspective, so that you can enhance the processes as well as alert    users and technical staff when certain conditions are reached. This session will    introduce you to BAM through presentation and coding demonstrations. The focus will    not be on BizTalk itself but rather on its BAM features which can be used from beyond    BizTalk with a single BizTalk license.</p>",
    "author": "Andy Morrison",
    "authorBio": "    Andy Morrison is an Enterprise Consultant with Digineer, a technology and management    consulting firm. Andy specializes in BizTalk Server, co-founded the Twin Cities    BizTalk User Group and is a member of the Microsoft BizTalk Virtual Technical Specialist    Team.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5450000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/511",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3654934Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3654934",
      "@etag": "01000000-0000-CBE3-0000-00000000003F",
      "SerializedSizeOnDisk": 1615
    }
  },
  {
    "eventId": "tccc2",
    "title": "Developing for Windows Vista using Visual Studio 2005",
    "abstract": "<p>    There's more to Windows Vista than Glass and Sidebar. Learn what Vista has to offer    you as the developer, what you can take advantage of to enhance your customers user    experience and how you leverage many of these new features using the tools you have    today. This presentation is more about the features in Windows Vista, how you can    leverage them and how you can interact with them using interoperability; as many    of the new features in Vista are not .NET native (such as Aero/DWM, Windows Experience    Index information, etc.). Some examples show how to \"skin\" the .NET 2.0 TreeView    control to look and feel like the Vista Explorer / Windows Mail applications and    modify the behavior of a WinForms menu to show and hide similar to Windows Vista    counterparts.</p>",
    "author": "Cory Smith",
    "authorBio": "    Cory Smith is the founder of XboxFriends.com, maintains a .NET related blog at AddressOf.com    and is very active in the .NET community. His community involvement includes: Vice    President of the Fort Worth .NET Users Group, VBInsider Member, Microsoft MVP, and    member of the South Central District Developer Guidance Council. A veteran developer    (professionally writing software for over 15 years) working on projects ranging    anywhere from major e-commerce sites such as RadioShack.com and InterstateBatteries.com    to applications that are at the heart and soul of over 4600 radio stations around    the world. His work history includes working for Tandy/RadioShack, Rare Medium,    Inc., Electric Works Corp., Scott Studios Corp. and Shiny Stone Digital.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5450000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/512",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3654934Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3654934",
      "@etag": "01000000-0000-CBE3-0000-000000000040",
      "SerializedSizeOnDisk": 2062
    }
  },
  {
    "eventId": "tccc2",
    "title": "Extending Microsoft Office 2007 as a Platform",
    "abstract": "<p>    With the advent of Office System 2007, the world of office development takes a leap    ahead in power and flexibility. Come see how you can use .Net and Office to open    a whole new set of tools for your enterprise. Extending Outlook, creating apps in    Excel and Word and creating custom workflow solutions in SharePoint are just of    the few of the things you can do.</p>",
    "author": "Scott Yokiel",
    "authorBio": "    Scott Yokiel is a consultant at RBA Consulting. He has been in the IT space for    7 years with the last 4 dedicated to Microsoft .NET. He has served in many rolls    in his career from BA to developer; currently he is concentrated in the asp.net    space and looking to leverage 3.0. Outside of developing software Scott enjoys skiing    in the winter and camping in the summer, as long as there is no wi-fi access he's    a relaxing.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5450000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/513",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3659898Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3659898",
      "@etag": "01000000-0000-CBE3-0000-000000000041",
      "SerializedSizeOnDisk": 1306
    }
  },
  {
    "eventId": "tccc2",
    "title": "Gathering and Managing Requirements",
    "abstract": "<p>    You can't write code if you don't know what it's supposed to do. We'll talk about    how to get requirements out of the \"domain experts\" and then how to manage them    with a tool you most likely already have on your computer, Word.</p>",
    "author": "Tim Wold",
    "authorBio": "    Tim Wold is a Principal Consultant with Magenic Technologies; a Minneapolis based    consulting firm specializing in Microsoft Technologies. Over the last 17 years he    has been on teams large and small.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5460000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/514",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3659898Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3659898",
      "@etag": "01000000-0000-CBE3-0000-000000000042",
      "SerializedSizeOnDisk": 923
    }
  },
  {
    "eventId": "tccc2",
    "title": "If Darwin Could Write Code",
    "abstract": "<p>    Charles Darwin had an idea: that over time, species of animals adapted; evolved.    Later, in the 1950s, computer scientists thought , \"Hey, why not model natural selection    on a computer?\" With that, genetic algorithms were born! This talk will introduce    (softly, I promise) genetic algorithms... applications of genetic algorithms, and    hopefully some takeaway concepts and frameworks so you can try your own.</p>",
    "author": "Jacob Good",
    "authorBio": "    Jacob Good is a Ruby on Rails developer for Space150 and has been consulting / developing    software in the Twin Cities for nearly 3 years. His development experience has been    primarily focused on smart client development and mobile development. He dabbles    in all kinds of technologies from Ruby on Rails to bioinformatics packages in Perl    and of course .NET.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5460000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/515",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3659898Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3659898",
      "@etag": "01000000-0000-CBE3-0000-000000000043",
      "SerializedSizeOnDisk": 1267
    }
  },
  {
    "eventId": "tccc2",
    "title": "Inside the WCF Web Service Software Factory",
    "abstract": "<p>    The Microsoft Patterns and Practices group created the Web Service Software Factory    (WSSF) to assist developers and architects quickly and consistently build services    which follow sound architecture principles and design patterns. WSSF helps automate    common tasks such as project layout, message design, service interface design, message    validation, and domain object/data contract translation. In this session, we will    build a simple application with WSSF (WCF version) to demonstrate its usage, strengths    and weaknesses.</p>",
    "author": "Dan Mork",
    "authorBio": "    Dan Mork is a Lead Consultant at Inetium, a Microsoft partner in the Twin Cities.    He has twelve years of experience in software development for companies ranging    from obscure startups to Microsoft. His interests includes agile development, service-oriented    development, Windows Communication Foundation (WCF) and Ruby on Rails.<p>    Jeff Knutson is a Senior Consultant for Magenic Technologies in Minneapolis, MN.    Jeff's primary job interests include web services and security. He has over 12 years    experience with various Microsoft development technologies and holds numerous certifications    including the MCSD.NET.</p><ul>    <li>        <a href=\"http://msdn2.microsoft.com/en-us/library/aa480534.aspx\">            Web Services Software            Factory        </a>    </li>    <li><a href=\"http://www.magenic.com\">Magenic</a></li>    <li><a href=\"http://wcf.netfx3.com\">WCF</a></li>    <li><a href=\"http://blog.magenic.com/blogs/jeffk/\">Jeff's Personal Blog</a></li>    <li><a href=\"http://www.inetium.com/\">Inetium</a></li></ul>",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5460000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/516",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3659898Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3659898",
      "@etag": "01000000-0000-CBE3-0000-000000000044",
      "SerializedSizeOnDisk": 2095
    }
  },
  {
    "eventId": "tccc2",
    "title": "Reflection in .NET: Hacking and Futzing With IL",
    "abstract": "<p>    Reflection is a powerful way to dynamically inspect assembies at run-time to determine    the structure of its contents, invoke methods, and change private field values (among    other interesting tricks). But it doesn't stop there - .NET gives you the power    to create code at run-time via its reflection infrastructure as well. In this presentation,    I'll cover the essentials of the System.Reflection namespace (along with the changes    that were added in 2.0), how to emit code at run-time, and other libraries that    go far beyond what .NET can currently provide (FxCop's CCI library for introspection    and Mono.Cecil for full assembly reading/writing).</p>",
    "author": "Jason Bock",
    "authorBio": "    Jason Bock is a Senior Consultant for Magenic Technologies. He has worked on a number    of business applications using a diverse set of substrates and languages such as    C#, .NET, and Java. He is the author of \"Applied .NET Attributes\", \"CIL Programming:    Under the Hood of .NET\", \".NET Security\", and \"Visual Basic 6 Win32 API Tutorial\".    He has written numerous articles on software development issues and has presented    at a number of conferences and user groups. Jason holds a Master's degree in Electrical    Engineering from Marquette University.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5460000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/519",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3669534Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3669534",
      "@etag": "01000000-0000-CBE3-0000-000000000045",
      "SerializedSizeOnDisk": 1734
    }
  },
  {
    "eventId": "tccc2",
    "title": "Simple Data Access with Subsonic",
    "abstract": "<p>    Subsonic is an elegant Active Record implementation for the .Net Framework that    can save you significant development time. It uses a powerful query engine to pull    data into well designed generic collections. At the end of the day you can use more    energy in the design of your pages and their business logic since your focus is    not on building yet another data access layer. I'll walk you through how to get    started with SubSonic to get the most out of the tool, show you how to go beyond    the basics and will demonstrate how to rapidly build out a web site.</p>",
    "author": "Chris Sutton",
    "authorBio": "    Chris Sutton is a Technical Trainer and Consultant in Eastern Iowa. He is an instructor    with New Horizons of Cedar Rapids and loves developing for the web with C# and ASP.Net.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5530000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/520",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3669534Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3669534",
      "@etag": "01000000-0000-CBE3-0000-000000000046",
      "SerializedSizeOnDisk": 1238
    }
  },
  {
    "eventId": "tccc2",
    "title": "An Introduction to Subversion",
    "abstract": "<p>    Many Windows developers have used Visual SourceSafe their entire career. Most of    us know there are other source code control tools out there but have never had any    exposure to them. In this session I will introduce Subversion, a free, open source    version control system. First we will take a look at what tools are available for    use with Subversion (command line, TortoiseSVN, AnkhSVN). Next we will cover some    basic concepts about versioning models and Subversion's implementation and then    walk though how a developer works with Subversion on a daily basis. After looking    at daily developer usage we will dive into some more advanced topics Subversion    administrators will need to understand and power users will want to know about including    branching, merging, creating and applying patches, repository setup and structuring,    and integration with issue tracking systems.</p>",
    "author": "Steve Baker",
    "authorBio": "    Steve Baker is an MCSD.NET certified advisory consultant and partner at Paradigm    Solutions Inc. Steve specializes in introducing and building agile development environments.    In addition to implementing environments, Steve has spent considerable time training    teams in \"best practices\" and software configuration management patterns. Paradigm    Solutions specializes in business and Information Technology (IT) resources for    both large and small business.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5530000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/521",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3669534Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3669534",
      "@etag": "01000000-0000-CBE3-0000-000000000047",
      "SerializedSizeOnDisk": 1852
    }
  },
  {
    "eventId": "tccc2",
    "title": "There Must be Fifty Ways to Unit Test Your Software",
    "abstract": "<p>    Unit testing is a critical activity in producing quality software. Developers should    apply unit testing in parallel to the development of the software. Because unit    testing is so important, it should be easy to perform unit testing. The developer    should be able to focus on the \"what\" the unit tests demonstrates rather than the    \"how\" to demonstrate the result. There are a fairly large number of unit testing    tools that can greatly simplify the unit testing process. Many of these tools are    free. This session would include a \"dash\" of unit testing philosophy plus a lot    of code that demonstrates the use the \"core\" unit testing harnesses such as NUnit,    MbUnit, and MsTest as well as related testing tools such as NUnitForms and NUnitASP.    The session will also address the use of tools to replace dependent elements with    dummy units, stub units, and mock units. The types of units to be tested will include:    Logic, Window Forms, Web Pages, Databases, XML Files, JavaScript, and Ajax functionality.</p>",
    "author": "Jon Stonecash",
    "authorBio": "    Jon Stonecash is a senior consultant at Magenic Technology. Jon Stonecash has worked    in software development for much longer than he would like to admit. In that time    Jon has had the opportunity to make most of the serious software development mistakes    at least once. He has programmed in over a dozen languages including several different    assembly languages, Fortran, COBOL, SNOBOL, classic Visual Basic, VB.NET, and C#.    He has survived the structured programming revolution and the object-oriented revolutions    (having inexplicably missed out on the sexual revolution). Jon's software development    activities have included the development of operating systems, scientific and engineering    applications, and enterprise systems. He has worked in every phase of software development    from the initial specification of requirements through to customer support. Along    the way, he picked up a BS in Mathematics and an MBA. He still has hopes of finding    something that he can be reasonably good at. His long term interests center about    databases and the aspects of the application that handle data access and business    logic. He is also interested in the tools and processes that assist the development    process. Jon can be reached at jons@magenic.com.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5530000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/522",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3669534Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3669534",
      "@etag": "01000000-0000-CBE3-0000-000000000048",
      "SerializedSizeOnDisk": 2828
    }
  },
  {
    "eventId": "tccc2",
    "title": "Web Developers Guide to IIS 7",
    "abstract": "<p>    Effective web developers understand not only how pages are created but how they    are executed. IIS 7 has been modularized so functions can be removed or extended    as needed. Learn how to extend IIS with ASP.NET, and how the pipelines have been    integrated which allows Forms Authentication to be applied to all files including    images, documents, and HTML files. See how to replace built in functionality like    directory browsing, and how to provide redirects that allow wildcards and work with    directory names. Discover how to trap failed requests to help troubleshoot production    problems.</p>",
    "author": "Robert Boedigheimer",
    "authorBio": "    Robert Boedigheimer works for The Schwan Food Company providing business solutions    with web technologies. Robert has been designing and developing web sites for the    past 10 years including the early days of ASP and ASP.NET. He was the lead architect,    designer, and developer for the schwans.com rewrite with ASP.NET, and recently implemented    a large ASP.NET 2.0 project. He is a columnist for aspalliance.com, an \"Early Achiever\"    MCSD for .NET with C#, an MCPD: Web with C#, and a 2nd degree black belt in Tae    Kwon Do. Robert has spoken at industry conferences including the Heartland Developers    Conference, Microsoft's Visual DevCon 2005, and several other national and international    events.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5530000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/523",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3679520Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3679520",
      "@etag": "01000000-0000-CBE3-0000-000000000049",
      "SerializedSizeOnDisk": 1814
    }
  },
  {
    "eventId": "tccc2",
    "title": "What Ruby on Rails can Teach .NET Developers",
    "abstract": "<p>    Ask a Rails developer how she would tackle a simple business problem. She'll tell    you. Put your database scripts here, your functional tests here, html markup here,    controller logic here, your unit tests here, and put your model here. To validate    your model, add a few lines here. And because of some simple and reasonable naming    conventions, it all plays well together. Ask a .Net developer how to tackle the    same business problem. She'll start thinking. Well, the UI seems pretty obvious,    but from there it gets difficult. You might start by doing the \"simplest thing that    can possibly work,\" and drag a dataset onto your screen. But where do you put your    database scripts? And how do you test your business logic? Or your UI controller    logic? And how do you name things? If this developer has been around for a while,    she probably has a few favorite patterns in her toolbox. Maybe she's even got some    of the pieces covered with reusable code libraries. But she doesn't have a solid,    well-tested, common framework for completing even a simple business scenario. She    should! In this presentation, we'll describe how Rails removes many of the common    barriers to getting real work done – and discuss how the .Net community might do    the same.</p>",
    "author": "Dan Mork",
    "authorBio": "    Dan Mork is a Lead Consultant at Inetium, a Microsoft partner in the Twin Cities.    He has twelve years of experience in software development for companies ranging    from obscure startups to Microsoft. His interests includes agile development, service-oriented    development, Windows Communication Foundation (WCF) and Ruby on Rails.<ul>    <li><a href=\"http://www.rubyonrails.org/\">Ruby on Rails</a></li>    <li><a href=\"http://www.inetium.com/\">Inetium</a></li></ul>",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5530000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/524",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3679520Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3679520",
      "@etag": "01000000-0000-CBE3-0000-00000000004A",
      "SerializedSizeOnDisk": 2258
    }
  },
  {
    "eventId": "tccc2",
    "title": "World of Warcraft Add-on Development",
    "abstract": "<p>    World of Warcraft is probably the largest online game in history, with over 8 million    current players from hundreds of countries. In this session I will show you how    to the development add-ons for World of Warcraft using LUA Scripting and the WOW    APIs. This session will also Cover developing a custom UI for your mod along with    creating basic macros for easy game play.</p>",
    "author": "Michael Dunn",
    "authorBio": "    Michael Dunn is a Consultant for Magenic Technologies; a Minneapolis based consulting    firm specializing in Microsoft Technologies. He currently holds his MCSD and MCITP.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5530000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/525",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3679520Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3679520",
      "@etag": "01000000-0000-CBE3-0000-00000000004B",
      "SerializedSizeOnDisk": 1044
    }
  },
  {
    "eventId": "tccc2",
    "title": "CPU and Game Emulation Design",
    "abstract": "<p>    Techniques for creating CPU and hardware emulators for classic operating systems    and arcade games. The presentation will focus on a working emulator for the Intel    8080 processor running under .NET 2.0. The Intel 8080 was the processor used in    the original Altair computer system that inspired the founding of Microsoft. The    discussion will include an overview of standard computer components, techniques    for emulating CPU instructions and hardware, and recommendations for testing and    performance. Source code and technical documentation will be available for download.</p>",
    "author": "David Pinch",
    "authorBio": "",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5540000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/508",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3679520Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3679520",
      "@etag": "01000000-0000-CBE3-0000-00000000004C",
      "SerializedSizeOnDisk": 1065
    }
  },
  {
    "eventId": "tccc2",
    "title": "An Introduction to PowerShell",
    "abstract": "<p>    PowerShell is Microsoft's latest command line shell, formerly codenamed Monad. Learn    how to interact with PowerShell and leverage its powerful scripting capabilities    into your own environment. Discover how PowerShell can help you automate repetitive    tasks, work with the registry and aid in debugging. This session will cover the    basic syntax of PowerShell, delve into common usages and explore graphical interfaces    for working with the command line.</p>",
    "author": "Neil Iversen",
    "authorBio": "    Neil is a developer for Inetium and frequent speaker at the Minnesota SharePoint    User Group.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5540000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/517",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3689522Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3689522",
      "@etag": "01000000-0000-CBE3-0000-00000000004D",
      "SerializedSizeOnDisk": 1043
    }
  },
  {
    "eventId": "tccc2",
    "title": "Practical iBatis Implementations using C#",
    "abstract": "<p>    As we all know, the application/database relationship domain is one of the hardest,    most time consuming, and complex areas of applications. iBatis is one solution that    is filling the gap and making these relationships as painless as possible. iBatis    consists of two pieces. One which allows robust mapping between database and application    domain objects. As well as another piece that provides abstraction of the data access    layer all together. iBatis is a good greenfield development tool, however, it's    even more useful in legacy system additions and rewrites, when connecting to existing    databases where the schema can't be changed.</p>",
    "author": "Mark S.",
    "authorBio": "    After moving to Milwaukee from the Pacific Northwest, Mark joined Quad/Graphics    Inc. in 2002, where he currently works on the Development Infrastructure team. Recently    he has been getting his hands dirty with C#, iBatis, TDD, Mocks, and Continuous    Integration as he helps build a new enterprise platform for future software development.    Mark was introduced to iBatis about a year ago, and soon became interested in leveraging    its capabilities. Since then, he has been an ardent supporter and plans to contribute    to the iBatis project in the near future.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5540000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/518",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3759531Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3759531",
      "@etag": "01000000-0000-CBE3-0000-00000000004E",
      "SerializedSizeOnDisk": 1717
    }
  }
]