[
  {
    "eventId": "tccc22",
    "title": "ASP.NET 2.0 - From New Project to CI/CD",
    "abstract": "New to ASP.NET Core 2.0?  Or haven't yet seen it all the way through Continuous Integration and Continuous Deployment?  In this session we will cover ASP.NET Core 2.0 - benefits of using it and when not to, then look at the project templates (dotnet new and in VS 2017), then look at a simple but real application to search and view log entries from a SQL Server database.  The technology used includes Dapper, Bootstrap, jQuery, Kendo UI Core (open source), and TypeScript.  We'll explore this application and then look at what it took to enable full CI/CD within Visual Studio Team Services (VSTS).",
    "author": "Erik Dahl",
    "authorBio": "Erik Dahl has been developing software and architecture for 20+ years, mostly doing in-house development for his employers. He has recently published his second Pluralsight course.  His other recent work has included a multi-tenant B2B implementation and self-registration B2C implementation for IdentityServer3, upgrading legacy ASP.NET websites from server-side technologies to a client/server mix and adopting TypeScript, building Web APIs as the back end for mobile and web application. Erik currently works at RealPage as a Principal Architect, building and architecting solutions for their Utility Management products.",
    "authorEmail": "dahlsailrunner@yahoo.com",
    "authorUrl": null,
    "authorTwitter": "@dahlsailrunner",
    "authorGitHub": "dahlsailrunner",
    "room": "Garden Room",
    "hour": 12.5,
    "pictureUrl": "/assets/images/speakers/tccc22/erik-dahl.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/834",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:11.9730900Z",
      "Raven-Last-Modified": "2019-07-09T17:08:11.9730900",
      "@etag": "01000000-0000-EB6A-0000-000000000001",
      "SerializedSizeOnDisk": 1811
    }
  },
  {
    "eventId": "tccc22",
    "title": "Knowing Things Work instead of Thinking Things Work",
    "abstract": "Production can be a scary environment. Sometimes things are working great and sometimes they're a complete dumpster fire. How do you know your current status? How do you know where your problem is or which server is causing the degradation? In this talk I'll discuss a journey from no application performance monitoring (APM) to \"good enough to troubleshoot today\" APM and where the team continued after our tire fire was turned back into a normal day. I'll focus on the abstract types of things to watch for and show how easy retrofitting these abilities can be, but for those curious, the examples are built on influxdb, telegraf, and grafana.",
    "author": "Dani Ames",
    "authorBio": "Dani Ames is a Lead Software Engineer at Sanford Imagenetics in Sioux Falls, South Dakota where she owns test automation for the Imagenetics' clinical genetic testing pipeline. She's been working on the LAMP Stack for over 10 years and is passionate about good engineering and bad jokes.\n\nHer past work includes software engineer at EROS and Raven industries, as well as an instructor for Girls Who Code. Dani is described by co-workers as a dangerous unicorn-narwhal halfbreed.",
    "authorEmail": "dani.c.ames@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@_dames",
    "authorGitHub": "DanielleAmes",
    "room": "P0808",
    "hour": 9.25,
    "pictureUrl": "/assets/images/speakers/tccc22/dani-ames.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/802",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:11.9841375Z",
      "Raven-Last-Modified": "2019-07-09T17:08:11.9841375",
      "@etag": "01000000-0000-EB6A-0000-000000000002",
      "SerializedSizeOnDisk": 1707
    }
  },
  {
    "eventId": "tccc22",
    "title": "Level up your Hustle!  How to sell yourself, your product or idea.",
    "abstract": "Communication is key to success for every position at every level of a company.   If you are a developer who has an idea how will you communicate it to your team?  What if you are a project manager with an idea for a better process or procedure? If you are an executive with a great road map, how will you gain interest from the board and other C-Level executives?\n\nCome to Jennifer’s talk on Level Up Your Hustle, \n•\tLearn how to be your own consultative sales person \n•\tHow to better prepare for meetings\n•\tHow to ‘Pitch’ your idea or project\n•\tMost importantly, how to make an impact for your organization.",
    "author": "Jennifer Simon",
    "authorBio": "Jennifer has been in consultative sales for over 25 years, she focuses on partnering with clients to develop and maintain relationships. Jennifer takes care of her clients by listening to business needs, matching the correct consultant/team and continually works on creating deep partner relationships. She is passionate about promoting the local technology community.  She is on the planning committee for Women Leading in Technology helping women connect from across the industry.",
    "authorEmail": "jennifer@talentemail.com",
    "authorUrl": null,
    "authorTwitter": "@jenniferlsimon",
    "authorGitHub": "",
    "room": "P1838",
    "hour": 9.25,
    "pictureUrl": "/assets/images/speakers/tccc22/jennifer-simon.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/805",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:11.9841375Z",
      "Raven-Last-Modified": "2019-07-09T17:08:11.9841375",
      "@etag": "01000000-0000-EB6A-0000-000000000003",
      "SerializedSizeOnDisk": 1719
    }
  },
  {
    "eventId": "tccc22",
    "title": "Making music with Ableton, Typescript and Node",
    "abstract": "Electronic musicians typically use a keyboard or MIDI controller to create music.  But, we’re software developers, so wouldn’t it be more fun if we could generate music with Typescript and Node? \n\nThis talk is aimed at people of all musical levels.  I’ll discuss controlling a digital audio workstation (Ableton Live) with TypeScript, and show you how to use TypeScript and Node to generate MIDI clips for drums, chords, and topline melodies.  We’ll actually scaffold out song ideas live, using TypeScript to generate clips that are run through professional grade virtual instruments.  Attending this talk should inspire you to see coding as an equally valid avenue to create music, and give you the tools to do so!",
    "author": "Eric Brandes",
    "authorBio": "Eric is the co-founder of TrackJS, a JavaScript error monitoring service.  He believes there is no place for optimism in software, and if your code isn't a little gross, it's probably not doing anything very interesting.",
    "authorEmail": "eric.brandes@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@BrandesEric",
    "authorGitHub": "BrandesEric",
    "room": "P2844",
    "hour": 9.25,
    "pictureUrl": "/assets/images/speakers/tccc22/eric-brandes.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/806",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:11.9841375Z",
      "Raven-Last-Modified": "2019-07-09T17:08:11.9841375",
      "@etag": "01000000-0000-EB6A-0000-000000000004",
      "SerializedSizeOnDisk": 1531
    }
  },
  {
    "eventId": "tccc22",
    "title": "Believe in the Power of CSS",
    "abstract": "You know that song by Huey Lewis and the News, The Power of Love? \"First time you feel it, it might make you sad.\" Might be how you feel about CSS right? What about the power of CSS? CSS has received a bad name as of late, but truth of the matter is that CSS is such a powerful piece of the front-end puzzle and you should really be excited for what's already here and what's to come! Who would have thought we could create magazine-style layouts with CSS grid? What about ruleset variable scoping with custom properties(CSS variables)? And last but not least, the pain of centering content horizontally and vertically which is now possible in three lines with flexbox! Let's talk about how awesome CSS is, and how we can restore our faith in one of the best things that makes the web amazing!",
    "author": "Chris DeMars",
    "authorBio": "Chris DeMars is a UI developer first, UX architect always, working out of Detroit, Michigan. Chris is also an instructor, teacher assistant, and volunteer for the Ann Arbor chapter of Girl Develop It and co-organizer for the Ann Arbor Accessibiity Group. Chris loves coming up with solutions for enterprise applications, which include modular CSS architectures, performance, and advocating for web accessibility. When he is not working on making the web great and inclusive you can find him writing blog posts, watching horror movies, drinking the finest of beers, or in the woods of northern Michigan.",
    "authorEmail": "cdemars86@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@saltnburnem",
    "authorGitHub": "chrisdemars",
    "room": "P0838",
    "hour": 15,
    "pictureUrl": "/assets/images/speakers/tccc22/chris-demars.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/833",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:11.9841375Z",
      "Raven-Last-Modified": "2019-07-09T17:08:11.9841375",
      "@etag": "01000000-0000-EB6A-0000-000000000005",
      "SerializedSizeOnDisk": 1961
    }
  },
  {
    "eventId": "tccc22",
    "title": "Say Good Bye to the For Loop with Higher Order Functions",
    "abstract": "Pssst, want to know a secret?  I have not written a for loop in years.  In fact I kind of forgotten what the syntax for one looks like.  What's my secret?  Higher Order Functions.\n\nBelieve it or not for just about everything you are currently doing with for loops someone has already written, optimized, and tested a Higher Order Function that does the exact same thing.\n\nIn this session we'll look at how to use Higher Order Functions to achieve all of your looping needs.  We'll look at using map to do transformations.  Using filter to trim narrow down our collections.  We'll use fold to apply calculations.  You'll walk away knowing how to apply Higher Order Functions to your every day coding and you'll finally be able to say good bye to the for loop.",
    "author": "Mike Harris",
    "authorBio": "Mike Harris is a software crafter and lifelong learner, who is constantly searching for the best tools for the job. Mike enjoys learning new program languages and ways of solving problems. He uses this knowledge in his day-to-day work as a Software Developer at Baird.",
    "authorEmail": "mikemkh@yahoo.com",
    "authorUrl": null,
    "authorTwitter": "@MikeMKH",
    "authorGitHub": "MikeMKH",
    "room": "P0808",
    "hour": 15,
    "pictureUrl": "/assets/images/speakers/tccc22/mike-harris.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/828",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:11.9841375Z",
      "Raven-Last-Modified": "2019-07-09T17:08:11.9841375",
      "@etag": "01000000-0000-EB6A-0000-000000000006",
      "SerializedSizeOnDisk": 1611
    }
  },
  {
    "eventId": "tccc22",
    "title": "Getting Started With Progressive Web Applications",
    "abstract": "Progressive Web Apps are an evolution, providing benefits over and above a standard web application. They perform better in offline and network-challenged environments, provide faster page loads with better performance characteristics, and allow your application to be first class citizens on your browser's or OS' start or home screen, living side by side with native applications.  This session will take you through the basics, building a foundation for you to develop your first Progressive Web App.",
    "author": "Mike Marshall",
    "authorBio": "Mike Marshall is a Lead Architect at Idemia, and has spent 20 years developing large enterprise applications with a constant eye on reliability, maintainability and scale.  He cut his teeth with BASIC on the Apple IIe and has developed on a number of platforms and stacks over the years, currently focusing on .NET, C#,  javascript, TypeScript and Angular.",
    "authorEmail": "mikes.mailslot@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@mndevguy",
    "authorGitHub": "mike-marshall",
    "room": "P0806",
    "hour": 15,
    "pictureUrl": "/assets/images/speakers/tccc22/mike-marshall.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/829",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:11.9841375Z",
      "Raven-Last-Modified": "2019-07-09T17:08:11.9841375",
      "@etag": "01000000-0000-EB6A-0000-000000000007",
      "SerializedSizeOnDisk": 1451
    }
  },
  {
    "eventId": "tccc22",
    "title": "A DSL for Your API",
    "abstract": "Have you ever wanted to allow your users to be able to write scripts to execute actions within your application? Have you ever wondered how applications that do this accomplish it? During this talk we'll look at an app with a simple, easy to grok API, and and an interpreted scripting language created using the ANTLR4 Parser/Lexer generator, with which to drive it. All this, faster than you can say \"The Dragon Book\".",
    "author": "Greg Sohl",
    "authorBio": "Greg is the director of software development and a software architect with StoneRiver in Cedar Rapids. He's spent the last 35 years building commercially sold software in the financial industry. Greg is also the Speaker Liason & MC for CRineta and President of Iowa Code Camp",
    "authorEmail": "gregsohl@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@gregsohl",
    "authorGitHub": "gregsohl",
    "room": "P2844",
    "hour": 15,
    "pictureUrl": "/assets/images/speakers/tccc22/greg-sohl.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/832",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:11.9841375Z",
      "Raven-Last-Modified": "2019-07-09T17:08:11.9841375",
      "@etag": "01000000-0000-EB6A-0000-000000000008",
      "SerializedSizeOnDisk": 1238
    }
  },
  {
    "eventId": "tccc22",
    "title": "Kubernetes: Concepts and Implementation",
    "abstract": "Kubernetes is quickly becoming the most popular way to deploy applications using containers. In this talk we will go through the concepts that underpin Kubernetes and how they all fit together, as well as concrete advice for how to port existing production applications to Kubernetes from other hosting systems.",
    "author": "Ryan Morlok",
    "authorBio": "I'm a full-stack web developer that has been working on DevOps as of late. Over the last year, I've lead the effort to port my company's application from AWS Elastic Beanstalk to Kubernetes. I work for a New York based startup, Contently, that I came to through via the acquisition of my startup, Docalytics.",
    "authorEmail": "ryan.morlok@morlok.com",
    "authorUrl": null,
    "authorTwitter": "@rmorlok",
    "authorGitHub": "rmorlok",
    "room": "P1808",
    "hour": 12.5,
    "pictureUrl": "/assets/images/speakers/tccc22/ryan-morlok.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/817",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.0858356Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.0858356",
      "@etag": "01000000-0000-EB6A-0000-000000000009",
      "SerializedSizeOnDisk": 1188
    }
  },
  {
    "eventId": "tccc22",
    "title": "Applying Design Patterns to Everyday Problems",
    "abstract": "Have you read about design patterns but weren’t quite sure how or where to apply them in your application?  Have you heard of principles like loose coupling and programming to an abstraction, but didn’t know if you were really doing it right?  If so, this talk is for you.  \n\nIn this talk, I’ll work from several example code segments and show how to recognize which design pattern would be appropriate.  I’ll then show how to refactor the existing code to use the chosen design pattern and demonstrate how the resulting code is more understandable, easier to maintain and easier to test.\n\nAmong the examples I will show is how a dependency on an external system can be refactored using an interface and applying the bridge and adaptor pattern. I’ll also show how to use the decorator pattern to cache results from an external call.  Finally, I’ll show examples of how patterns like the strategy pattern and chain of responsibility pattern can replace large blocks of if/else if statements to create a simpler design that is easier to test.\n\nWhen this talk is complete, you will have a good idea of how to recognize where these patterns can be applied in your codebase and how you go about implementing them.",
    "author": "David Berry",
    "authorBio": "I'm a Solutions Architect with over 20 years of experience in building software systems. I started out as a Java developer and then switched to .NET in 2003. I've also done significant work with SQL Server and Oracle. I'm a Pluralsight author and have presented at community events throughout the Midwest..\n\nI try to bring a pragmatic approach to everything I do, making sure the software I build is simple, understandable and balances responsibilities between different components of the system. When speaking or teaching, I emphasize real world scenarios encountered by developers every day and show how to solve them so you can be more effective at what you do.",
    "authorEmail": "dberry83702@yahoo.com",
    "authorUrl": null,
    "authorTwitter": "@davidcberry13",
    "authorGitHub": "DavidCBerry13",
    "room": "Garden Room",
    "hour": 13.75,
    "pictureUrl": "/assets/images/speakers/tccc22/david-berry.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/820",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.0858356Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.0858356",
      "@etag": "01000000-0000-EB6A-0000-00000000000A",
      "SerializedSizeOnDisk": 2485
    }
  },
  {
    "eventId": "tccc22",
    "title": "Kubernetes In Action: The Developer Experience",
    "abstract": "Containers are the next evolution in modern development, enabling organizations to be more agile than ever before. They can write their app once and deploy everywhere, whether dev, test or production. Containers can run on any hardware, on any cloud, and in any environment without modification. In short, they offer a truly open and portable solution for agile DevOps. This session will begin with a short intro to Kubernetes followed by an end to end demo of testing and deploying  a .Net Core application to a Kubernetes Cluster with a CI\\CD pipeline. We will finish the session with lessons learned and best practices of using containers in production.",
    "author": "Dave Strebel",
    "authorBio": "Dave Strebel is an Azure Open Source Architect on the Microsoft Global Black Belt team. Dave focuses on containers, microservices, DevOps, and cloud native applications in the Azure cloud platform. Dave has been working in technology for over 15 years and has a mixed background across application development to infrastructure. Dave is based in Minneapolis, MN and in his free time organizes the MSP Docker Meetup and Azure Meetup.",
    "authorEmail": "strebeld@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@dave_strebel",
    "authorGitHub": "dstrebel",
    "room": "P1808",
    "hour": 13.75,
    "pictureUrl": "/assets/images/speakers/tccc22/dave-strebel.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/824",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.0858356Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.0858356",
      "@etag": "01000000-0000-EB6A-0000-00000000000B",
      "SerializedSizeOnDisk": 1670
    }
  },
  {
    "eventId": "tccc22",
    "title": "Using Thunkable to Create a Mobile App",
    "abstract": "Thunkable was developed by MIT  as a 2nd generation of App Inventor to create mobile apps.  Thunkable is simple and fast for first-time app builders, but powerful enough to support your most ambitious apps.  We will show how to develop and test a simple Android mobile app.  We will show how to use a phone's local database or a Fusion Table of Data on the Cloud for app data.  We'll talk about some of the apps we've created and show you resources where you can learn more to help you make your own Android mobile app.  Developing mobile apps with Thunkable is fun.  This session will make you want to go home and make your own.",
    "author": "Team Computer Glitz",
    "authorBio": "Team Computer Glitz is a team of five girls (Four 9th graders and One 7th grader) who have competed in the Technovation MN program for the past 3 years.  We have also created mobile apps for their FIRST Lego League projects.  Ashley, Clare, Ellie, Nora, and Prapthi are passionate about STEM and coding.  We want to continue sharing our love for coding and STEM with others.   #mobileappsrock",
    "authorEmail": "computer.glitz@gmail.com",
    "authorUrl": null,
    "authorTwitter": "",
    "authorGitHub": "",
    "room": "P1838",
    "hour": 13.75,
    "pictureUrl": "/assets/images/speakers/tccc22/team-computer-glitz.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/825",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-00000000000C",
      "SerializedSizeOnDisk": 1593
    }
  },
  {
    "eventId": "tccc22",
    "title": "Automating the Cloud with Terraform, and Ansible",
    "abstract": "Need a web infrastructure for your project?  Setting everything up by hand is tedious, and prone to problems. That's why more and more people are moving to immutable infrastructure with Terraform and Ansible.  Terraform lets you create server instances, and Ansible lets you provision them with users, software, and configuration.\n\nIn this talk, you'll see how to build a web server infrastructure using Ansible, Terraform.  First, you'll see how to define and create servers with code using Terraform. Then you'll see how to use Ansible Playbooks to provision a webserver and upload the web site. Finally, you'll see how to scale this infrastructure.  When we're done, you'll have scripts you can run to set up your own environment.",
    "author": "Brian Hogan",
    "authorBio": "Brian writes, edits, makes music, and builds things on the Internet. By day he works for DigitalOcean’s Community team helping make technical articles easy to follow.",
    "authorEmail": "bphogan@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@bphogan",
    "authorGitHub": "napcs",
    "room": "P0808",
    "hour": 12.5,
    "pictureUrl": "/assets/images/speakers/tccc22/brian-hogan.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1160000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/814",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-00000000000D",
      "SerializedSizeOnDisk": 1474
    }
  },
  {
    "eventId": "tccc22",
    "title": "Code Reviews: That's a Great Idea!",
    "abstract": "We all know that code reviews are beneficial. We’ve been told time and time again that they should be part of our development process. But – like most best practices – a practical implementation is challenging (and time consuming). Your team is convinced they are a great idea. You’ll have an opportunity to squash bugs in the least costly of development times, learn new things from your talented teammates, and build a stronger foundation of trust. Awesome. Everyone is on board. But now what? What tools are out there? What are you actually looking for? How often should the reviews happen? In this talk, you’ll get a practical guide to making code reviews effective. Whether you’re the reviewer or reviewee: there are ways to make sure this really is a great idea.",
    "author": "Amy Gebhardt",
    "authorBio": "Amy is an extroverted software developer with a traditional Computer Science background and a passion for technology and people. She is happiest when writing client-side code on her Mac in collaboration with a crazy smart, dedicated team. Currently, she is the Lead UI Engineer at SportsEngine and spends her time working with designers, engineers, product managers, and architects to build and maintain a reusable Component Library.  As a 30 out of 30 on the Myers Briggs extroversion scale, she loves to get involved with local MeetUps, attend conferences, and lead the Minneapolis Girl Develop It Chapter.",
    "authorEmail": "amlyhamm@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@amlyhamm",
    "authorGitHub": "",
    "room": "P0806",
    "hour": 12.5,
    "pictureUrl": "/assets/images/speakers/tccc22/amy-gebhardt.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/815",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-00000000000E",
      "SerializedSizeOnDisk": 1944
    }
  },
  {
    "eventId": "tccc22",
    "title": "Tour de .NET Core CLI",
    "abstract": "Poll a large audience of .NET Core developers, and you’ll discover a breed that defies the heavy-handed IDEs of today. It’s inevitable. It’s becoming more commonplace. What are you really missing out on by not using Visual Studio? What does a day in the life of such a developer look like?\n\nIn this session, we’ll explore what the .NET Core CLI has to offer. From frequently-used commands to item and project template creation to integration with Visual Studio Code, you’ll leave this session with tips to boost your productivity. You'll also gain an understanding of what's going on under Visual Studio's hood when working with a .NET Core app.",
    "author": "Scott Addie",
    "authorBio": "Scott Addie is an avid blogger, a Telerik Developer Network author, and a technical evangelist of the modern web. Scott has reached masses of developers through blog posts, articles, and speaking engagements at user groups, code camps, and conferences across the globe. With a strong emphasis on JavaScript and the Microsoft web technology stack, Scott holds numerous industry-recognized Microsoft development certifications and has been named a Microsoft MVP twice in the award category of Visual Studio and Development Technologies. His thought leadership in the .NET community has also earned him a seat in the Telerik Developer Experts program. As a firm believer in giving back to the community, Scott is a frequent open source contributor to high-profile GitHub projects in the Microsoft developer ecosystem. In his day job as a \"blue badge\", Scott produces ASP.NET Core content for docs.microsoft.com.",
    "authorEmail": "tobias.addie@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@Scott_Addie",
    "authorGitHub": "scottaddie",
    "room": "P1838",
    "hour": 12.5,
    "pictureUrl": "/assets/images/speakers/tccc22/scott-addie.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/818",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-00000000000F",
      "SerializedSizeOnDisk": 2125
    }
  },
  {
    "eventId": "tccc22",
    "title": "Full-Stack Development with .NET Core and Visual Studio Code",
    "abstract": "The advent of .NET Core has unleashed .NET in all its cross-platform power. And since you can write code in almost any platform, why should you be limited in how you write it? Join me so we can talk how you can unleash the power of .NET Core in everyone's favorite lightweight IDE, Visual Studio Code. We can debug C# 7 code, query databases, and become super productive without needing a full version of Visual Studio.",
    "author": "Dave Brock",
    "authorBio": "Dave Brock is a software engineer at CUNA Mutual Group in Madison, Wisconsin, where he is a \"full-stack developer\" in the Microsoft stack - working on C#, SQL Server, as well as front-end work with JS and TypeScript. He enjoys speaking and sharing his knowledge - especially in Florida in wintertime - and blogs at his site (daveabrock.com). When not at his day job, he enjoys various side coding projects and being ordered around by his two small children and his not-so-small dog.",
    "authorEmail": "daveabrock@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@daveabrock",
    "authorGitHub": "daveabrock",
    "room": "Garden Room",
    "hour": 10.5,
    "pictureUrl": "/assets/images/speakers/tccc22/dave-brock.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/807",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000010",
      "SerializedSizeOnDisk": 1501
    }
  },
  {
    "eventId": "tccc22",
    "title": "Ready Player Two: VR Game Dev",
    "abstract": "In the year 2044, the world is in crisis.  To escape that reality, the populace turns to the OASIS, a virtual reality MMORPG that is more than just a game - it is a completely immersive virtual society.\n\nBack in 2018, at the dawn of VR, the seeds of our future were planted.  What would come to be a billion dollar market, that changed the world forever, began then…\n\nJoin us in viewing the 2018 talk by the Microsoft MVP Lance Larsen (www.LanceLarsen.com), one of the founders of HOLOSOFT (www.HOLOSOFT.net)\n\nThis historic presentation inspired a generation of VR developers - leading at least in part to the OASIS we have today.\n\nCode focused talk that will get everyone started making Microsoft Mixed Reality VR games…\n\n\t• Focus on the latest and greatest VR hardware and software\n\t• Focus on creating VR experiences within Unity / C# and Visual Studio\n\t• Focus on integrating VR controllers\n\t• Focus on creating your own 3D VR launch icons\n\nTarget Audience and Takeaways: Talk will accommodate a wide range of experience levels, introducing many for the first time to amazing XR/AR/VR technologies - getting them started with the tools and information to get them engaged.  Additionally for the more experienced developers, we'll include strong coding examples and resources to grow quickly and start their development futures in this emerging billion dollar field.",
    "author": "Lance Larsen",
    "authorBio": "Lance Larsen (Microsoft MVP) is the Chief Visionary Officer (CVO) of HOLOSOFT as well avid community speaker, technology evangelist -and- president of MADdotNET, the Madison .NET developer community www.MADdotNET.com!\n\nAt HOLOSOFT, we've thrown ourselves into the deep end of MR/AR/VR; Mixed Reality, Augmented Reality and Virtual Reality - and we'll catch you up on what we've learned, available technologies, emerging technologies and the tools we use to write beautiful applications.\n\nLance is also one of the original organizers of That Conference (www.ThatConference.com) - the original Summer Camp for Geeks in the Wisconsin Dells!\n\n@holosoftnet | www.HOLOSOFT.net\n@lancelarsen | www.LanceLarsen.com | lance@holosoft.net",
    "authorEmail": "lance@lancelarsen.com",
    "authorUrl": null,
    "authorTwitter": "lancelarsen",
    "authorGitHub": "",
    "room": "P0808",
    "hour": 10.5,
    "pictureUrl": "/assets/images/speakers/tccc22/lance-larsen.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/808",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000011",
      "SerializedSizeOnDisk": 2689
    }
  },
  {
    "eventId": "tccc22",
    "title": "The Developer's Guide to Promoting Your Work",
    "abstract": "A few years ago, I had an idea to make the web better. It was going to be great, and I had the team to build it. Nine months of late nights and lost weekends later, we launched it! The problem: no one cared.\n\nA brilliant project isn't enough. I had to spread my vision, which was difficult for a developer like me. I learned quickly that even the best ideas needed to be sold. I had to build an audience, tell a story, and win over customers. Join me for a developer's guide to marketing. I'll share hard-fought lessons on page design, social networking, advertising, and analytics that will help you bring your ideas to the world.",
    "author": "Todd Gardner",
    "authorBio": "Todd Gardner is a veteran web developer and cofounder of [TrackJS](https://trackjs.com/), where he helps thousands of developers find and fix bugs in their web apps. He believes in simple tools and systems over trends, and testing balanced against risk. He is also the producer and host of [PubConf developer afterparty](https://pubconf.io/). Ask him about craft beer, cool pubs, and maintainable software.",
    "authorEmail": "todd@g12solutions.com",
    "authorUrl": null,
    "authorTwitter": "@toddhgardner",
    "authorGitHub": "toddhgardner",
    "room": "P0806",
    "hour": 10.5,
    "pictureUrl": "/assets/images/speakers/tccc22/todd-gardner.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/809",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000012",
      "SerializedSizeOnDisk": 1624
    }
  },
  {
    "eventId": "tccc22",
    "title": "Developing a Nose for Code-Smells",
    "abstract": "As software developers, solving puzzles or finding answers to problems, is an energy source. We love it. We crave it. We code. That drive requires we be equipped with tools that allow us to get better every day at our craft.  One tool that can help us in our daily cyber-strife is a nose for detecting bad, smelly code.  The goal of this talk is to start you off on a path to improve your skills to find & fix bad code. In addition, we will share with you various resources, on-line tools, techniques and styles that can help you sharpen your skills for detecting bad code and administering the best possible antidotes to correct problems in the code you work on... whatever that code may be: legacy, brown-field or green-field (maybe we can exclude museum-worthy code).",
    "author": "Anibal Velarde",
    "authorBio": "Anibal lives in the Twin Cities.  He's a husband, a father and avid software mechanic. He was born and raised in Panama City, Panama. He was fortunate enough to study Comp-Sci and Math in USA. To relax, Anibal plays the guitar... sometimes, he goes on sailing adventures on Lake Superior.",
    "authorEmail": "anibal.velarde@aonbenfield.com",
    "authorUrl": null,
    "authorTwitter": "@anibalvelarde",
    "authorGitHub": "AnibalVelarde",
    "room": "P0838",
    "hour": 10.5,
    "pictureUrl": "/assets/images/speakers/tccc22/anibal-velarde.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/810",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000013",
      "SerializedSizeOnDisk": 1647
    }
  },
  {
    "eventId": "tccc22",
    "title": "Code Java Virtual Battle Bots with Robo Code",
    "abstract": "Learn how to code Virtual Battle Bots in Java using Robo Code.  During the session you'll learn about various Java Coding tactics to build a successful battle bot.  And you'll learn how to update it to make changes, depending on your competitors.   See how much fun it is to learn Java coding while creating virtual robots with different behaviors and strengths.",
    "author": "Thunder PengWin Robotics Team",
    "authorBio": "Nora and Eric are the key programmers from the Thunder PengWin Robotics FTC team.  We are 9th graders at Eagan High School.  We like to find ways to engage youth to learn about coding in a fun and interesting way.  We worked with our team to develop a Coder Dojo session using Robo Code.  It's a fun session and we wanted to share it with you.  We've had success using Robo Code to teach people entry-level Java programming.",
    "authorEmail": "troop54052@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@ThunderPeng",
    "authorGitHub": "thunderpengwins",
    "room": "P1838",
    "hour": 10.5,
    "pictureUrl": "/assets/images/speakers/tccc22/thunder-peng-win-robot.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/812",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000014",
      "SerializedSizeOnDisk": 1399
    }
  },
  {
    "eventId": "tccc22",
    "title": "Instrumenting your way to success",
    "abstract": "Are your log files disorganized? Are they hard to parse and perform an investigation of the performance of your application? Do you have trouble tracking results of an A/B test? Does your business arm require you to have 27 different tracking pixels? If you answered YES to any of these questions come on down and learn how to make your life easier through instrumentation. In this session, we'll dig into how to best instrument an application by looking at a real-world example with a hand-rolled implementation. We'll talk about how to structure the messages and even look at a tool to parse them out so they can provide real business value. Disclaimer: there will be no actual playing of musical instruments in this session.",
    "author": "Chris Johnson",
    "authorBio": "Chris Johnson is a developer, author, teacher, and technology consultant living outside of Madison, Wisconsin. He has been developing application professionally since 2003 when he got his first paycheck as a freelancer. He believes that software development is a craft and an art form, not a science. He enjoys crafting clean code and showing what he has accomplished no matter the tools and materials. When he's not developing he enjoys tinkering with technology and mechanical things, photography, video games, playing hockey along with spending time with his wife, their two daughters and their two dogs.",
    "authorEmail": "chris@johnsonch.com",
    "authorUrl": null,
    "authorTwitter": "@johnsonch",
    "authorGitHub": "johnsonch",
    "room": "P2844",
    "hour": 10.5,
    "pictureUrl": "/assets/images/speakers/tccc22/chris-johnson.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/813",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000015",
      "SerializedSizeOnDisk": 1902
    }
  },
  {
    "eventId": "tccc22",
    "title": "Paying the EquiTax, Web Security in 2018",
    "abstract": "Securely developing a web application starts from the first line of code. Come learn how to hack and secure your own applications. We'll start with basic web attacks and fixes and continue on to more advanced vulnerabilities, spanning multiple web stacks.",
    "author": "Jake Reynolds",
    "authorBio": "I'm a Sr. Security Consultant at NetSPI, a local cybersecurity consulting firm. I've been hacking since 2015 and have been credited in bug bounty programs for Snapchat, Netflix, Fastly, and more. Nowadays I spend my time hacking Fortune 500 companies, guiding development teams on how to secure their code, and creating open source security tools for those lovely Github stars.",
    "authorEmail": "jreynoldsdev@gmail.com",
    "authorUrl": null,
    "authorTwitter": "jreynoldsdev",
    "authorGitHub": "JacobReynolds",
    "room": "P2844",
    "hour": 13.75,
    "pictureUrl": "/assets/images/speakers/tccc22/jake-reynolds.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/826",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000016",
      "SerializedSizeOnDisk": 1217
    }
  },
  {
    "eventId": "tccc22",
    "title": "Winning With Web Components",
    "abstract": "The bar for web development continues to increase. While web frameworks proliferate, the rise of the mobile web has made performance a major concern. Fortunately, web standards have evolved. A new set of web standards, collectively referred to as web components, give us the ability to make custom HTML elements.\n\nWith web components, you can build your own suite of custom elements that work with any JavaScript framework (or none at all). Angular, React, Vue, ShinyNewFramework.js... doesn't matter. You can build a single set of components and use them accross all of your sites. Because they are native browser constructs, applications built with web components also render quickly.\n\nIn this talk, you will learn about the web components standard and how to use them in your application. You'll learn about the why web components are useful, some libraries that can help you build them, and how to integrate them in your own applications. By the end of this talk, you'll be ready to build your own suite of web components.",
    "author": "Dustin Ewers",
    "authorBio": "Dustin Ewers is a consultant at Centare, where he works to help businesses build better software. Dustin has been building software for over 10 years, specializing in Microsoft technologies. He is an active member of the technical community, speaking at user groups and conferences in and around Wisconsin.\n\nWhile not building the software of the future, Dustin likes a mix of low tech and high tech hobbies, including reading, cooking, hiking, and fishing.\n\nHe writes about technology at https://www.dustinewers.com/.\nFollow him on Twitter at @DustinJEwers",
    "authorEmail": "dustin.ewers@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@DustinJEwers",
    "authorGitHub": "DustinEwers",
    "room": "P2844",
    "hour": 12.5,
    "pictureUrl": "/assets/images/speakers/tccc22/dustin-ewers.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/819",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000017",
      "SerializedSizeOnDisk": 2160
    }
  },
  {
    "eventId": "tccc22",
    "title": "Building Command-Line Applications with OAuth in Node",
    "abstract": "Node provided a way to bring JavaScript out of the browser and on to server and desktop. In addition to building web applications, now you can build command line interface applications using JavaScript! Come explore some tools and libraries that will help you in your development, and even learn how to complete an OAuth flow from the command line.",
    "author": "Scott McAllister",
    "authorBio": "Scott McAllister has over 10 years professional experience building applications in several industries. He joined Smartsheet several years ago, building integrations with the Smartsheet API using languages like Java, Node.js, and Python. Now he's helping others learn about a wide range of web technologies. When he's not coding, writing or speaking he enjoys long walks with his wife, skipping rocks with his kids, and is happy whenever Real Salt Lake can manage a win.",
    "authorEmail": "scott.mcallister@smartsheet.com",
    "authorUrl": null,
    "authorTwitter": "@stmcallister",
    "authorGitHub": "stmcallister",
    "room": "P0838",
    "hour": 12.5,
    "pictureUrl": "/assets/images/speakers/tccc22/scott-mcallister.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/816",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000018",
      "SerializedSizeOnDisk": 1430
    }
  },
  {
    "eventId": "tccc22",
    "title": "Mentoring Junior Developers Through Pair Programming",
    "abstract": "Pair programming is being taken on as a standard practice in many large corporations all over the globe. The sharing of knowledge between senior engineers and junior engineers minimizes the siloing of skills by increasing the abilities of junior developers, making them productive much sooner.\n\nPair programming can be an emotional experience, for both for the mentor and the mentee. As seasoned software developers and engineers, mentoring takes a lot of time and patience. It can also be challenging for the mentee to work with someone peering over their shoulder, seeing their every mistake.\n\nThis session will go over some of the things that happen unintentionally while mentoring through pair programming and how they can negatively affect the learner, the learning process, and the relationship itself. More importantly, it’ll talk about what a mentor can do to improve the success of the learner by making adjustments to how they teach.",
    "author": "Jess Stodola",
    "authorBio": "Jess Stodola is software engineer on their Core Application Platforms team at Comcast. In her time there time, she has helped to build an API proxy service providing load balancing, authentication and firewalls using Lua and Python, a portal using React and a backend monitoring system with Elixir. She also dabbles in web development using Ruby in her “free time”.",
    "authorEmail": "jessica_stodola@comcast.com",
    "authorUrl": null,
    "authorTwitter": "@stodomay",
    "authorGitHub": "jtstodola",
    "room": "P0806",
    "hour": 9.25,
    "pictureUrl": "/assets/images/speakers/tccc22/jess-stodola.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/803",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-000000000019",
      "SerializedSizeOnDisk": 1910
    }
  },
  {
    "eventId": "tccc22",
    "title": "Disasters in Software",
    "abstract": "Writing software isn't easy. In fact, it can be insanely hard at times. And when software fails, it can fail in spectacular, dramatic, and/or traumatic ways. In this session, I'll talk about the difficulties in getting software to work and techniques you should use to reduce the chances of epic disasters. We'll discuss well-known incidents of failures, both in software construction and other domains, and we'll learn from these aberrations.",
    "author": "Jason Bock",
    "authorBio": "Jason Bock is a Practice Lead for Magenic (http://www.magenic.com) and a Microsoft MVP (C#). He has over 20 years of experience working on a number of business applications using a diverse set of frameworks and languages such as C#, .NET, and JavaScript. He is the author of \".NET Development Using the Compiler API\", \"Metaprogramming in .NET\", and \"Applied .NET Attributes\". He has written numerous articles on software development issues and has presented at a number of conferences and user groups. He is a leader of the Twin Cities Code Camp (http://www.twincitiescodecamp.com). Jason holds a Master's degree in Electrical Engineering from Marquette University. Visit his web site at http://www.jasonbock.net.",
    "authorEmail": "jasonb@magenic.com",
    "authorUrl": null,
    "authorTwitter": "@jasonbock",
    "authorGitHub": "jasonbock",
    "room": "Garden Room",
    "hour": 15,
    "pictureUrl": "/assets/images/speakers/tccc22/jason-bock.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/827",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-00000000001A",
      "SerializedSizeOnDisk": 1717
    }
  },
  {
    "eventId": "tccc22",
    "title": "Secure Coding",
    "abstract": "Information security involves keeping your systems secure and your company's (and your users) data safe and out of unauthorized hands.  We as developers have a number of very important roles in info sec, and one of those is secure coding.  In this presentation we'll talk about some secure coding practices, examples of vulnerabilities, and practical ways to avoid doing the sort of things that the bad guys exploit.",
    "author": "Mark Kalal",
    "authorBio": "Mark is a software development and IT professional. His experience includes payment processing and handling sensitive data, and the various audits required by regulating agencies. He works on the technology solutions team at AMT Consumer Services.",
    "authorEmail": "mdkalal@gmail.com",
    "authorUrl": null,
    "authorTwitter": "",
    "authorGitHub": "",
    "room": "Garden Room",
    "hour": 9.25,
    "pictureUrl": "/assets/images/speakers/tccc22/mark-kalal.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/801",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-00000000001B",
      "SerializedSizeOnDisk": 1190
    }
  },
  {
    "eventId": "tccc22",
    "title": "Using Async / Await in C# as Designed",
    "abstract": "The syntax for Async / Await in C# is straightforward but the mechanics are not. This discussion will help you to understand those mechanics so you can be a true wizard with Async / Await in C#. While sharing a few advanced scenarios we’ll touch on various topics including: System.Threading.Task, ConfigureAwait, Synchronization Context, Task debugging, Unit Testing, TaskCompletionSource and AsyncLocal. This is for developers who are already comfortable with the basics of Async/Await.",
    "author": "Keith Voels",
    "authorBio": "I've been a .NET Developer for 15 years and currently I am an Application Architect at Aon. We develop and maintain a global platform of 40+ internal line of business applications that serve all areas of the business group. We have the full spectrum of application technologies from web to native to mobile.  I am in personally charged with the shared services framework with a focus on bringing in new technologies and establishing new frameworks and patterns. My passions include the business layer, Async / Await and dependency injection.",
    "authorEmail": "keith@mtkajw.com",
    "authorUrl": null,
    "authorTwitter": "",
    "authorGitHub": "keithdv",
    "room": "P0808",
    "hour": 13.75,
    "pictureUrl": "/assets/images/speakers/tccc22/keith-voels.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/822",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1043332Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1043332",
      "@etag": "01000000-0000-EB6A-0000-00000000001C",
      "SerializedSizeOnDisk": 1585
    }
  },
  {
    "eventId": "tccc22",
    "title": "How to use Excel for good, and not evil (Microsoft Excel for developers)",
    "abstract": "Say the words \"Microsoft Excel\" and you can get anywhere from praised reactions as a great tool to organize loose sets of data, to a clockwork nightmare of spreadsheets that strikes developers as a dagger to the heart. We will show you how to use Excel to improve your experience as a developer; learn tricks to make Excel help write code, create class properties, parse code, use it to supplement your database queries, and more. The talk is intended to provide realistic examples of common problems that developers face, and how Excel can be the right tool for the job, even for a developer.",
    "author": "Alan Wong",
    "authorBio": "Computer Systems Analyst for Platinum Supplemental Insurance since 2016 doing regular software development things. Currently working with C#, JavaScript, and React.\n\nFormerly Administrative Assistant for Concorde Maintenance Services of YYC Airport in Calgary, Alberta, Canada. Developed Excel VBA scripts for Concorde and likely made Excel do things it was never meant to do. \n\nBachelors in Management of Information Systems from  Haskayne School of Business, where they teach you to Excel hard.",
    "authorEmail": "wongyalan@gmail.com",
    "authorUrl": null,
    "authorTwitter": "",
    "authorGitHub": "BaakWu",
    "room": "P1808",
    "hour": 10.5,
    "pictureUrl": "/assets/images/speakers/tccc22/alan-wong.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/811",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1154982Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1154982",
      "@etag": "01000000-0000-EB6A-0000-00000000001D",
      "SerializedSizeOnDisk": 1681
    }
  },
  {
    "eventId": "tccc22",
    "title": "Let's Write a Discord Bot!",
    "abstract": "Discord is a popular VOIP and chat application used by gaming communities and streamers.  In this talk, I'll show you how to get started writing your own bot that interfaces with the service.  We'll cover how to get your application registered, how to get an API key, the libraries available for your particular language, and conclude with a live demo showing the creation of a simple bot from start to finish.",
    "author": "Josh Jones",
    "authorBio": "I'm a senior software developer in the Midwest primarily writing mobile applications and web services.\n\nIn my spare time (when I'm not hopelessly addicted to Elder Scrolls Online) I like to experiment with various languages, micro-controllers, and new gadgets (like VR headsets). I also do some 3D Art and 3D Printing on the side.",
    "authorEmail": "kilauea.jones@gmail.com",
    "authorUrl": null,
    "authorTwitter": "@Dark_Kilauea",
    "authorGitHub": "DarkKilauea",
    "room": "P1808",
    "hour": 15,
    "pictureUrl": "/assets/images/speakers/tccc22/josh-jones.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1350000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/830",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1154982Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1154982",
      "@etag": "01000000-0000-EB6A-0000-00000000001E",
      "SerializedSizeOnDisk": 1306
    }
  },
  {
    "eventId": "tccc22",
    "title": "Automate the Lifecycle of Your Apps with Visual Studio App Center",
    "abstract": "Visual Studio App Center is a the hub of “continuous everything” for you apps: Build, UI test, distribute (think HockeyApp 2.0), see usage analytics and crash reports, and manage push notifications - all in one place.\nWe’ll dive deep into the features, see App Center in action on a few apps, and most importantly, show how you can use App Center to release more frequently, with higher quality, and HAVE MORE FUN, by spending time on coding features instead of clicking buttons and managing overhead.",
    "author": "Tom Soderling",
    "authorBio": "Tom Soderling is a long time .NET developer who discovered Xamarin four years ago and jumped at the chance to write apps for the platform he loves (iOS), using the technology and language he loves (.NET and C#).\nHe is a Xamarin Certified Mobile Developer, a Xamarin.Forms enthusiast, and creator of several apps, like \"How Deep Is It?\"  He’s currently a Sr. Mobile Apps Developer at Polaris Industries, where he rides hogs, and works to improve the off-road riding experience through innovative software like the Ride Command app.",
    "authorEmail": "hey_tommy@icloud.com",
    "authorUrl": null,
    "authorTwitter": "@tomsoderling",
    "authorGitHub": "tomsoderling",
    "room": "P0838",
    "hour": 9.25,
    "pictureUrl": "/assets/images/speakers/tccc22/tom-soderling.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1350000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/865",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1325529Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1325529",
      "@etag": "01000000-0000-EB6A-0000-00000000001F",
      "SerializedSizeOnDisk": 1650
    }
  },
  {
    "eventId": "tccc22",
    "title": "Introduction to Microsoft Visual Studio Team Services",
    "abstract": "Years ago when deploying software you would have to follow a tedious multistep process. A process which would fail under the smallest of errors and inevitably there were errors. Luckily today there are tools to automate not old the deployment process but also the build process. This allows teams and individuals to setup and use continuous integration and continuous deployment. We’ll explore setting up a Git repository, automating builds and deployments from that repository, setting up project work and bug tracking, and creating load tests to measure performance.\n\nMicrosoft Visual Studio Team Services (https://docs.microsoft.com/en-us/vsts/user-guide/what-is-vsts) is a cloud service for collaborating on code development. It provides an integrated set of features that you access through your web browser or IDE client, including:\n\n• Git repositories for source control of your codeBuild and release management to support continuous integration and delivery of your apps\n\n• Agile tools to support planning and tracking your work, code defects, and issues using Kanban and Scrum methods\n\n• A variety of tools to test your apps, including manual/exploratory testing, load testing, and continuous testing\n\n• Highly customizable dashboards for sharing progress and trends\n\n• Built-in wiki for sharing information with your team",
    "author": "Andrew Cook",
    "authorBio": "Andrew Cook is a software developer, speaker, and Paramedic with experience in the Microsoft Stack specializing in cloud application development. You can find more from Andrew on his blog: https://codingwithcookie.com/ . You can also find him on twitter: @codingwcookie (https://twitter.com/codingwcookie).",
    "authorEmail": "codingwithcookie@outlook.com",
    "authorUrl": null,
    "authorTwitter": "@codingwcookie",
    "authorGitHub": "",
    "room": "P0838",
    "hour": 13.75,
    "pictureUrl": "/assets/images/speakers/tccc22/andrew-cook.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.1620000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/929",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.1515695Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.1515695",
      "@etag": "01000000-0000-EB6A-0000-000000000020",
      "SerializedSizeOnDisk": 2250
    }
  },
  {
    "eventId": "tccc22",
    "title": "Encrypting the Web",
    "abstract": "Does your entire web site require HTTPS?  If it doesn't now, it better soon!  The Chrome team just announced starting in July 2018 it will label all HTTP pages as \"not secure\".  Most browsers also require HTTPS to use new features like HTTP/2, service workers, and progressive web apps.   Discover the many benefits of using HTTPS beyond just confidentiality, including integrity and trust.  Review adoption strategies, including how to use HTTP response headers such as Strict-Transport-Security (HSTS) and Content-Security-Policy.  Learn about he misconceptions around HTTPS, and that it isn't as hard to implement as you think.",
    "author": "Robert Boedigheimer",
    "authorBio": "Robert Boedigheimer works for Schwans Shared Services, LLC providing business solutions with web technologies. Robert has been developing web sites for the past 23 years. He is a Microsoft ASP.NET MVP, a Progress Developer Expert (Fiddler), a Pluralsight author, and a 3rd degree black belt in Tae Kwon Do. Robert regularly speaks at national and international events.",
    "authorEmail": "boedie@outlook.com",
    "authorUrl": null,
    "authorTwitter": "@boedie",
    "authorGitHub": "",
    "room": "P0806",
    "hour": 13.75,
    "pictureUrl": "/assets/images/speakers/tccc22/robert-boedigheimer.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2480000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/821",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.5955905Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.5955905",
      "@etag": "01000000-0000-EB6A-0000-000000000021",
      "SerializedSizeOnDisk": 1553
    }
  },
  {
    "eventId": "tccc22",
    "title": "WebAssembly: A Whole New Web Dev Experience",
    "abstract": "<p>Web development is about to undergo a major change! For many years now people have tried to create new web development languages and experiences on top of JavaScript. This was done by transpiling or compiling code into JavaScript.<p>\n\n<p>Now there's an exciting new option: WebAssembly. All modern browsers now have the ability to run assembly language AND JavaScript, which means a lot of existing languages can now run in the browser. Languages such as C, Go, and even C#.</p>\n\n<p>If you've held off on web development because of JavaScript, or been a reluctant JavaScript user, WebAssembly offers you alternatives. The browser is no longer a mono-culture, and the future is very exciting!</p>",
    "author": "Rockford Lhotka",
    "authorBio": "<p>Rockford Lhotka is CTO at Magenic, the leading modern application development firm that addresses your toughest, most complex software development challenges and delivers results.</p>\n\n<p>Rockford is the creator of CSLA .NET, one of the most widely used development frameworks for Microsoft .NET.</p>\n\n<p>He is the author of numerous books and speaks at major technical events around the world. Rocky is also a Microsoft Regional Director and MVP.</p>\n\n<p>Rockford has worked on many projects in various roles, including software architecture, design and development, network administration and project management. Over his career he has designed and helped to create systems for bio-medical manufacturing, agriculture, point of sale, credit card fraud tracking, general retail, construction and healthcare.</p>",
    "authorEmail": "rocky@lhotka.net",
    "authorUrl": "http://www.lhotka.net",
    "authorTwitter": "@rockylhotka",
    "authorGitHub": "rockfordlhotka",
    "room": "P1808",
    "hour": 9.25,
    "pictureUrl": "/assets/images/speakers/tccc22/rocky-lhotka.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2480000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/961",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:12.5955905Z",
      "Raven-Last-Modified": "2019-07-09T17:08:12.5955905",
      "@etag": "01000000-0000-EB6A-0000-000000000022",
      "SerializedSizeOnDisk": 2124
    }
  },
  {
    "eventId": "tccc22",
    "title": "Getting Started with Azure Machine Learning",
    "abstract": "This is a gentle introduction to machine learning with the Azure Machine Learning Studio (no linear algebra required!).  We'll explore it's intuitive interface, and break down the process of creating a trained AI using machine learning. We'll start with learning how to take your data and teach an AI with it. Next we'll learn how to improve the AI using custom scripts.  Finally, we'll look at deploying and using your AI for production scenarios.",
    "author": "Elijah Kulesa",
    "authorBio": "Elijah Kulesa is currently a student studying computer science with an interest in machine learning.",
    "authorEmail": "elijahkulesa@gmail.com",
    "authorUrl": null,
    "authorTwitter": "",
    "authorGitHub": "elijahkulesa",
    "room": "P1838",
    "hour": 15,
    "pictureUrl": "/assets/images/speakers/tccc22/elijah-kulesa.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.3220000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/897",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-07-09T17:08:13.6186144Z",
      "Raven-Last-Modified": "2019-07-09T17:08:13.6186144",
      "@etag": "01000000-0000-EB6A-0000-000000000023",
      "SerializedSizeOnDisk": 1122
    }
  }
]