[
  {
    "eventId": "tccc21",
    "title": "Scratch: Programming for Kids (and adults)",
    "abstract": "Scratch is a program that allows basic coding knowledge to be accessible to all. Developed at MIT, it's changed a lot of kids' minds to the future of coding, and I want to share that with everyone at TCCC21.",
    "author": "Adam Nordquist",
    "authorBio": "Hi there! My name's Adam, and I'm 13, but will be 14 when Code Camp rolls around. I'm an 8th grader at Richfield Middle School, and I'm rather funny and smart (at least I think so). I have been interested in coding and development for a while, and it's changed my life in some ways. TCCC21 is the first conference I've ever spoken at, or at least any big-ish event.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "",
    "authorGitHub": "",
    "room": "P1838",
    "hour": 12.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/AdamNordquist775.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.4800000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/775",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3099538Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3099538",
      "@etag": "01000000-0000-CBE3-0000-000000000001",
      "SerializedSizeOnDisk": 1117
    }
  },
  {
    "eventId": "tccc21",
    "title": "Understanding Async in Javascript",
    "abstract": "Javascript traditionally relied on callback functions to handle asynchronous processes.  As your Javascript application grows, you would encounter \"Callback Hell\", which makes your code unreadable and error-prone.  There are now several ways to combat callback hell, and make your application development more enjoyable.  \n\nThe presentation will quickly go over shortcomings of callback functions, an overview of ES2015 promises, and generators, and how those two paradigms are related to the new ES2016 feature async/await.",
    "author": "Hao Luo",
    "authorBio": "I am a developer living in Chicago.  I work for Microsoft as a technical evangelist.  I'm also getting married in July :)",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@howlowck",
    "authorGitHub": "howlowck",
    "room": "Garden Room",
    "hour": 9.25,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/HaoLuo779.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5240000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/779",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3379530Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3379530",
      "@etag": "01000000-0000-CBE3-0000-00000000001E",
      "SerializedSizeOnDisk": 1194
    }
  },
  {
    "eventId": "tccc21",
    "title": "Building Shiny Web Apps with TypeScript and Angular 2",
    "abstract": "From humble beginnings, JavaScript has gone from a hastily thrown together language for web pages to a hastily thrown together language that runs everywhere. If you can do it with code, you can probably do it in JavaScript. It's the Swiss Army Knife of programming languages. \n\nUnfortunately, JavaScript wasn't designed for the large scale apps we use it in today. We've had to rely on design patterns, willpower, and luck to mitigate JavaScript's failings. However, there is a better way. TypeScript adds features to JavaScript that make it usable on large projects. \n\nAdditionally, the bar for web applications gets higher everyday. jQuery was cool ten years ago, but it doesn't cut it for modern web apps. We need something with a little more horsepower. Angular 2 makes it easy to build clean, modular web apps. \n\nIn this talk, we'll explore TypeScript and Angular 2 and how they can be used together to build large-scale web applications. We will learn how to get started and get up to speed quickly.",
    "author": "Dustin Ewers",
    "authorBio": "Dustin Ewers is a consultant at Centare, where he works to help businesses build better software. Dustin has been building software for over 10 years, specializing in Microsoft technologies. He is an active member of the technical community, speaking at user groups and conferences in and around Wisconsin.\n\u000bWhile not building the software of the future, Dustin likes a mix of low tech and high tech hobbies, including reading, cooking, hiking, and photography.\n\n\u000bHe blogs about technology at https://www.dustinewers.com/.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@dustinjewers",
    "authorGitHub": "https://github.com/DustinEwers",
    "room": "Garden Room",
    "hour": 12.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/DustinEwers774.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/774",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3379530Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3379530",
      "@etag": "01000000-0000-CBE3-0000-00000000001F",
      "SerializedSizeOnDisk": 2148
    }
  },
  {
    "eventId": "tccc21",
    "title": "Functional Reactive Angular",
    "abstract": "Functional! Immutable! Reactive! Angular 2!  This talk has all the buzz words the cool kids are talking about!  We'll discuss each of these topics and build up into a way to build a redux style application using Angular.  Using these concepts will make your application faster and easier to maintain.",
    "author": "John Urberg",
    "authorBio": "John Urberg is a Systems Architect at Lifetouch. He has over two decades experience in the software field working in all aspects of software development. When not working with stakeholders to design solutions, he's spending time with his family or playing the bass guitar.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@jurberg",
    "authorGitHub": "https://github.com/jurberg",
    "room": "Garden Room",
    "hour": 10.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/JohnUrberg786.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/786",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3389545Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3389545",
      "@etag": "01000000-0000-CBE3-0000-000000000020",
      "SerializedSizeOnDisk": 1136
    }
  },
  {
    "eventId": "tccc21",
    "title": "Unit Testing for the Scared, Skeptical and Ashamed",
    "abstract": "Does the mention of the phrase \"unit testing\" make your \"fight or flight\" response kick in? Do you feel like the right time to get started unit testing was a while back and you missed the boat? Do you just have a hard time believing that writing unit tests won't cut your development speed in half? Come learn about getting started unit testing in a judgement-free environment. Examples in C#, but applicable to other languages as well.",
    "author": "J Wynia",
    "authorBio": "Software sellsword, writer and geek. Traditional folk musician. Brewer of beer, mead, and cider. MN Wild fan. Owned by basset hounds. CoFounder of 7 Interruptions",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@jwynia",
    "authorGitHub": "jwynia",
    "room": "Garden Room",
    "hour": 13.75,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/JWynia785.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/785",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3389545Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3389545",
      "@etag": "01000000-0000-CBE3-0000-000000000021",
      "SerializedSizeOnDisk": 1161
    }
  },
  {
    "eventId": "tccc21",
    "title": "Tabs Vs. Spaces - The Greatest Battle of Our Time",
    "abstract": "Tabs. Spaces. Such simple things, yet the epic wars that have been raged around these characters in developer circles have been tumultuous. Countless hours have been wasted in code reviews debating who is right and wrong. Teams have been torn asunder. Trolling has reached internet-crashing proportions. But the question remains: which one is better?\n\nIn this session, we'll cut through the hyperbole and emotions and get down to business. We'll see how compilers work with code, and how tests are set up to yield hard facts on performance and memory usage. We'll use this information to make rationale judgements for our coding standards. Come to this session with a sense of humor, and leave with insight into code analysis, automation, and decision making.",
    "author": "Jason Bock",
    "authorBio": "Jason Bock is a Practice Lead for Magenic (http://www.magenic.com) and a Microsoft MVP (C#). He has over 20 years of experience working on a number of business applications using a diverse set of frameworks and languages such as C#, .NET, and JavaScript. He is the author of \".NET Development Using the Compiler API\", \"Metaprogramming in .NET\", and \"Applied .NET Attributes\". He has written numerous articles on software development issues and has presented at a number of conferences and user groups. He is a leader of the Twin Cities Code Camp (http://www.twincitiescodecamp.com). Jason holds a Master's degree in Electrical Engineering from Marquette University. Visit his web site at http://www.jasonbock.net.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@jasonbock",
    "authorGitHub": "https://github.com/jasonbock",
    "room": "Garden Room",
    "hour": 15,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/JasonBock738.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/738",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3389545Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3389545",
      "@etag": "01000000-0000-CBE3-0000-000000000022",
      "SerializedSizeOnDisk": 2068
    }
  },
  {
    "eventId": "tccc21",
    "title": "Creating an Alexa Skill with AWS Lambda",
    "abstract": "Amazon's Alexa platform is taking the world by storm, helping empower smart homes around the world.  But what many developers may not realize is that this is not a closed platform, in fact it has a thriving marketplace for programs, or Skills as Amazon calls them.  This talk will walk you through the process of creating a simple Skill for Alexa, and deploying into AWS Lambda.  Working copies of the code base will be provided (via GitHub repo) so that attendees should be able to have a skill of their own deployed by the end of the session, which they can then enhance to their heart's content.",
    "author": "Tim Rayburn",
    "authorBio": "Tim Rayburn is a Vice President of Consulting with Improving Enterprises, a software and project management consulting company in Dallas, TX. He is a passionate advocate of apprenticeship and mentorship in corporate environments. Since 2007 he has been awarded the Microsoft MVP in recognition of his expertise and community leadership. He is also a conference organizer, an author, and can be found speaking across the nation on agile processes, software design, and career management. He lives in the North Dallas area with his amazing wife Kate and their loyal dog Gandalf.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "trayburn",
    "authorGitHub": "trayburn",
    "room": "P0808 A&B",
    "hour": 9.25,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/TimRayburn782.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5250000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/782",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3389545Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3389545",
      "@etag": "01000000-0000-CBE3-0000-000000000023",
      "SerializedSizeOnDisk": 1730
    }
  },
  {
    "eventId": "tccc21",
    "title": "Unboxing ASP.NET Core",
    "abstract": "ASP.NET Core is a new open-source Web framework optimized for building cross-platform web apps, IoT apps and mobile backends. ASP.NET Core comes with great new features ready to use out of the box with minimal setup required! In this talk we’ll look at .NET Core, architecture, package management and how to begin weighing the options between choosing .NET Framework and .NET Core. I will also share my experiences and insights while working alongside the .NET Core team at Microsoft to port over an existing project from .NET Framework to .NET Core; as well as the challenges we faced. Core brings Microsoft into the exciting world of open-source, cross-platform and package modularity/portability – Let’s see what we can build!",
    "author": "Kevin Leung",
    "authorBio": "Kevin Leung is a Technical Evangelist at Microsoft working with students, startups and community developers in the Chicago metro and has recently been working with the Microsoft Bot Framework (.NET and Node) and ASP.NET Core technologies in the Open-source area alongside Microsoft's engineering teams. His interests include health and safety innovation with a focus on IoT, hardware and machine learning. Kevin holds a BS in Electrical and Computer Engineering from Rutgers University School of Engineering Class of 2016. His undergraduate career includes a focus with Operating Systems, Embedded Systems, FPGAs and graduate work in VLSI.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@KSLHacks",
    "authorGitHub": "KSLHacks",
    "room": "P0806 A&B",
    "hour": 9.25,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/KevinLeung773.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5260000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/773",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3399530Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3399530",
      "@etag": "01000000-0000-CBE3-0000-000000000024",
      "SerializedSizeOnDisk": 1913
    }
  },
  {
    "eventId": "tccc21",
    "title": "Building Real-time Chess with Socket.io",
    "abstract": "Socket.io is a real-time engine for Node.js. You can use it to build amazing real-time Node apps really simply. Let's build a real-time multiplayer chess game together, using Node, Express and Socket.io from scratch. We'll start by building a basic Express web app hosting a local chess game. Next we'll make it multiplayer adding Socket.io; when you make a move it's reflected on your opponent's screen in real-time without any refresh. We'll finish by publishing it online so you can play with your friends. It will be sweet because you'll learn about websockets and Socket.io by building this fun game, and it's a good way to learn some basics of Node apps if you're a beginner.",
    "author": "David Washington",
    "authorBio": "David Washington is a self-proclaimed hacker.  He’s Microsoft veteran of 12 years, where he’s led the developer teams that built the user experience the Windows Explorer, new form factors and the touch keyboard. He’s picked up awards for winning hacks at TechCrunch Disrupt, he’s regularly asked to speak at technical conferences around the US, and has delivered developer sessions at PDC, BUILD, MidwestJS, MobileMarch, KCDC and HDC. Besides holding multiple design and utility patents, he is continually building projects with open source, IoT, iOS, and the mobile web. David has a particular passion for working with non-technical people to enable things that have never been done with technology before. Currently a Director of developers at Microsoft, where his team works to help and enable startups, students and independent developers do more.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@dwcares",
    "authorGitHub": "dwcares",
    "room": "P0838",
    "hour": 9.25,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/DavidWashington778.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5260000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/778",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3399530Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3399530",
      "@etag": "01000000-0000-CBE3-0000-000000000025",
      "SerializedSizeOnDisk": 2101
    }
  },
  {
    "eventId": "tccc21",
    "title": "Building C# iOS and Android apps with Xamarin",
    "abstract": "Building mobile applications for multiple applications can be a handful - different IDEs, languages, and platform APIs. With Xamarin, all of that is converged with Microsoft's .NET framework and Xamarin, an open source C# solution for writing cross platform mobile applications which export native code. \u000b\nThis session will give you the information you need to understand Xamarin.Forms, which allows you to re-use one code base for both your front and back-end code.  You will live demos illustrating how easy it is to simultaneously create your app for iOS, Android, and the Universal Windows Platform.",
    "author": "Dave Voyles",
    "authorBio": "I am a construction worker turned Technical Evangelist at Microsoft and based out of Philadelphia, PA. My biggest passion is in working with students and startups across the country, to help get their projects off the ground.\n\nMy work frequently has me building projects on game consoles, the web, and high performance mobile applications.\n\nMy role has me speaking in front of audiences of all ages and technical backgrounds on a weekly basis. From that experience, I've learned to put on dynamic and engaging presentations which keep the audience involved in a dialogue, instead of being lectured to.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "DaveVoyles",
    "authorGitHub": "DaveVoyles",
    "room": "P1838",
    "hour": 9.25,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/DaveVoyles739.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5260000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/739",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3399530Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3399530",
      "@etag": "01000000-0000-CBE3-0000-000000000026",
      "SerializedSizeOnDisk": 1776
    }
  },
  {
    "eventId": "tccc21",
    "title": "How to build your damn app already! An introduction to Meteor.",
    "abstract": "If you've been victim of Framework Fatigue, guilty of Over-tooling, and are tired of pre-optimizing your app before you even write a single line of code, this talk is for you. Join me, a serial \"wantrepreneur,\" in seeing how simple it can be to move from idea to MVP with the Meteor development ecosystem.",
    "author": "Josh Longanecker",
    "authorBio": "Josh is a self-taught developer who has worked everywhere from entry-level to team lead over the last 6 years. He is currently working on side projects and guiding local developers through Free Code Camp.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@joshlovesdesign",
    "authorGitHub": "notarypublic",
    "room": "P2844",
    "hour": 9.25,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/JoshLonganecker771.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5260000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/771",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3399530Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3399530",
      "@etag": "01000000-0000-CBE3-0000-000000000027",
      "SerializedSizeOnDisk": 1108
    }
  },
  {
    "eventId": "tccc21",
    "title": "Breaking Into Bots",
    "abstract": "Step into the world of Conversational Bots. Taking over platforms one by one, conversational bots are becoming the newest applications wanted and needed by consumers everyday. If you are wanting to learn how to get into the world of Conversation Bots, this talk is for you. Gabrielle will take you step by step on how to get your proper tools, building a bot, deploying it to the cloud and how to get it up and running on different platforms. This is an ideal session for those who are familiar with Node.js and would like to apply it to something new.",
    "author": "Sarah Sexton",
    "authorBio": "Sarah Sexton is a Technical Evangelist, a dedicated advocate for technology, committed to highlighting strengths and seeing more women and minorities get involved in game development. Her responsibilities at Microsoft include public speaking, writing code, blogging and tweeting about cool services, and interacting with communities in the Midwest. She helps developers find success on Windows platforms through meetups, conferences, university workshops, and game jams. She is also a co-founder of the Voxelles: Chicago’s Women in Game Development. She focuses on Unity, Construct2, BizSpark, Visual Studio, C#, Node.js, Bootstrap, and Git. She is most passionate about diversity, inclusion, and communicating clearly.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@Saelia",
    "authorGitHub": "SarahSexton",
    "room": "P0808 A&B",
    "hour": 10.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/SarahSexton795.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5270000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/795",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3465128Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3465128",
      "@etag": "01000000-0000-CBE3-0000-000000000028",
      "SerializedSizeOnDisk": 1812
    }
  },
  {
    "eventId": "tccc21",
    "title": "Building Reusable UI Components in ASP.NET Core MVC",
    "abstract": "ASP.NET proper MVC developers have long relied upon partial views and HTML helpers to construct reusable UI components. ASP.NET Core MVC expands the arsenal of options for creating such UI components by introducing view components and tag helpers. Do these new offerings render partial views and HTML helpers obsolete? Absolutely not!\n\nUsing the right tool for the job is important, which means understanding the differences between these options is paramount. In this session, you’ll gain an understanding of when it’s most appropriate to use each of them in the real world. You’ll also see how to create basic view components and tag helpers.",
    "author": "Scott Addie",
    "authorBio": "Scott Addie is an avid blogger and technical evangelist of the modern web who has reached masses of developers through speaking engagements at user groups, code camps, and conferences across North America. With a strong emphasis on JavaScript and the Microsoft web technology stack, Scott holds numerous industry-recognized Microsoft development certifications and has been named a Microsoft MVP in the award category of Visual Studio and Development Technologies. As a firm believer in giving back to the community, Scott is a frequent open source contributor to high-profile GitHub projects, including ASP.NET Core, OmniSharp, Visual Studio Code, and a plethora of Visual Studio proper extensions.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@Scott_Addie",
    "authorGitHub": "scottaddie",
    "room": "P0806 A&B",
    "hour": 10.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/ScottAddie770.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5270000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/770",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3465802Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3465802",
      "@etag": "01000000-0000-CBE3-0000-000000000029",
      "SerializedSizeOnDisk": 1925
    }
  },
  {
    "eventId": "tccc21",
    "title": "Approaching WebAssembly",
    "abstract": "WebAssembly is a new low-level, high-performance alternative to JavaScript on the Web. As an open standard developed by Mozilla, Google, Microsoft, and Apple, WebAssembly will eventually run everywhere that JavaScript does: in every major Web browser, and in runtimes like Node.js and Electron which are derived from those browsers.\n\nAfter three years of research and experimentation, WebAssembly is finally real. The specification has stabilized, and the first implementation debuted with Firefox 52 on March 7th, and in Chrome shortly thereafter.\n\nThis talk examines WebAssembly from a practical standpoint, answering what it is, why it was created, how it works, and how you can use it today.",
    "author": "Dan Callahan",
    "authorBio": "Dan Callahan is a Staff Software Engineer in Mozilla's Developer Relations team, where he focuses on emerging technologies including WebAssembly, Rust/Servo, and Firefox's new WebExtension add-on API. Dan previously worked on the Mozilla Persona project, an attempt at replacing passwords with user-friendly public key cryptography built on open web standards. Dan tweets as @callahad and swears he has every intention to blog at https://dancallahan.info.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "callahad",
    "authorGitHub": "callahad",
    "room": "P0838",
    "hour": 10.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/DanCallahan792.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5270000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/792",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3469525Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3469525",
      "@etag": "01000000-0000-CBE3-0000-00000000002A",
      "SerializedSizeOnDisk": 1692
    }
  },
  {
    "eventId": "tccc21",
    "title": "Augmented Eyes = Azure Cognitive Services + Hololens",
    "abstract": "The Information Age has Evolved, Welcome to the Age of Experiences!\n\nWe are living through another critical stage in the evolution of technology. \n\nWe - and especially those that follow us - will no longer be satisfied with looking at flat computer screens either at our desks, or even on our mobile devices.  \n\nWe will come to demand to be immersed within a data enhanced visual environment. \n\nWith but a single glance, we are at the very beginning of looking at our world through Augmented Eyes. \n\n\nAzure's Cognitive Services provides a number of powerful but easy to use services for Facial Recognition, Emotional Recognition, and Visual Analysis.\n\nNow - unite that with the Augmented Reality of Hololens… and we are living Sci-Fi today.\n\nJoin Microsoft MVP, Lance Larsen for this code-heavy talk with many examples of how you can start utilizing Cognitive Services today, and how you can shape the visual future with the Hololens!",
    "author": "Lance Larsen",
    "authorBio": "Lance Larsen is a Microsoft MVP, an avid Community Speaker -and- president of Madison's .NET developer community (www.MADdotNET.com), he has his Master’s Degree in Computer Science with a focus on Artificial Intelligence and Computer Cognition.\n\nLance is a founder of HOLOSOFT™ (www.HOLOSOFT.net) - AR / VR software and hardware - where the technological evolution of the Immersive Human-to-Machine Interface is being redefined.\n\nLance is also one of the original organizers of That Conference (www.ThatConference.com) - the original Summer Camp for Geeks in the Wisconsin Dells!\n\nLanceLarsen.com - lance@lancelarsen.com",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "lancelarsen",
    "authorGitHub": "lancelarsen",
    "room": "P1838",
    "hour": 10.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/LanceLarsen787.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5270000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/787",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3469525Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3469525",
      "@etag": "01000000-0000-CBE3-0000-00000000002B",
      "SerializedSizeOnDisk": 2163
    }
  },
  {
    "eventId": "tccc21",
    "title": "Why You Really Need Azure Functions",
    "abstract": "Have some code that's maybe not quite a full application that you need to deploy without worrying about the hassle of managing environments? Well look no further than Azure Functions! Yes, you're probably thinking there's already a dozen other ways to host an application that you already know about so why think about another? Azure Functions provide a uniquely flexible platform which allows developers to deploy code in multiple ways using multiple languages while being able to bind directly Azure or HTTP based triggers. If that doesn't sound appealing then at least you could tell everyone you're going serverless, which sounds cool, right? In this session we'll explore scenarios where using Azure Functions could be useful, pros and cons compared to other technologies, and plenty of examples to give you some ideas.",
    "author": "Jason Lattimer",
    "authorBio": "Jason Lattimer (Greenville, WI) is a Development Manager with PowerObjects (Minneapolis, MN) and a Microsoft Business Solutions MVP. Other interests outside of creating custom solutions for Dynamics CRM/365 include Azure and developer tools. When not helping out in forums or talking to user groups he's busy writing code and tools to hopefully make other developer's lives easier.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@JLattimer",
    "authorGitHub": "https://github.com/jlattimer",
    "room": "P2844",
    "hour": 10.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/JasonLattimer784.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5280000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/784",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3469525Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3469525",
      "@etag": "01000000-0000-CBE3-0000-00000000002C",
      "SerializedSizeOnDisk": 1781
    }
  },
  {
    "eventId": "tccc21",
    "title": "Docker for Everyone",
    "abstract": "Docker is an amazing tool, but unless you work with it every day, you're probably left with a ton of questions. What's a container? What's an image? What's the difference between Docker, Machine, Compose, and Swarm? Why the heck should I care? Well, Docker makes it easier than ever to deploy and scale your applications and services. In addition, it lets you simulate your production environment on your local machine without heavy virtual machines. In this talk, we'll explore the basics of Docker, create a custom image for a web application, create a group of containers, and look at how you can put your apps into production on various cloud providers. At the end of the talk, you'll have the knowledge you need to put this to use with your own applications.",
    "author": "Brian Hogan",
    "authorBio": "Brian Hogan is a web developer, editor, and author of nine technical books including \"Exercises for Programmers\" and \"tmux 2 - Productive Mouse-Free Developmnet.\"  He currently works at DigitalOcean, helping developers like you learn how to put their apps into production.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@bphogan",
    "authorGitHub": "napcs",
    "room": "P0808 A&B",
    "hour": 12.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/BrianHogan772.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5280000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/772",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3469525Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3469525",
      "@etag": "01000000-0000-CBE3-0000-00000000002D",
      "SerializedSizeOnDisk": 1572
    }
  },
  {
    "eventId": "tccc21",
    "title": "Designing Serverless Applications",
    "abstract": "Serverless compute makes it is soooo easy to create an http endpoint or just run arbitrary code in the cloud. But with great power comes great responsibility and often we see customers making fundamental design mistakes that end up effecting their Serverless performance. Join Dave Strebel, Microsoft Azure Cloud Specialist, for this demo heavy session to get an intro to Azure Function and view some best practice for building Serverless application on Azure using Azure Functions and many other Azure services. In this session will dive into Serverless design principles and architecture considerations effecting performance and overall functionality. Demos and architectural examples are based on real customer scenarios.",
    "author": "Dave Strebel",
    "authorBio": "Dave Strebel currently serves as Cloud Technical Specialist for Microsoft, with a long-term focus on distributed system design and cloud computing technologies. Dave brings over 15 years of hands-on experience in the architecture of distributed and virtualized systems. On the side, he is the organizer of the Minnesota Cloud Foundry and Docker Meetups.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@dave_strebel",
    "authorGitHub": "http://www.github.com/dstrebel",
    "room": "P0806 A&B",
    "hour": 12.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/DaveStrebel790.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5350000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/790",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3479532Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3479532",
      "@etag": "01000000-0000-CBE3-0000-00000000002E",
      "SerializedSizeOnDisk": 1656
    }
  },
  {
    "eventId": "tccc21",
    "title": "Async/Await: Pain in the Async",
    "abstract": "An overview of advanced Async/Await topics. Async/await is great and easy!! Unit it's not. This will be a walk thru of the areas where Async/Await can be difficult and how to deal with them. Topics include: System.Task, exception handling, avoid void Async, unit testing including Moq, async constructors (or lack thereof), deadlocks and ContinueWith, Reactive Extensions and synchronization context. The focus will be on code examples and research resources.",
    "author": "Keith Voels",
    "authorBio": "I've been a .NET Developer for 15 years. Right now I am an application architect at Aon. My department develops internal line of business applications using Microsoft technologies. I am in charge of the shared services framework with a focus on bringing in new technologies and establishing new frameworks and patterns.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "",
    "authorGitHub": "keithdv",
    "room": "P0838",
    "hour": 12.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/KeithVoels783.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5360000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/783",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3479532Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3479532",
      "@etag": "01000000-0000-CBE3-0000-00000000002F",
      "SerializedSizeOnDisk": 1312
    }
  },
  {
    "eventId": "tccc21",
    "title": "Connecting the Internet with the Thing Using the Particle Platform",
    "abstract": "If you're used to programming software but are curious about connecting the internet with something physical, this talk is for you! I'll go over how to solder to an LED, hook it up to a Particle Core, and communicate with it from the internet.",
    "author": "Kristina Durivage",
    "authorBio": "Kristina Durivage is a software engineer by day and a hardware hacker by night.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "gelicia",
    "authorGitHub": "gelicia",
    "room": "P2844",
    "hour": 12.5,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/KristinaDurivage791.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5360000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/791",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3479532Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3479532",
      "@etag": "01000000-0000-CBE3-0000-000000000030",
      "SerializedSizeOnDisk": 911
    }
  },
  {
    "eventId": "tccc21",
    "title": "The Importance of Networking",
    "abstract": "Relationships Matter\n\nNetworking with people has been a key factor in Jen's successful sales career.  Early on, she realized that helping others came naturally and in return people are willing to help her.  All of her job opportunities have come from some kind of networking, she continually builds new business through her connections and is constantly helping others connect with the right people to reach their goals.  Whether it’s through direct personal relationships or simply making connections on Linked In. \n\nAs she has integrated into the IT Industry, she become aware that networking does not come naturally to a lot people. This presentation will help those who want to learn some basic tips and tricks on how to meet new people and create deep lasting relationships.",
    "author": "Jen Simon",
    "authorBio": "Jennifer has been in sales for over 20 years, she focuses on partnering with clients to develop and maintain relationships.   Jennifer takes care of her clients by listening to business needs, matching the correct consultant/team and continually works on creating deep partner relationships.  She also has a passion for technology and continually wants to learn more.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@jenniferlsimon",
    "authorGitHub": "",
    "room": "P0808 A&B",
    "hour": 13.75,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/JenSimon737.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5360000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/737",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3489523Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3489523",
      "@etag": "01000000-0000-CBE3-0000-000000000031",
      "SerializedSizeOnDisk": 1693
    }
  },
  {
    "eventId": "tccc21",
    "title": "How to Scale .NET Apps with Distributed Caching",
    "abstract": "Your .NET applications may experience database or storage bottlenecks due to growth in data volume, session volume/length or size of objects. Learn how to remove bottlenecks and scale your .NET applications using distributed caching. This talk covers:\n•\tQuick overview of scalability bottlenecks in .NET applications\n•\tDescription of distributed caching and how it solves response time issues \n•\tWhere you can use distributed caching in your application(s)  \n•\tSome important features in a distributed cache \n•\tHands-on examples using a distributed cache",
    "author": "Iqbal Khan",
    "authorBio": "Iqbal is Alachisoft’s President and Technology Evangelist. His Master’s of Computer Science from Indiana University, 25+ years of software architecture, design and development, plus deep business experience make him a great resource. He speaks frequently at .NET events including DevWeek London, TechDays France and VS Live! shows along with local .NET Code Camps and Meetups. He has written for MSDN magazine, CodeProject and Visual Studio Magazine.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@ncache",
    "authorGitHub": "",
    "room": "P0806 A&B",
    "hour": 13.75,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/IqbalKhan781.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5360000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/781",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3489523Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3489523",
      "@etag": "01000000-0000-CBE3-0000-000000000032",
      "SerializedSizeOnDisk": 1582
    }
  },
  {
    "eventId": "tccc21",
    "title": ".Net Compiler Platform (Roslyn) and You",
    "abstract": "Over the last seven years, the C# and VB compilers were re-written from the ground up. Visual Studio 2015 includes this new compiler and features new extensibility and language capabilities. In this session, we will focus on how these changes will impact you as a C# or VB developer in your day-to-day development. We'll start with exploring the new language features. We'll then look at how to take advantage of code diagnostics and fixes that are publically available. We'll end by exploring some of the extensibility points that you can take advantage of if you want to build your own diagnostics and code fixes.",
    "author": "Jim Wooley",
    "authorBio": "By day, Jim Wooley is a Solution Architect for Slalom Consulting, In his free time, Jim is a frequent speaker, MVP, and author of \"LINQ in Action\". He is always striving to stay at the forefront of technology and enjoys the thrill of a new challenge. He has been active evangelizing LINQ since its announcement in 2005. In addition, he attempts to pass on the insights he has gained by being active in the community, including organizing and speaking at code camps and regional events, including MIX, VS Live, CodeMash, KCDC, That Conference, DevWeek, and CodeStock.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "jimwooley",
    "authorGitHub": "jwooley",
    "room": "P0838",
    "hour": 13.75,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/JimWooley769.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5370000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/769",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3489523Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3489523",
      "@etag": "01000000-0000-CBE3-0000-000000000033",
      "SerializedSizeOnDisk": 1734
    }
  },
  {
    "eventId": "tccc21",
    "title": "Speed vs. Speed to Market",
    "abstract": "We all agree that performance is important, but in our zeal to be first to market, we don’t realize that performance problems exist until a site is already in production. This talk is intended to arm developers and other technically-inclined professionals with knowledge that will help them be proactive in addressing this difficult problem. In this session, you’ll learn about:\n\n- Evoking genuine concern for performance by helping your colleagues identify your site’s target audience, and identify that audience’s capabilities by using data from Akamai’s State of the Internet connectivity report.\n\n- How to use this newly-acquired information in concert with automated testing tools to approximate what key performance metrics will be for your users.\n\n- Spring into action by automating optimization tasks with Node and gulp, so that you’ll be optimizing as you develop, instead of after the fact.\n\n- Some techniques for achieving quick performance wins for troublesome sites already in production, such as resource hints, PostCSS and more.",
    "author": "Jeremy Wagner",
    "authorBio": "Jeremy Wagner is a performance-obsessed front end developer, author and speaker living and working in the frozen wastes of Saint Paul, Minnesota. He is also the author of the Manning Publications book Web Performance in Action, a web developer's companion guide for creating fast websites.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@malchata",
    "authorGitHub": "malchata",
    "room": "P1838",
    "hour": 13.75,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/JeremyWagner789.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5370000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/789",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3489523Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3489523",
      "@etag": "01000000-0000-CBE3-0000-000000000034",
      "SerializedSizeOnDisk": 1896
    }
  },
  {
    "eventId": "tccc21",
    "title": "Getting Started with Photon",
    "abstract": "This Internet of Things seems to be the rage these days, come see what the \"cool\" kids are hacking on these days.  In this talk we'll look at some of the hardware, code used to control these devices and if the internet is working some examples.  I'll also talk about my experience hacking together little projects using the photon and Raspberry PI.",
    "author": "Chris Johnson",
    "authorBio": "Chris Johnson is a developer, author, teacher and technology consultant living outside of Madison, Wisconsin. He has been developing application professionally since 2003 when he got his first paycheck as a freelancer. He believes that software development is a craft and an art form, not a science. He enjoys crafting clean code and showing what he has accomplished no matter the tools and materials. When he's not developing he enjoys tinkering with technology and mechanical things, photography, video games, playing hockey along with spending time with his wife, their two daughters and their two dogs.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "johnsonch",
    "authorGitHub": "johnsonch",
    "room": "P2844",
    "hour": 13.75,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/ChrisJohnson776.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5370000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/776",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3499535Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3499535",
      "@etag": "01000000-0000-CBE3-0000-000000000035",
      "SerializedSizeOnDisk": 1503
    }
  },
  {
    "eventId": "tccc21",
    "title": "The Psychology of Error: Why Smart Teams do Dumb Things",
    "abstract": "Why do even the smartest teams make decisions that seem dumb in retrospect? What do you do when the biggest impediment to success is your own brain? Even equipped with the best possible data, a growing body of research reveals just how deeply flawed our perceptions, thinking, and conclusions are and why.     Be careful not to assume that agile methods alone are the solution.  \n\nWhat is the Solution? Awareness! By exploring the psychology of error we create the opportunity to overcome many of the pitfalls hindering even the best teams.  We reveal a common condition that lowers individual IQ by 13 points! We show why many teams perform far below the level they think they are. We explore the biases, fallacies, and mental pratfalls common to every one of us rendering even the smartest teams dumb. You’ll come away with an understanding of the very real forces that distort our decisions and concrete tips you can use to mitigate the damage, and avoid these traps altogether.",
    "author": "Ken Howard",
    "authorBio": "Ken is President of Improving Houston, and has been involved in most aspects of software development, training and mentoring for over 30 years. Ken’s specialty is helping companies increase productivity through efficient practices and pragmatic organizational dynamics, which was the topic of the Addison-Wesley book that he co-authored titled Individuals and Interactions: An Agile Guide.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@kenhoward01",
    "authorGitHub": "",
    "room": "P0808 A&B",
    "hour": 15,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/KenHoward793.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5430000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/793",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3499535Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3499535",
      "@etag": "01000000-0000-CBE3-0000-000000000036",
      "SerializedSizeOnDisk": 1944
    }
  },
  {
    "eventId": "tccc21",
    "title": "Cool SQL Server Features Everyone Should Know About",
    "abstract": "We all use SQL Server every day in our jobs, so it pays to know what SQL Server can do for us that will make our jobs easier.  This talk will introduce you to some key features of SQL Server that you might not know about but will definitely want to use once you learn about them.  First, we’ll discuss temporal tables, which provide a convenient way to track all of the changes made to data in a table.  Second, we’ll talk about the JSON support built into SQL Server 2016 and what capabilities it provides us.  Third, we’ll cover some advanced SQL constructs like the MERGE statement and Common Table Expressions that can make the SQL you write simpler.  And finally, we’ll wrap up by talking about the windowing functions in SQL Server, which provide powerful analytic capabilities to our SQL Statements.\n\nAfter this talk, you will better appreciate some of the rich functionality built into SQL Server and understand how to use these capabilities to make your job easier.",
    "author": "David Berry",
    "authorBio": "I'm a Solutions Architect with over 20 years of experience in building software systems. I started out as a Java developer and then switched to .NET in 2003. I've also done significant work with SQL Server and Oracle. I'm a Pluralsight author and I have presented talks at That Conference, Iowa Code Camp, Twin Cities Code Camp, Fox Valley .NET Users Group and the Cedar Rapids .NET Users Group.\n\nIn addition to my Pluralsight coursework and speaking experience, I've done lots of work in helping to mentor others in how to design and build better software systems. I try to bring a pragmatic approach to everything I do, making sure the software I build is simple, understandable and balances responsibilities between different components of the system. When speaking or teaching, I emphasize real world scenarios encountered by developers every day and show how to solve them so you can be more effective at what you do.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@DavidCBerry13",
    "authorGitHub": "",
    "room": "P0806 A&B",
    "hour": 15,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/DavidBerry777.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5430000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/777",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3499535Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3499535",
      "@etag": "01000000-0000-CBE3-0000-000000000037",
      "SerializedSizeOnDisk": 2474
    }
  },
  {
    "eventId": "tccc21",
    "title": "Adding Image and Voice Intelligence to Your Apps with Microsoft Cognitive Services",
    "abstract": "Cognitive Services is a set of APIs that use the power of Machine Learning to enhance your application. Using these APIs, you can quickly add image recognition and analysis; facial recognition, speech recognition, text-to-speech capabilities, and many other features to your application. \n\nIn this presentation, you will learn about the capabilities of these APIs, how to test them, and how to call them via a REST web service and using some helpful .NET libraries.",
    "author": "David Giard",
    "authorBio": "David Giard is a former accountant and a former biochemist, who has been developing solutions using Microsoft technologies for over 2 decades.  Currently, David helps people build solutions in his role as a Microsoft Technical Evangelist. David has been very active in the developer community, speaking at numerous major conferences, code camps, and user groups around the world; helping to lead user groups; and helping to organize conferences and other geek events. He is the host and producer of the mildly popular online TV show Technology and Friends. He is the co-author of the Wrox book Real World .NET, C#, and Silverlight. You can read his latest thoughts at www.DavidGiard.com.  His hobbies include video, photography, sports, and embarrassing his sons.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "davidgiard",
    "authorGitHub": "https://github.com/davidGiard",
    "room": "P0838",
    "hour": 15,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/DavidGiard780.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5430000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/780",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3579524Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3579524",
      "@etag": "01000000-0000-CBE3-0000-000000000038",
      "SerializedSizeOnDisk": 1848
    }
  },
  {
    "eventId": "tccc21",
    "title": "Localizating your ASP.net and Xamarin applications to support multiple languages",
    "abstract": "QONQR (pronounced Conquer) is a mobile game built using Xamarin and ASP.net web platform. This 2 developer company supports applications on Windows Phone, Android and iPhone with a complex Azure cloud platform. QONQR is now available in 7 languages, with translations crowdsourced from the players. In this talk we'll discuss the challenges of supporting an application in multiple languages, UI design, translator coordination, and the unexpected technical challenges.  Out of the box solutions available in .Net can cause significant negative side effects. We'll discuss how to avoid them and will demo how to integrate the Microsoft Multilingual App Toolkit into your cross platform solution.",
    "author": "Scott Davis",
    "authorBio": "Scott is the CEO and lead cloud + mobile developer for QONQR, an indie mobile gaming company in Minneapolis. QONQR (pronounced Conquer) is the GeoSocial game of World Domination. Players battle to capture and control their home towns and surrounding cities. Today QONQR players have captured over a million towns and cities in every country in the world. QONQR players now control over 35% of the populated earth. Prior to QONQR, Scott spent over a decade as a software consultant, business analyst, and project manager, including time as a district manager overseeing 50 direct reports. Scott holds an MBA with an emphasis in Venture management and is a former adjunct professor in the Information Technology Management master's program at St Mary's University.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@scottkdavis",
    "authorGitHub": "",
    "room": "P1838",
    "hour": 15,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/ScottDavis788.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5430000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/788",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3579524Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3579524",
      "@etag": "01000000-0000-CBE3-0000-000000000039",
      "SerializedSizeOnDisk": 2052
    }
  },
  {
    "eventId": "tccc21",
    "title": "Regional Failover and Disaster Recovery in Azure",
    "abstract": "In recent years there have been instances where the Internet is not available across broad geographical regions. One of the benefits of moving to the cloud is being able to utilize geo-redundancy for disaster recovery. Azure has a bewildering array of tools and services available, but the devil is in the details, and using the wrong tool for the job could be, well, disastrous. This session will cover the services and their trade-offs. We will demonstrate a working example of a coordinated solution that gracefully fails over with minimal disruption to the end user.",
    "author": "Anne Bougie",
    "authorBio": "Anne Bougie is a Senior Software Developer at Concurrency, Inc. Anne has been in software development since the mid-90s in many different roles including developer, architect, business analyst, tester, project manager and teacher. She has expertise in a variety of languages and platforms and enjoys speaking as an opportunity to break down complex technical topics to help other understand them. She has been developing for the cloud since 2009. When she is not coding, she is either maintaining her beehives or playing with Arduino projects for beekeeping.",
    "authorEmail": null,
    "authorUrl": null,
    "authorTwitter": "@bougiefever",
    "authorGitHub": "https://github.com/Bougiefever",
    "room": "P2844",
    "hour": 15,
    "pictureUrl": "http://bitshuvafiles01.com/tccc/21/AnneBougie794.jpg",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:38.5440000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/794",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:39.3579524Z",
      "Raven-Last-Modified": "2019-02-22T20:09:39.3579524",
      "@etag": "01000000-0000-CBE3-0000-00000000003A",
      "SerializedSizeOnDisk": 1715
    }
  }
]