[
  {
    "eventId": "tccc7",
    "title": "Applying the MVVM Pattern in Silverlight/WPF",
    "abstract": "<p>    Building an app using XAML is different from both earlier Windows and web development    models. While there's still room for the MVC and MVP design patterns, the unique    capabilities of XAML mean that the Model-View-ViewModel (MVVM) design pattern is    often a better option. In this session you'll get a basic understanding of the MVVM    design pattern itself, and more importantly will see practical examples of its use    in building Silverlight and WPF applications.</p>",
    "author": "Rockford Lhotka",
    "authorBio": "    Rockford Lhotka is the creator of the popular CSLA .NET development framework, and    is the author of numerous books, including Expert C# 2008 Business Objects and Expert    VB 2008 Business Objects. He is a Microsoft Regional Director, MVP and INETA speaker.    He contributes to several major magazines and regularly presents at major conferences    around the world. Rockford is the Principal Technology Evangelist for Magenic (<a href=\"http://www.magenic.com\" target=\"_blank\">www.magenic.com</a>), a company    focused on delivering business value through applied technology and one of the nation's    premiere Microsoft Gold Certified Partners. For more information go to <a href=\"http://www.lhotka.net\" target=\"_blank\">www.lhotka.net</a>.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2490000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/642",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1319587Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1319587",
      "@etag": "01000000-0000-CBE3-0000-0000000001D6",
      "SerializedSizeOnDisk": 1729
    }
  },
  {
    "eventId": "tccc7",
    "title": "ASP.NET MVC with the Spark View Engine",
    "abstract": "<p>    In this session the audience will be introduced to the Spark view engine. The Spark    view engine is an alternative view engine for the ASP.NET MVC and MonoRail frameworks.    The idea of Spark is to allow html to dominate the flow and to allow the code to    fit seamlessly into it. We will delve into creating an ASP.NET MVC app with Spark,    Visual Studio Intellisense integration, and finally wrap things up by unit testing    a Spark view for acceptance testing. To actively participate in this session an    understanding of ASP.NET MVC is advised.</p>",
    "author": "Donn Felker",
    "authorBio": "    Donn Felker is an Independent Consultant in Minneapolis, MN. His company, Agilevent,    is a Midwest .NET solution provider. He has over 9 years of professional experience    in various markets that include – entertainment, health, retail, insurance, financial,    and real estate. He is a MCTS in Web Client Development for .NET 2.0 and 3.5 and    is also a certified ScrumMaster. He is the founder and coordinator of the Twin Cities    Give Camp, the founder of Twin Cities Pragmatic Beer, and now also the leader of    the Twin Cities Developers Guild. He is a writer, presenter and consultant on various    topics ranging from architecture, development in general, agile practices and patterns    &amp; practices.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2490000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/635",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1319587Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1319587",
      "@etag": "01000000-0000-CBE3-0000-0000000001D7",
      "SerializedSizeOnDisk": 1766
    }
  },
  {
    "eventId": "tccc7",
    "title": "Audio Synthesis with Silverlight 3",
    "abstract": "<p>    Silverlight 3 offers new power to developers in being able to work with raw WAV    audio. In this code-heavy session you will see how to produce raw sound wave forms,    work with the sound buffer, and send audio to Silverlight 3. We'll cover topics    such as sequencing, blending, peaks, panning, and how to generate a considerable    amount of annoying noise through your web browser to irritate co-workers.</p>",
    "author": "Mike Hodnick",
    "authorBio": "    Mike Hodnick is a .NET developer and works as a Lead Consultant for Inetium in Bloomington,    MN. He's been writing code professionally in the the Twin Cities area for about    10 years, and in his spare time enjoys camping, hiking, home recording, songwriting,    and conducting highly controversial experiments with WPF and Silverlight.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2490000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/646",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1319587Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1319587",
      "@etag": "01000000-0000-CBE3-0000-0000000001D8",
      "SerializedSizeOnDisk": 1237
    }
  },
  {
    "eventId": "tccc7",
    "title": "Backups! Don't Get Caught With Your Pants Down!",
    "abstract": "<p>    Did you hear about the blog site that disappeared when their system failed and they    didn't have a backup to restore from? Or how about the pet supplier that went out    of business after a DELETE statement removed everything from their database and    there wasn't a backup on hand. These aren't urban myths but rather typical stories    that make the news every couple months. Is your company one database failure from    collapse? In this session, we'll go over the basis of backups. And also go over    the basics and best practices in creating a backup and recovery strategy.</p>",
    "author": "Jason Strate",
    "authorBio": "    Jason Strate, Digineer Inc, has been a Database Architect for over ten years. His    experiences include designing and implementing both OLAP and OLTP solutions involving    clustering servers, database monitoring and tuning, analysis services, DTS/Integration    Services, Reporting Services, and Notification Services. Jason is actively involved    with the local PASS chapter (SQL Server User Group); he is currently serving on    the Executive Board and has presented at monthly meetings. Jason contributed to    Microsoft's published white paper Empowering Enterprise Solutions with SQL Server    2008 Enterprise Edition and actively blogs about SQL Server and related technologies.    Jason participated in the development of Microsoft Certification exams for SQL Server    2008. Over the past year, he has presented at the SSWUG SQL Server Launch Event    and the past two SSWUG Virtual Conferences. He is also scheduled to present at this    year's PASS Summit in Seattle, WA.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2490000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/639",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1319587Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1319587",
      "@etag": "01000000-0000-CBE3-0000-0000000001D9",
      "SerializedSizeOnDisk": 2067
    }
  },
  {
    "eventId": "tccc7",
    "title": "Building Peer-to-Peer Applications",
    "abstract": "<p>    Explore the world of Peer-to-Peer programming. In this session, attendees will be    introduced to the powerful peer-to-peer infrastructure that is present in the Windows    platform. Starting with an overview of peer-to-peer networks including graphing,    grouping, and secure nodes, the talk will move into examples of building peer-to-peer    applications. It will include demonstrations on how to use the PeerChannel infrastructure    in WCF to build an appand how to tap into the Peer APIs directly to harness the    full power of the P2P platform.</p>",
    "author": "Jeff Brand",
    "authorBio": "    Jeff Brand is a .NET Developer in Microsoft's Developer and Platform Group. Jeff    assists customers in evaluating, developing and deploying applications built on    the .NET Framework and the Microsoft platform. He has been with Microsoft for thirteen    years and has served in variety of roles including infrastructure consultant, e-commerce    technology specialist, and enterprise technology advisor.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2500000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/645",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1329587Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1329587",
      "@etag": "01000000-0000-CBE3-0000-0000000001DA",
      "SerializedSizeOnDisk": 1446
    }
  },
  {
    "eventId": "tccc7",
    "title": "Domain Driven Design",
    "abstract": "<p>    Domain Driven Design (DDD) has steadily become more visible to the broader software    development community, and offers some unique approaches to developing complex business    applications. This session will introduce you to the basic concepts of DDD, as well    as some updated thoughts by the author of \"Domain Driven Design: Tackling Complexity    in Software\", by Eric Evans. This session will focus primarily on DDD concepts,    but will also present an implementation example developed on the .NET platform.</p>",
    "author": "Jordan Terrell",
    "authorBio": "    Jordan Terrell is a Consultant at Digineer, with over a decade of experience in    the software development industry. He has been learning and applying Domain Driven    Design techniques on .NET development projects since 2005. He is an avid proponent    of teaching and applying current best-practices and patterns. Jordan is also interested    in embedded microcontroller development and is the author of a DHCP stack for the    Arduino platform. Visit his web properties via <a href=\"http://wiki.jordanterrell.com\" target=\"_blank\">http://wiki.jordanterrell.com</a>.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2500000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/654",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1329587Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1329587",
      "@etag": "01000000-0000-CBE3-0000-0000000001DB",
      "SerializedSizeOnDisk": 1565
    }
  },
  {
    "eventId": "tccc7",
    "title": "Experiences With Multi-Core, HPC Clusters, and GPU Programming",
    "abstract": "<p>    Based on our experience at 3M speeding up numerical processing algorithms for image    processing and ray tracing we will cover topics related to parallel programming    in C/C++ on diverse platforms. By looking at examples using threads, MPI, and OpenMP    on multi-core workstations, high performance computing clusters, and Nvidia GPUs    we will explore some of the issues with programming multiple cores and the performance    gains we have achieved. All the examples will be with Visual Studio 2008 C++ and    Windows.</p>",
    "author": "Richard Moore",
    "authorBio": "    Richard Moore is a Staff Scientist at 3M Company working in the corporate research    Software, Electronics, and Mechanical Systems Laboratory (SEMS). Richard has a Master's    of Science in Electrical Engineering from the University of Nevada Reno. His work    experience over the last 29 years ranges from microprocessor design to leading teams    in the development of commercial software applications and systems. Areas of specialty    and interest include image processing, graphics, printing, color, parallel algorithm    development, high speed computing architectures among many others.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2500000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/648",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1329587Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1329587",
      "@etag": "01000000-0000-CBE3-0000-0000000001DC",
      "SerializedSizeOnDisk": 1635
    }
  },
  {
    "eventId": "tccc7",
    "title": "Extending VS2010: Control your IDE Destiny",
    "abstract": "<p>    Microsoft has made a giant leap with Visual Studio 2010. Moving to a WPF interface    and majorly overhauling the process of adding and managing extensions. The inclusion    of the new VSIX package model and built in managed classes for interacting with    the Editor. It has never been easier to integrate your interface ideas into your    IDE. This track will cover VSIX packages, some of the editor Adorners, debugging    your extension and implementing some more advanced features like Menu Commands and    Tool Windows.</p>",
    "author": "Jeff Klawiter",
    "authorBio": "    Jeff Klawiter is a Senior .NET Developer at Sierra Bravo Corporation. After spending    the 6 years of his professional career as a PHP programmer he fully embraced .NET.    He has worked on projects in ASP.NET, .NET CF 1.-3.5, WinForms, Surface, Silverlight.    Everything from handheld warehouse management systems, vending machines to multitouch    surface applications. His ambitions in life are to learn all there is to know about    programming before he dies and to one day make his own dragon with Biological Programming.    He currently holds MCTS Windows and MCPD ASP.NET certifications.<h3>    Links</h3><ul>    <li><a href=\"http://nerdery.com\">Sierra Bravo</a></li>    <li><a href=\"http://blog.j-maxx.net\">Blog</a></li></ul>",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2500000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/640",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1339601Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1339601",
      "@etag": "01000000-0000-CBE3-0000-0000000001DD",
      "SerializedSizeOnDisk": 1761
    }
  },
  {
    "eventId": "tccc7",
    "title": "Fun! Fun! Fun! With ASP.NET MVC View Engines",
    "abstract": "<p>    ASP.Net MVC (Model View Controller) is one the new shiny technologies from Microsoft.    We will take a quick tour of the M, V, and C of MVC. While the Controllers and the    Models are very nice, the real fun is with the View Engines. That's right! ASP.NET    MVC supports a gaggle of different view engines. We will take a look at a representative    set of view engines (ASP.NET, Spark, and NHAML in some detail) and a quick \"fly    by\" of other (NVelocity and Brail). We will look at the good and bad of the coding    experience, the debugging experience, and the (dreaded) maintenance experience.    All of this will be useful input to the selection of a view engine for your next    project.</p><p>    The secret is that the selection does not have to be exclusive. Fun Fact: you can    use multiple view engines in the same application. Funner (OK, Even More Fun) Fact:    you can even use multiple view engines on the same web page. Come and see how to    make the magic happen. More goodies: see how to write your own view engine for fun    and profit; if I told you how easy it was, you might think it was a scam.</p><p>    But wait! there is more: in our \"Bait and Switch\" department, you can see how to    switch the view that you that you use in order to support mobile browsers. You can    even switch view engines on the fly. Learn how to log data for a subset of web pages    (determined by values in your application configuration file) by using a different    View Engine. Bring up your mastery of this dynamite technique at your next social    gathering and see how many admiring glances you get.</p><p>    And there will be unit testing. Yes, even the HTML produced by a view can be unit    tested. Sprinkle a little pixie dust on the view, chant \"separation of concerns\"    three times, and be able to verify that goodness of the incoming model has been    transformed into even more wonderful HTML. How cool is that?</p>",
    "author": "Jon Stonecash",
    "authorBio": "    Jon Stonecash is a senior consultant at Magenic, a Microsoft Gold Partner consulting    company. Jon Stonecash has worked in software development for much longer than he    would like to admit. In that time Jon has had the opportunity to make most of the    serious software development mistakes at least once. He has programmed in over a    dozen languages including several different assembly languages, Fortran, COBOL,    SNOBOL, classic Visual Basic, VB.NET, and C#. He has survived the structured programming    revolution and the object-oriented revolutions (having inexplicably missed out on    the sexual revolution). Jon's software development activities have included the    development of operating systems, scientific and engineering applications, and enterprise    systems. He has worked in every phase of software development from the initial specification    of requirements through to customer support. Along the way, he picked up a BS in    Mathematics and an MBA. He still has hopes of finding something that he can be reasonably    good at. His long term interests center about databases and the aspects of the application    that handle data access and business logic. He is also interested in the tools and    processes that assist the development process. Jon can be reached at <a href=\"mailto:jons@magenic.com\">        jons@magenic.com    </a>. Jon also has an active blog on \"Designing Out Loud in the    .NET Space\" at <a href=\"http://blog.magenic.com/blogs/jons/default.aspx\" target=\"_blank\">        http://blog.magenic.com/blogs/jons/default.aspx    </a>.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2510000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/650",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1339601Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1339601",
      "@etag": "01000000-0000-CBE3-0000-0000000001DE",
      "SerializedSizeOnDisk": 4033
    }
  },
  {
    "eventId": "tccc7",
    "title": "How Google App Engine Ruined My Life",
    "abstract": "<p>    It's 1:07 AM on a Tuesday morning. You're about to run your Python appengine test    harness for the 75th time this evening (154 tests in 4 seconds). Your test coverage    hovers in the mid 90's percentile. You have to be at work in a few hours. But all    you can think about is mainlining superscalable Internet applications. What happened    to you? Find out some of the ins and outs of Google App Engine.</p>",
    "author": "Nicolaus Bauman",
    "authorBio": "    Nicolaus Bauman is a former Hollywood director who turned away from Tinsel Town    after following up a blockbuster with a bomb so bad he was burned in effigy twice    in one week on his own lot. Now he code quietly in the corner in the much more virulently    realistic Midwest. He's never looked back. So he's have come to relish doling out    the brutal truth rather than the Hollywood version in code and in life.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2610000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/652",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1339601Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1339601",
      "@etag": "01000000-0000-CBE3-0000-0000000001DF",
      "SerializedSizeOnDisk": 1318
    }
  },
  {
    "eventId": "tccc7",
    "title": "Introduction to CSS",
    "abstract": "<p>    Do you still use tables to layout your user interface? Do you still use the &lt;font&gt;    tag or have presentation information scattered throughout your markup? Learn how    to leverage CSS to simplify your web development.</p>",
    "author": "Robert Boedigheimer",
    "authorBio": "    Robert Boedigheimer works for Schwans Shared Services, LLC providing business solutions    with web technologies and leads Robert Boedigheimer Consulting, LLC. Robert has    been designing and developing web sites for the past 14 years including the early    days of ASP and ASP.NET. He is a columnist for aspalliance.com, an ASP.NET MVP,    an author, an \"Early Achiever\" MCSD for .NET with C#, an MCPD: Web with C#, and    a 2nd degree black belt in Tae Kwon Do. Robert has spoken at industry conferences    including the Heartland Developers Conference, DevLink, DevTeach, Tulsa Tech Fest,    DevWeek, TechEd, AJAXWorld, and numerous national and international VSLive! events.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2610000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/630",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1349586Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1349586",
      "@etag": "01000000-0000-CBE3-0000-0000000001E0",
      "SerializedSizeOnDisk": 1386
    }
  },
  {
    "eventId": "tccc7",
    "title": "Introduction to Ruby",
    "abstract": "<p>    Come learn about Ruby, and how it's much more than Rails. Ruby is a dynamic, fully    object-oriented language that borrows from Perl, Smalltalk, and LISP, but provides    a clean, simple syntax usable by hobbiests, but enough power to be used by some    of the most hardcore metaprogrammers in the world. Ruby has caught the attention    of Microsoft, Oracle, Cisco, and Sun, powers sites like Yellowpages.com and Hulu,    and is an absolute joy to work with. In this presentation, you'll learn the fundamentals    of Ruby, and you'll see it in action as we build a simple web service using the    Sinatra microframework, a static web site with StaticMatic, and we'll test a web    site using Cucumber and our browser. Ruby is a lot more than Rails, so come learn    about it today!</p>",
    "author": "Brian Hogan",
    "authorBio": "    Brian Hogan has been developing web sites professionally since 1995 as a freelancer    and consultant. He's built small and large web sites and web applications using    ASP, PHP, and Ruby on Rails. He enjoys teaching and writing about technology, particularly    web design and development.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2610000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/631",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1349586Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1349586",
      "@etag": "01000000-0000-CBE3-0000-0000000001E1",
      "SerializedSizeOnDisk": 1547
    }
  },
  {
    "eventId": "tccc7",
    "title": "Introduction to Silverlight 3",
    "abstract": "<p>    In this talk we will create three examples of commonly requested flash components    but create them in Silverlight. We will create a custom video player, Interactive    Photo Gallery and a Dynamic Menu generated from XML. This presentation will be a    great way for .Net developers to get into Silverlight or induce Flash/Flex Silverlight    and .NET.</p>",
    "author": "Gregory Wurm",
    "authorBio": "    Gregory Wurm is a .Net developer for Sierra Bravo since 2006. He started programming    on the Apple II in grade school and has not stopped since. Recently he took part    in Microsoft's National PhizzPop Challenge and was awarded the top prize at the    SXSW 09. You can find his blog at <a href=\"http://gregorywurm.com\" target=\"_blank\">        http://gregorywurm.com    </a>.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2680000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/632",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1411224Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1411224",
      "@etag": "01000000-0000-CBE3-0000-0000000001E2",
      "SerializedSizeOnDisk": 1217
    }
  },
  {
    "eventId": "tccc7",
    "title": "Introduction to the Microsoft Robotics Developer Studio 2008",
    "abstract": "<p>    The Microsoft Robotics Developer Studio is a robust and powerful environment for    hobbyist, pedagogical and expert robotic design and prototyping. It allows, without    any robotics parts, visual feedback of algorithms for a variety of robotic platforms.    In this talk, we will walk through some of the more interesting features of the    Microsoft Robotics Developer Studio, both the Express version and the Academic/Pro    version. In addition, we will work through a simple example project utilizing the    Visual Programming Language 2008 Express environment and a LEGO MINDSTORMS NXT robot    as well as demo a solution for the Sumo robotics challenge from the 2009 Imagine    Cup.</p>",
    "author": "Dr. Alan C. Jamieson",
    "authorBio": "    Dr. Alan C. Jamieson is an Assistant Professor of Computer Science at St. Mary's    College of Maryland (no, it's not a private school). A theoretician by training,    working in self-stabilizing algorithms and dynamic programming, he also directs    undergraduate research in robotics and game development. He is the current director    for the fledgling SMCM Robotics Laboratory and RiverStudio, an undergraduate student-run    game development studio. He received his PhD in Computer Science from Clemson University    and a B.S. in Computer Science from Tulane University. Dr. Jamieson is also a giant    gamer geek and fancies himself quite the amateur chef.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2690000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/633",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1413896Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1413896",
      "@etag": "01000000-0000-CBE3-0000-0000000001E3",
      "SerializedSizeOnDisk": 1875
    }
  },
  {
    "eventId": "tccc7",
    "title": "Introduction to XAML",
    "abstract": "<p>    Creating a rich user experience involves diving into some unique challenges. How    do you work with data from various sources? How do you take advantage of modern    media elements? What can you do to integrate all these things into an application    that works? XAML provides a powerful schema for approaching the next generation    of rich interactive applications both on the PC and on the Internet. In this session,    we look at the programming model and tools that developers and designers can leverage    to build these true next-generation experiences for consumers and business, and    we demonstrate how to use XAML to build rich interactive applications using XAML    and Microsoft .NET. We explore how to use Microsoft Visual Studio and Microsoft    Expression Blend to create applications and compelling UI using XAML markup, code,    controls, and file I/O. We also discuss networking, how to retrieve data from a    Web service, and various other aspects of building Silverlight applications.</p>",
    "author": "Mike Benkovich",
    "authorBio": "    Mike Benkovich delivers technical presentations around the U.S. as a developer evangelist    on the MSDN team at Microsoft. He has worked in a variety of professional roles,    including architect, project manager, developer, and technical writer. Mike is also    a published author of books from WROX Press and APress that show developers how    to get the most from their SQL databases. Since appearing in the 1994 Microsoft    DevCast, Mike has presented technical information at seminars, conferences, and    corporate boardrooms across America.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2690000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/634",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1413896Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1413896",
      "@etag": "01000000-0000-CBE3-0000-0000000001E4",
      "SerializedSizeOnDisk": 2033
    }
  },
  {
    "eventId": "tccc7",
    "title": "Leveraging Client Capabilities with jQuery in Visual Studio and ASP.NET",
    "abstract": "<p>    Microsoft has embraced the popular jQuery open source JavaScript library, which    is already used by many major web sites. jQuery provides a very productive enivornment    for client side programming in JavaScript. It takes advantage of existing knowledge    of CSS selector syntax to offer a powerful and efficient alternative to the DOM.    The use of operation chaining and implicit iteration lead to a very compact and    productive syntax. The library is very lean at a mere 15K, yet provides a strong    base and a great extensibility model which has led to a large number of plugin extensions    to simplify web development. The session will review how to use the library for    very useful features such as watermarks, avoiding browser inconsistencies, and making    AJAX calls to the server. Several plug ins will be demonstrated which provide stunning    client experiences with as little as 1 line of code! We will also study how to extend    the library with our own custom utility funcitons and plug ins. Learn how Jquery    and the Microsoft AJAX Library JavaScript libraries greatly simplify client side    development, and which to use for particular scenarios.</p>",
    "author": "Robert Boedigheimer",
    "authorBio": "    Robert Boedigheimer works for Schwans Shared Services, LLC providing business solutions    with web technologies and leads Robert Boedigheimer Consulting, LLC. Robert has    been designing and developing web sites for the past 14 years including the early    days of ASP and ASP.NET. He is a columnist for aspalliance.com, an ASP.NET MVP,    an author, an \"Early Achiever\" MCSD for .NET with C#, an MCPD: Web with C#, and    a 2nd degree black belt in Tae Kwon Do. Robert has spoken at industry conferences    including the Heartland Developers Conference, DevLink, DevTeach, Tulsa Tech Fest,    DevWeek, TechEd, AJAXWorld, and numerous national and international VSLive! events.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2700000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/637",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1419571Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1419571",
      "@etag": "01000000-0000-CBE3-0000-0000000001E5",
      "SerializedSizeOnDisk": 2391
    }
  },
  {
    "eventId": "tccc7",
    "title": "Leveraging Social Networking Tools in your Line of Business Apps",
    "abstract": "<p>    Social networking sites are popping up at an incredible rate. In this session, I'll    give a brief overview of some of the more popular / useful social networks and dig    into the Twitter API with a demo building a Twitter client app using VB .NET.</p>",
    "author": "Chris Williams",
    "authorBio": "    Chris Williams is a Principal Consultant for Magenic. He is the founder of several    .NET User Groups on the east coast, and most recently the Twin Cities XNA User Group    and Twin Cities Developers Guild, both in Minneapolis, MN. He is a rabid blogger    at <a href=\"http://www.BlogusMaximus.net\" target=\"_blank\">BlogusMaximus.net</a>,    author of the very popular NINE Questions series and owner of the VB Community site    <a href=\"http://www.ILoveVB.net\" target=\"_blank\">www.ILoveVB.net</a>. His most recent    project is the Charity Fragathon fundraiser event. He's also a Visual Basic .NET    MVP, MCT, MCSD (.NET) Early Adopter, MCAD, INETA Speaker, freelance game developer,    occasional author, tech editor, conference speaker, vintage arcade game collector    and INETA Community Champion. He also plays a pretty mean guitar in Rock Band. Lastly,    yes, the rumors are true, he loves Visual Basic so much he even named his dog VB.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2700000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/636",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1419571Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1419571",
      "@etag": "01000000-0000-CBE3-0000-0000000001E6",
      "SerializedSizeOnDisk": 1723
    }
  },
  {
    "eventId": "tccc7",
    "title": "LINQ Internals",
    "abstract": "<p>    Though Language INtegrated Query provides a revolutionary way to write code in C#    3.0 and Visual Basic 9, it is powerless without several enabling language features    and libraries. This session will explore the technologies that make LINQ possible    and show how you can use the same techniques to make LINQ work for you.</p>",
    "author": "Keith Dahlby",
    "authorBio": "    Keith Dahlby is a .NET developer and language geek from Cedar Rapids, IA. He works    as a SharePoint consultant with Inetium and blogs about SharePoint and .NET at Solutionizing.NET    and Los Techies. Keith is active in the local INETA chapter and has spoken at community    events around the midwest. He is also studying Human-Computer Interaction at Iowa    State University.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2700000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/651",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1429571Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1429571",
      "@etag": "01000000-0000-CBE3-0000-0000000001E7",
      "SerializedSizeOnDisk": 1174
    }
  },
  {
    "eventId": "tccc7",
    "title": "Managed Extensibility Framework",
    "abstract": "<p>    The Managed Extensibility Framework (MEF) keeps showing up in an increasing number    of areas. Whether it is heard in the context of Prism, RIA Services, the MVC framework    or even Visual Studio 2010, MEF is mentioned as a core enabling technology. Some    people have even used MEF as an IoC container. In MEF everything is an extension    and everything is an extensible – including the extensions themselves. This introduction    is focused on describing what MEF is (and equally important - what it isn't), we'll    walk through a real-world scenario of changing an application to use MEF and get    a glimpse at how MEF will change how we think about application composition.</p>",
    "author": "Steve Hebert",
    "authorBio": "    Steve Hebert created the dotMath open source library on CodePlex. Steve has also    co-authored an ANSI plugin specification in the control space and created a plugin    pattern that was awarded an international patent. Steve has been focusing on the    .Net space since its inception and primarily around the web space for that entire    time. Steve currently works for ThomsonReuters in the financial markets space.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2810000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/647",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1429571Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1429571",
      "@etag": "01000000-0000-CBE3-0000-0000000001E8",
      "SerializedSizeOnDisk": 1587
    }
  },
  {
    "eventId": "tccc7",
    "title": "No More Excuses: Test Your Javascript!",
    "abstract": "<p>    Javascript errors are nasty. All too often when a developer writes a web application,    they may write fantastic unit and functional tests, but forget that all-important    final layer of testing Javascript. Few enjoy debugging scripting errors, so we'll    take a look at how to use libraries like Screw.Unit, Smoke, JSpec, and JSocka to    help address those typos, errors, and even more dangerous design issues of \"Doing    the wrong thing right.\"</p>",
    "author": "Kevin Gisi",
    "authorBio": "    Kevin Gisi is a Ruby on Rails application developer at the University of Wisconsin    - Eau Claire. A Rails Rumble 2008 award winner for an accessibility-focused web    application, Kevin is a strong advocate for accessibility-mindful application design,    test-driven development, and writing clean code. Kevin is the author of the JSocka    mocking and stubbing framework for Javascript, and is currently writing Firefox    Extensions: Creating Tools for Productivity for the Pragmatic Bookshelf.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2810000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/641",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1429571Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1429571",
      "@etag": "01000000-0000-CBE3-0000-0000000001E9",
      "SerializedSizeOnDisk": 1442
    }
  },
  {
    "eventId": "tccc7",
    "title": "Scripting Data Sources and Destinations in SSIS 2008 and SSIS 2008R2",
    "abstract": "<p>    In this talk we will example how scripting can be used to leverage atypical data    sources with SSIS Data Flows. We will look at how to write a script and library    for reading metadata from media files as well as creating custom XML data destinations.</p>",
    "author": "Kent Tegels",
    "authorBio": "    Kent Tegels is a member of the technical staff at Pluralsight, where he focuses    on SQL Server and Business Intelligence. Kent is also an Adjunct Professor for Business    and Computer Science. Since the 1980s, Kent has been building systems and educating    his fellow developers, adminstrators and analysts. He spends his time teaching Microsoft    technologies to students and developers world wide. Kent enjoys helping people achieve    their \"AH-HA!\" moments.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2820000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/644",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1429571Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1429571",
      "@etag": "01000000-0000-CBE3-0000-0000000001EA",
      "SerializedSizeOnDisk": 1243
    }
  },
  {
    "eventId": "tccc7",
    "title": "So Your Boss Wont Let You Use F# - Functional Programming in C#",
    "abstract": "<p>    In this talk, Aaron Erickson covers how to do do F# style functional programming    - even when your boss won't let you. C# has many of the tools you need in order    to do many things that you would do in functional programming. Everything from immutable    structures, Linq to Objects, PLinq, and most importantly, design techniques such    as Command/Query separation are discussed in this session that will have you writing    F# code using C# in no time!</p>",
    "author": "Aaron Erickson",
    "authorBio": "    Aaron Erickson is the author of \"The Nomadic Developer – Surviving and Thriving    in the World of Technology Consulting\" (<a href=\"http://tinyurl.com/buynomadbook\" target=\"_blank\">http://tinyurl.com/buynomadbook</a>). He is a Lead Consultant    for ThoughtWorks Inc., where he helps the world's most ambitious companies get the    most from their technology investments.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2820000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/643",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1439558Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1439558",
      "@etag": "01000000-0000-CBE3-0000-0000000001EB",
      "SerializedSizeOnDisk": 1357
    }
  },
  {
    "eventId": "tccc7",
    "title": "Start Developing Flash Applications...for Free!",
    "abstract": "<p>    With the open-source release of Adobe's Flex SDK, anyone can start developing Flash    applications. It's true that Adobe's tools -- the Flash and Flex IDEs -- help make    developing Flash applications easier. But with knowledge of some particular parts    of the Flex compiler and Actionscript 3, a person could actually run a professional    Flash development business with no up front cost! Join Andrew as he takes you through    downloading and configuring the Flex SDK with a particularly cool and free IDE.    You'll see Actionscript 3 in action, covering those aspects of the language that    will help you make real-world interactive applications. Together you'll make an    XML-driven website navigation menu. Come and get your Flash development career started    for free!</p>",
    "author": "Andrew Watson",
    "authorBio": "    Andrew Watson is currently an Interactive Developer at Sierra Bravo Corp. in Bloomington.    He likes making cool products with cool tools, which in his career has included    applications developed in Actionscript, .NET, PHP, and mobile Java. If he can make    you smile while using one of his applications, then his work is done.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2820000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/638",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1439558Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1439558",
      "@etag": "01000000-0000-CBE3-0000-0000000001EC",
      "SerializedSizeOnDisk": 1616
    }
  },
  {
    "eventId": "tccc7",
    "title": "T4: Stop Coding and Start Generating",
    "abstract": "<p>    Did you know Visual Studio 2008 comes with a code generator? Well it does, and you    should learn to use it so you can stop writing repetitive code (i.e. DTO's and DAL's)    and generate it. Come to this session to learn about the Text Template Transformation    Toolkit (T4). T4 allows you to use simple ASP.NET-like template syntax to generate    application source code, configuration files, stored procedures and more. This session    will give you all the information you need to start using T4 effectively in your    project, TODAY! We will go from basics (such as T4 template syntax) to advanced    topics (such as template design and use of T4 in large projects) stopping along    the way to create several templates from scratch.</p><p>    This will be a PowerPoint free presentation. No slides, just code!</p>",
    "author": "Adam Grocholski",
    "authorBio": "    Adam Grocholski has a great job at RBA Consulting in Minneapolis, MN where he has    been working since 2006. Lately he has been diving into the latest and greatest    UI technologies such as Silverlight and WPF and showing his clients how they can    leverage these technologies to create compelling line of business applications.    Adam also has a strong commitment to the local developer community. From co-founding    the Twin Cities Cloud Computing user group, to hosting nerd dinners, to speaking    at the .NET and Silverlight user groups and code camps. When not working he enjoys    spending time with his two awesome daughters and amazing wife. You can catch up    with his latest projects and thoughts on technology at <a href=\"http://thinkfirstcodelater.com\" target=\"_blank\">http://thinkfirstcodelater.com</a>, or if that's a bit too verbose    for your liking you can always follow him on twitter at <a href=\"http://twitter.com/agrocholski\" target=\"_blank\">http://twitter.com/agrocholski</a>.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2820000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/649",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1439558Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1439558",
      "@etag": "01000000-0000-CBE3-0000-0000000001ED",
      "SerializedSizeOnDisk": 2323
    }
  },
  {
    "eventId": "tccc7",
    "title": "What Will Pex Do?",
    "abstract": "<p>    Pex is a tool that, at first glance, looks like it's all about testing your code    in ways you never dreamed of. However, there's a lot more to Pex than that. In this    session, we'll cover the testing capabilities of Pex along with exploring the advanced    technologies that come with Pex, such as Stubs/Moles and Z3.</p>",
    "author": "Jason Bock",
    "authorBio": "    Jason Bock is a Principal Consultant for Magenic, and is also a Microsoft MVP. He    has worked on a number of business applications using a diverse set of substrates    and languages such as C#, .NET, and Java. He is the author of \"Applied .NET Attributes\",    \"CIL Programming: Under the Hood of .NET\", \".NET Security\", and \"Visual Basic 6    Win32 API Tutorial\". He has written numerous articles on software development issues    and has presented at a number of conferences and user groups. Jason holds a Master's    degree in Electrical Engineering from Marquette University.<h3>    Links</h3><ul>    <li><a href=\"http://www.magenic.com\">Magenic</a></li>    <li><a href=\"http://www.jasonbock.net\">Personal Site</a></li></ul>",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.2830000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/653",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.1439558Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.1439558",
      "@etag": "01000000-0000-CBE3-0000-0000000001EE",
      "SerializedSizeOnDisk": 1531
    }
  }
]