[
  {
    "eventId": "tccc8",
    "title": ".NET Continuous Integration with Hudson and NAnt",
    "abstract": "<p>    Need to implement Continuous Integration but can't afford Team Foundation Server?    Hudson is an open-source CI platform that is easy to use and is has a management-friendly    interface. This session will walk through the capabilities of Hudson CI with the    NAnt build scripting engine and demo a basic build that performs the build, unit    tests, code complexity tests, and comment notes.</p>",
    "author": "Todd H.",
    "authorBio": "    Todd H. Gardner is a Senior Software Developer at the Toro Company, where he works    in C# and the alt.net community. He is a graduate of the University of Minnesota    Technological Leadership Institute and has a background in application and infrastructure    architecture.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4430000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/661",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2379593Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2379593",
      "@etag": "01000000-0000-CBE3-0000-00000000023B",
      "SerializedSizeOnDisk": 1167
    }
  },
  {
    "eventId": "tccc8",
    "title": "Advanced RIA Services",
    "abstract": "<p>    Anyone that has followed Silverlight in recent months has probably heard that RIA    Services is \"game changing.\" Admittedly, it is pretty cool, but what if you want    to go past the slap-it-together demos everyone is doing on the Internet? What if    I want to tailor RIA Services for my specific needs? How do I minimize my data traffic    to keep my cloud computing costs as low as possible?</p><p>    In this session we will look under the hood for RIA Services and explore how to    manually manipulate RIA Services from code. How do I force one row in my RIA Services    bound datagrid to update, without refreshing the whole page? Where is the RIA Services    cache inside my Silverlight application? How can I access it, what if I want to    remove something from the cache? How can I control filtering from my code? How do    I implement security into my RIA Services? This session will cover these topics    and more.</p>",
    "author": "Scott Davis",
    "authorBio": "    Scott Davis is a seasoned consultant with a decade of consulting experience on both    the Microsoft and Java platforms, involving mostly Web application development.    Recent work for Scott has primarily revolved around Microsoft Silverlight, starting    with the 1.1 Alpha release. Scott has experience in web, desktop, mobility, reporting,    and database design and development, as well as project &amp; staff management. Scott    is currently the owner and principal consultant for Ignition Point Solutions; he    is the leader of the Twin Cities Silverlight User Group; he is the president of    BizLounge, a local entrepreneur group; and he is a member of the adjunct faculty    in the information technology management master's degree program at St Mary's University    in Minneapolis.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4430000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/667",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2379593Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2379593",
      "@etag": "01000000-0000-CBE3-0000-00000000023C",
      "SerializedSizeOnDisk": 2198
    }
  },
  {
    "eventId": "tccc8",
    "title": "Agile Development and Getting Things Done",
    "abstract": "<p>    \"Getting Things Done\" (the personal productivity framework) helps busy professionals    manage their work and goals with a set of personal tools and techniques. Scrum (the    agile software development framework) helps organizations manage the process of    software development with a set of organizational tools and techniques. We'll spend    time introducing and discussing both, and then explore the principles of productivity    they have in common.</p>",
    "author": "Dan Nordquist",
    "authorBio": "    Dan Nordquist is a developer with Popular Front, an interactive marketing agency    in Northeast Minneapolis. Dan has been working with SQL, ASP, and .NET for over    ten years. During this time, he's helped introduce smarter development practices    to a variety of companies.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4430000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/671",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2379593Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2379593",
      "@etag": "01000000-0000-CBE3-0000-00000000023D",
      "SerializedSizeOnDisk": 1229
    }
  },
  {
    "eventId": "tccc8",
    "title": "ASP.NET 4.0 and Visual Studio 2010",
    "abstract": "<p>    Are you ready for another version of ASP.NET and Visual Studio? ASP.NET 4 provides    some major additions to AJAX with greater client support in the way of templates    and the DataView control for data binding. It also remedies several issues that    have existed since version 1.0, including control naming and controls that render    more standard compliant HTML. Dyanamic Data also has changes to make its features    available to all ASP.NET web sites. This release also focuses on easing deployment    issues with web packages and the ability to transform web.config files for deploying    to production servers.</p>",
    "author": "Robert Boedigheimer",
    "authorBio": "    Robert Boedigheimer works for Schwans Shared Services, LLC providing business solutions    with web technologies and leads Robert Boedigheimer Consulting, LLC. Robert has    been designing and developing web sites for the past 15 years including the early    days of ASP and ASP.NET. He is a columnist for aspalliance.com, an ASP.NET MVP,    an author, an \"Early Achiever\" MCSD for .NET with C#, an MCPD: Web with C#, MCPD:    ASP.NET 3.5, and a 2nd degree black belt in Tae Kwon Do. Robert has spoken at industry    conferences including the Heartland Developers Conference, DevLink, DevTeach, Tulsa    Tech Fest, DevWeek, TechEd, AJAXWorld, and numerous national and international events.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4440000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/678",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2389592Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2389592",
      "@etag": "01000000-0000-CBE3-0000-00000000023E",
      "SerializedSizeOnDisk": 1806
    }
  },
  {
    "eventId": "tccc8",
    "title": "ASP.NET MVC and Open Source Tools...Them's Is Like Peas and Carrots",
    "abstract": "<p>    The flexibility ASP.NET MVC framework makes it very easy for web developers to swap    components (in-house, 3rd party or open source) in and out from their applications.    In this session we will assemble different open source tools such as NHibernate,    MvcContrib, MVC Turbine and Windsor Container to create a simple blog engine with    minimal effort.</p><p>    If you're currently using any of these open source tools within your Web Form applications    or you're wondering how fully leverage the separation of concerns MVC offers, then    you should definitely check out this session.</p>",
    "author": "Javier Lozano",
    "authorBio": "    Javier Lozano is an ASP.NET Insider and MVP that specializes in ASP.NET, system    architecture, and training. He has helped co-found the Iowa .NET Users Group as    well as the Iowa Code Camp. On his blog, <a href=\"http://blog.lozanotek.com\" target=\"_blank\">        http://blog.lozanotek.com    </a>, you can find posts on ASP.NET, Silverlight, architecture,    and design patterns just to name a few topics. Javier is an avid supporter of the    community and likes to give back by speaking at user groups, local/regional .NET    events, participating in forums, and by writing articles. In his spare time, Javier    loves spending time with his family and enjoys writing about himself in the third    person.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4440000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/674",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2389592Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2389592",
      "@etag": "01000000-0000-CBE3-0000-00000000023F",
      "SerializedSizeOnDisk": 1831
    }
  },
  {
    "eventId": "tccc8",
    "title": "Developing for Windows Phone",
    "abstract": "<p>    Take a look at how you can get started developing applications for Windows Phone    7 Series using the free downloadable tools that are now available. Starting off    with an overview of the Windows Phone platform, we'll then cover the new application    model, updated control templates, themes, and services available to Windows Phone    applications. We will also cover new input paradigms including multi-touch, software    keyboard, accelerometer and microphone, as well as the APIs to leverage phone applications    like email, phone dialer, contact list and more.</p>",
    "author": "Jeff Brand",
    "authorBio": "    Jeff Brand is a .NET Developer in Microsoft's Developer and Platform Group. Jeff    assists customers in evaluating, developing and deploying applications built on    the .NET Framework and the Microsoft platform. He has been with Microsoft for thirteen    years and has served in variety of roles including infrastructure consultant, e-commerce    technology specialist, and enterprise technology advisor.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4440000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/676",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2389592Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2389592",
      "@etag": "01000000-0000-CBE3-0000-000000000240",
      "SerializedSizeOnDisk": 1456
    }
  },
  {
    "eventId": "tccc8",
    "title": "DIY Project Hosting: Build Your Own Private Codeplex/Sourceforge/Github",
    "abstract": "<p>    When you start a software project and want to collaborate with others, setting up    the tools can be a project unto itself. If the needs of your project happen to match    up exactly with the rules and restrictions of existing open source project hosting    options: Codeplex, Sourceforge, Github, Google Code, etc., those can be a great    choice. However, setting up all of those services, on your own domain, is easier    than you think and can be done on $9/month web hosting while giving you complete    control with few restrictions. In this session, we'll set up git/svn, bug tracking,    project management, blogging, wiki, mailing lists and Jabber instant messenger for    a project on Dreamhost.</p>",
    "author": "J Wynia",
    "authorBio": "    J Wynia is an independent software consultant, writer and geek generalist. He's    been working in the field of IT and software development for 10+ years. When he's    not working on billable software, he is often working on software to solve his own    problems or to enhance any of a wide range of hobbies.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4440000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/665",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2389592Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2389592",
      "@etag": "01000000-0000-CBE3-0000-000000000241",
      "SerializedSizeOnDisk": 1534
    }
  },
  {
    "eventId": "tccc8",
    "title": "Dynamic .NET Demystified",
    "abstract": "<p>    Dynamic .NET is going mainstream with the upcoming promotion of the Dynamic Language    Runtime into .NET 4. This session will discuss what the DLR is, how it works with    C# 4 and Visual Basic 10, and why this doesn't mean C# has jumped the shark. We    will also look at some ways in which these features can be used to solve real-world    problems.</p>",
    "author": "Keith Dahlby",
    "authorBio": "    Keith Dahlby is a .NET developer and language geek from Cedar Rapids, IA. He works    as a software guru at J&amp;J Cycles and blogs about various software development    topics at Los Techies. Keith has spoken at community events around the midwest and    studied Human-Computer Interaction at Iowa State University.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4450000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/679",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2399574Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2399574",
      "@etag": "01000000-0000-CBE3-0000-000000000242",
      "SerializedSizeOnDisk": 1147
    }
  },
  {
    "eventId": "tccc8",
    "title": "Everything You Wanted to Know About Velocity But Were Afraid To Cache",
    "abstract": "<p>    Microsoft's AppFabric Caching (aka Velocity) offers a distributed caching solution,    not unlike the popular \"memcached\" open source library. Come and here about the    concepts and terminology, as well as deployment considerations, typical usage patterns,    pitfalls, and more.</p>",
    "author": "Scott Colestock",
    "authorBio": "    Scott Colestock lives and works in the Twin Cities. He is a partner at Marcato (<a href=\"http://www.marcatopartners.com\" target=\"_blank\">marcatopartners.com</a>),    which focuses on delivering agile coaching services. He is also a BizTalk MVP, performance    engineering guy, and \"Team Foundation Server + Scrum\" resource.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4510000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/673",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2579583Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2579583",
      "@etag": "01000000-0000-CBE3-0000-000000000243",
      "SerializedSizeOnDisk": 1137
    }
  },
  {
    "eventId": "tccc8",
    "title": "Happy Tasty Clojure",
    "abstract": "<p>    Clojure is a dialect of Lisp which runs on the Java Virtual Machine and is designed    for easy integration with existing Java code, and also provides features like software    transactional memory, lazily-evaluated sequences, and more. In this presentation,    I will provide a brief introduction to what Clojure is, and how it can be used.</p>",
    "author": "Kurt Christensen",
    "authorBio": "    Kurt Christensen has been getting paid to write code for 15 years, using a variety    of different programming languages. For the last 7 years he's also been \"coaching    agile teams\" (whatever the hell that means).",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4510000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/672",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2579583Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2579583",
      "@etag": "01000000-0000-CBE3-0000-000000000244",
      "SerializedSizeOnDisk": 1035
    }
  },
  {
    "eventId": "tccc8",
    "title": "HTML5 and CSS3 Today",
    "abstract": "<p>    The future of web development is upon us. Learn how to leverage HTML5 and CSS3 to    improve your web applications and your users' experiences *right now*! In this session,    you'll see how to use new markup, local storage, web sockets, graphics on the canvas,    advanced CSS3 selectors, and you'll also see how to gracefully degrade so that Internet    Explorer users aren't left behind. We'll also discuss hidden benefits, such as improved    accessibility.</p>",
    "author": "Brian Hogan",
    "authorBio": "    Brian Hogan is a a web developer, author, accessibility expert, and technology consultant    living in Eau Claire, Wisconsin. He develops web sites with HTML5, JQuery, and Ruby,    and loves to teach web development techniques to others. He is the author of \"Web    Design For Developers\" and is working on a book about developing accessible sites    with HTML5 and CSS3.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4510000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/664",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2589601Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2589601",
      "@etag": "01000000-0000-CBE3-0000-000000000245",
      "SerializedSizeOnDisk": 1307
    }
  },
  {
    "eventId": "tccc8",
    "title": "HTTP Optimization Lessons From WestlawNext",
    "abstract": "<p>    WestlawNext is the next version of westlaw.com, the leading online legal research    service, launched in February 2010. A heavy AJAX application, we knew we would work    the browser hard. Come learn the tricks we pulled to make the app sing!</p>",
    "author": "Dan Bennett",
    "authorBio": "    Dan Bennett is Senior Director, New Product Technology for Thomson Reuters Core    Legal based in Eagan, MN. A web developer since the mid nineties, Dan led the online    development of WestlawNext and browser optimization efforts in Q3/4 of 2009",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4510000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/670",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2589601Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2589601",
      "@etag": "01000000-0000-CBE3-0000-000000000246",
      "SerializedSizeOnDisk": 984
    }
  },
  {
    "eventId": "tccc8",
    "title": "I Need to Secure My Software...Now What?",
    "abstract": "<p>    We will be discussing where you should go once you have learned that you need to    increase the security within your application. Several Sample applications will    be shown with and without secure practices. The benefits of secure coding will also    be discussed.</p>",
    "author": "Glenn Leifheit",
    "authorBio": "    Glenn Leifheit, CSSLP is a Lead information Security Consultant at FICO (Formerly    Fair Isaac Corporation) with responsibilities in Application Security Architecture    and Secure Software Development. He is also an active member of TechMasters, a Toastmasters    club for technologists.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4510000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/669",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2589601Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2589601",
      "@etag": "01000000-0000-CBE3-0000-000000000247",
      "SerializedSizeOnDisk": 1052
    }
  },
  {
    "eventId": "tccc8",
    "title": "Imposing Order on Chaos with Reactive Extensions",
    "abstract": "<p>    The world of computing is becoming more and more parallel. A lot of the computing    technology that we use is an attempt to hide the chaos of mouse and keyboard events,    messages, and other asynchronous events from our programs. The approaches used to    date have limited succeeded in part by limiting what can be done with parallel processes.    The Reactive Extensions in .NET allow the program logic to handle external events    as first class citizens. Programs can manipulate events using LINQ expressions.</p><p>    Take the example of example of handling a drag-and-drop operation from a source    region of the screen to target region. Without the Reactive Extension logic, this    might take dozens of lines of code to keep track of the state of operation and to    invoke the drop logic at the right time. With Reactive Extensions, you could handle    this in as little as one line of code.</p><p>    The Reactive Extensions are more than a shorthand for multiple lines of code; they    are a different mindset. They provide a way to \"collect\" events and route them to    the appropriate logic in a very simple way. The final bonus is that the Reactive    Extensions provide a way to de-couple the event source from the event consumer in    such a way that unit testing event handling is very simple and understandable.</p>",
    "author": "Jon Stonecash",
    "authorBio": "    Jon Stonecash is a senior consultant at Magenic, a Microsoft Gold Partner consulting    company. Jon Stonecash has worked in software development for much longer than he    would like to admit. In that time Jon has had the opportunity to make most of the    serious software development mistakes at least once. He has programmed in over a    dozen languages including several different assembly languages, Fortran, COBOL,    SNOBOL, classic Visual Basic, VB.NET, and C#. He has survived the structured programming    revolution and the object-oriented revolutions (having inexplicably missed out on    the sexual revolution). Jon's software development activities have included the    development of operating systems, scientific and engineering applications, and enterprise    systems. He has worked in every phase of software development from the initial specification    of requirements through to customer support. Along the way, he picked up a BS in    Mathematics and an MBA. He still has hopes of finding something that he can be reasonably    good at. His long term interests center about databases and the aspects of the application    that handle data access and business logic. He is also interested in the tools and    processes that assist the development process. Jon can be reached at <a href=\"mailto:jons@magenic.com\" target=\"_blank\">jons@magenic.com</a>. Jon also has an active blog on \"Designing    Out Loud in the .NET Space\" at <a href=\"http://blog.magenic.com/blogs/jons/default.aspx\" target=\"_blank\">http://blog.magenic.com/blogs/jons/default.aspx</a>.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4520000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/677",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2589601Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2589601",
      "@etag": "01000000-0000-CBE3-0000-000000000248",
      "SerializedSizeOnDisk": 3422
    }
  },
  {
    "eventId": "tccc8",
    "title": "Introduction to ADO.NET Entity Framework",
    "abstract": "<p>    ADO.NET 3.5's Entity Framework presents us with several new options for accessing    data within our application. EF can be used build applications against a conceptual    model that is mapped to the logic data model. The goal of this session is to provide    an overview of the components provided within the ADO.NET Entity Framework including    EntityClient, Entity SQL, Object Services, the Entity Data Model, and LINQ to Entities.    This session will explore these and other features and will provide several examples    of how to properly apply this technology to your own development project.</p>",
    "author": "Patrick Kragthorpe-Shirley",
    "authorBio": "    Patrick Kragthorpe-Shirley is a Senior Consultant at RBA Consulting with over 10    years of development experience. He is focused on providing enterprise solutions    that leverage Microsoft's .Net technologies while applying best patterns and practices.    Patrick has a BS in computer science from California Lutheran University and is    a Microsoft Certified Application Developer.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4520000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/659",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2599597Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2599597",
      "@etag": "01000000-0000-CBE3-0000-000000000249",
      "SerializedSizeOnDisk": 1494
    }
  },
  {
    "eventId": "tccc8",
    "title": "Introduction to C# 4.0 - Explore the Amazing Possibilities",
    "abstract": "<p>    Come to this introductory talk where we take a look at a new CLR 4.0 feature that    is likely to significantly change the way we code in C#.</p><p>    Do you remember when generics were introduced in the .NET runtime 2.0? That was    the the biggest new feature in that version of the framework and it's almost 5 years    old. Time for a new runtime release with new and exciting features.</p><p>    In this talk, we focus on the only new feature in C# 4 that really matters — the    dynamic keyword. There are some new, amazing possibilities that, previously, were    only elegantly achievable with dynamic languages like JavaScript and Ruby. We will    touch on ways that using dynamic can change the way that you code, including things    like a true ActiveRecord pattern, Expando objects, and more.</p>",
    "author": "Aaron Erickson",
    "authorBio": "    <a href=\"http://nomadic-developer.com/\" target=\"_blank\">Aaron Erickson</a> is a    software developer/technology writer/agilist based out of Chicago, IL, where he    is a Lead Consultant for ThoughtWorks. His life's work is to help convert the human    intellectual capital into results for companies that empower both the knowledge    workers who produce software, and the people for whom that software is designed    to serve. He frequently speaks at events such as TechEd, DevTeach, VSLive, and .NET    user groups - with a goal of furthering the exchange of ideas - be they technology    contributions - or observations about the technology consulting business.<p>    He is a co-author of the upcoming book, <a href=\"http://www.amazon.com/Professional-F-1-0-Ted-Neward/dp/047052801X\" target=\"_blank\">Professional F#</a>. He is also the author of the book, <a href=\"http://www.amazon.com/Nomadic-Developer-Surviving-Technology-Consulting/dp/0321606396\" target=\"_blank\">The Nomadic Developer</a>, a career guide for technology consultants.    In his spare time he likes to buy random ingredients at the store and have \"iron    chef\" night with his wife, play video games with his kids, and occasionally, log    on to World of Warcraft where he has a level 80 Rogue named EffSharper on the Bloodscalp    server.</p>",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4530000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/655",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2599597Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2599597",
      "@etag": "01000000-0000-CBE3-0000-00000000024A",
      "SerializedSizeOnDisk": 2649
    }
  },
  {
    "eventId": "tccc8",
    "title": "Introduction to Developing with Android",
    "abstract": "<p>    In this session, Donn will delve into the basic requirements for you to get started    with Android development. We will cover the architecture of the Android operating    system as well as some ins-and-outs of Android mobile development. Starting with    the basic install (Eclipse and Android SDK) an actual Android Application will be    created during this session that will be published to the Android Marketplace in    real time. A general understanding of the Java language is advised but not required.</p>",
    "author": "Donn Felker",
    "authorBio": "    Donn Felker is an independent consultant with over 9 years of professional experience    in various markets that include – entertainment, health, retail, insurance, financial,    and real estate. He is a Microsoft ASP Insider, an MCTS in Web Client Development    for .NET 2.0 and 3.5 and is also a certified ScrumMaster. He is the founder and    coordinator of the Twin Cities Give Camp, leader of the Twin Cities Developers Guild    and the founder of Twin Cities Pragmatic Beer. He is also a writer, presenter and    consultant on various topics ranging from architecture, development in general,    agile practices and patterns &amp; practices. Follow Donn on twitter: @donnfelker or    read his blog here: <a href=\"http://blog.donnfelker.com\" target=\"_blank\">http://blog.donnfelker.com</a>.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4540000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/656",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2599597Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2599597",
      "@etag": "01000000-0000-CBE3-0000-00000000024B",
      "SerializedSizeOnDisk": 1802
    }
  },
  {
    "eventId": "tccc8",
    "title": "Introduction to Distributed Source Control with Mercurial",
    "abstract": "<p>    Distributed source control systems have become popular in the last several years,    but they have just recently gained popularity in the .NET/Windows space. CodePlex,    Microsoft's open source code hosting website, recently added support for Mercurial    as an alternative to Team Foundation Server(TFS). This is an exciting change for    people wanting to take advantage of a distributed source control tool. In this talk    I'll introduce you to TortoiseHg which is a Windows shell tool for interacting with    Mercurial. We'll cover the basic command-line options like init, clone, push, pull,    log and status. Then we'll examine how to perform the same actions with hgtk commands,    which offer clean graphical interfaces to perform the same actions. In the second    part of the talk we'll look at how to use branching and merging well. And we'll    finish up by discussing what makes distributed source control different from centralized    systems like Subversion and how it can change your source control workflow.</p>",
    "author": "Chris Sutton",
    "authorBio": "    Chris Sutton is a software developer and technical trainer in Eastern Iowa. He helps    run CRineta.org in Cedar Rapids, Iowa and he co-founded the Iowa Code Camp in 2008.    Chris is a Microsoft MVP, a Microsoft Certified Trainer (MCT) and holds the MCPD:Enterprise    certification. He has been consulting and speaking on web related topics since the    beginning of 2005 and loves developing for the web. He also enjoys hiking and biking    in the summer with his family and snowshoeing in the winter.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4540000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/657",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2667984Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2667984",
      "@etag": "01000000-0000-CBE3-0000-00000000024C",
      "SerializedSizeOnDisk": 2042
    }
  },
  {
    "eventId": "tccc8",
    "title": "Introduction to Go",
    "abstract": "<p>    Go is a brand-spanking-new systems language that Google released in November, 2009.    Every wonder how awesome C would be if it was garbage-collected, concurrent, and    didn't take a few weeks to compile? Wake up; it's here! We'll take a look at this    new language that steals some of the dynamic flexibility of Python and Ruby, the    performance of C, and a compile time that you'll miss if you blink.</p>",
    "author": "Kevin Gisi",
    "authorBio": "    <a href=\"http://www.kevingisi.com\" target=\"_blank\">Kevin W. Gisi</a> is a Ruby developer    in Eau Claire, Wisconsin. Co-founder of the Eau Claire Ruby User Group, he co-organized    the Chippewa Valley Ruby Camp. Kevin has a strong interest in promoting community    involvement in technology, and is currently one of the organizers for the Rails    Rumble annual competition.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4600000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/658",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2669563Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2669563",
      "@etag": "01000000-0000-CBE3-0000-00000000024D",
      "SerializedSizeOnDisk": 1258
    }
  },
  {
    "eventId": "tccc8",
    "title": "Kanban to Cash: Stolen Ideas Make A Beautiful Process",
    "abstract": "<p>    This is an \"Open Kimono\" type discussion about the process I've been using/adapting    for the last few years. We take the Kanban ideas of Limited WIP and cumulative flow    diagrams and add Arlo Belshee's Naked Planning, modified a very little for integrating    with TDD/BDD and meld some XP practices and Agile practices together to make a development    process that is easy to do and easy to change as we feel friction.</p>",
    "author": "Lee Brandt",
    "authorBio": "    Lee Brandt is a Project Lead Consultant for Adventure Tech Group, Inc. in Kansas    City. Lee has been programming professionally for more than a decade and developing    solutions in .NET and C# since the early beta releases. He is an advocate for behavior    driven development, design patterns and lean software methodologies. Lee spends    most of his free time reading about programming, discussing process and hanging    out with his wife Stacey and their dog (daughter) Frieda.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4600000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/675",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2669563Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2669563",
      "@etag": "01000000-0000-CBE3-0000-00000000024E",
      "SerializedSizeOnDisk": 1415
    }
  },
  {
    "eventId": "tccc8",
    "title": "Loose Coupling - Understanding Dependency Injection and Inversion of Control",
    "abstract": "<p>    As enterprise software development has evolved we have identified patterns and practices    that help us write more extensible and maintainable applications. Patterns with    the names of Dependency Injection and Inversion of Control have emerged to simplify    the reuse of existing components and aide us in wiring together disparate components.    Frameworks have been built to support these patterns. This presentation will explain    the patterns and enable you to build your own custom framework or review existing    frameworks to meet your needs.</p>",
    "author": "Shannon Braun",
    "authorBio": "    <a href=\"http://www.sysknowlogy.com/\" target=\"_blank\">Shannon Braun</a> is an independent    consultant and founder of Sysknowlogy, which provides consulting and development    services using Microsoft technologies. Shannon focuses on assisting corporations    adopt Microsoft technologies and has helped companies solve business problems with    Microsoft .NET, BizTalk, Commerce Server, SharePoint, Windows Presentation Foundation    (WPF) and Web Services. Shannon has served as a member of the .NET Partner Advisory    Committee, Microsoft Architecture Partner Board, Microsoft Architecture Advisory    Board and is currently a member of the Visual Studio Partner Advisory Board. Shannon    has been nominated both as a Microsoft Solution Architect MVP and a Microsoft Client    Application Development MVP.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4600000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/666",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2669563Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2669563",
      "@etag": "01000000-0000-CBE3-0000-00000000024F",
      "SerializedSizeOnDisk": 1900
    }
  },
  {
    "eventId": "tccc8",
    "title": "Regular Expressions for Fun and Profit",
    "abstract": "<p>    The Regular Expression is one of the most powerful, yet least understood features    of any programing language. In this session, we'll cover:</p><ul>    <li>The basic internals of the Regex engine</li>    <li>Regex Gotchas, Tips and Tricks</li>    <li>How to format your regexes to be much more programmer friendly</li>    <li>Input data validation</li>    <li>When to use code instead of regexes</li>    <li>Regular expression tools</li>    <li>How to save boat loads of time with complex text manipulation</li></ul><p>    While the some of the demos will use Visual Studio, the session is intended for    developers of all languages that support Regular Expressions, regardless of their    familiarity with the subject.</p>",
    "author": "Jon von Gillern",
    "authorBio": "    Jon von Gillern is a consultant and owner of Nitriq Code Analysis, a tool that helps    .net developers better understand their code base and helps enforce rules to keep    their code clean. He has been programming for over 14 years and in his free time    enjoys politics, poker and paintball. You can read his blog at <a href=\"http://blog.nitriq.com\" target=\"_blank\">blog.nitriq.com</a>.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4600000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/662",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2679599Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2679599",
      "@etag": "01000000-0000-CBE3-0000-000000000250",
      "SerializedSizeOnDisk": 1610
    }
  },
  {
    "eventId": "tccc8",
    "title": "RESTing in the ASP.NET MVC Framework",
    "abstract": "<p>    This session is for the advanced developer looking to break into RESTful services    utilizing the ASP.Net MVC framework. The attendee will come away with a good knowledge    of how and what a REST service is; and how to build one utilizing MVC 2.0 and VS    2010. The session will also cover the third-party frameworks, Open RASTA and Siesta    frameworks that are built upon ASP.Net and the MVC Framework.</p>",
    "author": "Gus Emery",
    "authorBio": "    Gus Emery is a consultant in the Twin Cities ares with over fifteen years experience    architecting and implementing highly-scalable ASP.Net applications and distributed    n-tiered applications across a broad array of industries within the Twin Cities    area. Gus has been working with Visual Basic since v3.0 and .Net since Beta #1,    and loves to seek out new and exciting technologies to serve his customers technological    needs! He has also been very active as a conference speaker, which he loves to do    in his spare time.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4610000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/668",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2679599Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2679599",
      "@etag": "01000000-0000-CBE3-0000-000000000251",
      "SerializedSizeOnDisk": 1429
    }
  },
  {
    "eventId": "tccc8",
    "title": "What's New in CSLA .NET 4.0",
    "abstract": "<p>    CSLA .NET is a widely used .NET development framework focused on helping you build    a powerful OO business layer for Windows and web applications. CSLA .NET 4.0 supports    Visual Studio 2010, .NET 4.0 and Silverlight 4, and includes many new and exciting    features and enhancements that make the framework and your overall development experience    productive and enjoyable. Learn about the new features and changes and how they    enable the creation of amazing applications using ASP.NET MVC, Silverlight 4 and    WPF.</p>",
    "author": "Rockford Lhotka",
    "authorBio": "    Rockford Lhotka is the creator of the popular CSLA .NET development framework, and    is the author of numerous books, including Expert C# 2008 Business Objects and Expert    VB 2008 Business Objects. He is a Microsoft Regional Director, MVP and INETA speaker.    He contributes to several major magazines and regularly presents at major conferences    around the world. Rockford is the Principal Technology Evangelist for <a href=\"http://www.magenic.com\" target=\"_blank\">Magenic</a>, a company focused on delivering business value through    applied technology and one of the nation's premiere Microsoft Gold Certified Partners.    For more information go to <a href=\"http://www.lhotka.net\" target=\"_blank\">www.lhotka.net</a>.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4610000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/660",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2679599Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2679599",
      "@etag": "01000000-0000-CBE3-0000-000000000252",
      "SerializedSizeOnDisk": 1744
    }
  },
  {
    "eventId": "tccc8",
    "title": "WPF with MVVM: From the Trenches",
    "abstract": "<p>    MVVM is gaining popularity, especially in the WPF world. An MVVM approach will give    you a lot of benefits if you know how to leverage it. In this session, we will discuss    the benefits and pitfalls of implementing MVVM with WPF using examples based on    real world situations encountered during development of an application leveraging    MVVM. With topics ranging from data templates to event handlers to testable navigation,    the goal will be to beef up your arsenal with tips and tricks that you can use in    the great battle.</p>",
    "author": "Brent Edwards",
    "authorBio": "    Brent Edwards is a Consultant for Magenic, a Microsoft Gold Partner consulting company.    Brent has been knocking around the .NET world for over five years, working on projects    ranging from ASP.NET MVC with C# and jQuery to WPF with VB.NET. When not cranking    out code, you can find him hanging out with his wife and three kids or riding his    wakeboard, snowboard or mountain bike.",
    "authorEmail": null,
    "authorUrl": "",
    "authorTwitter": "",
    "authorGitHub": null,
    "room": "",
    "hour": 0,
    "pictureUrl": "",
    "tags": [],
    "submissionDate": "2019-02-19T18:30:39.4610000Z",
    "ravenMetadata": {
      "Raven-Entity-Name": "Talks",
      "Raven-Clr-Type": "TwinCitiesCodeCamp.Models.Talk, TwinCitiesCodeCamp",
      "@id": "talks/663",
      "Temp-Index-Score": 1.35615563,
      "Last-Modified": "2019-02-22T20:09:40.2679599Z",
      "Raven-Last-Modified": "2019-02-22T20:09:40.2679599",
      "@etag": "01000000-0000-CBE3-0000-000000000253",
      "SerializedSizeOnDisk": 1414
    }
  }
]